{"id":1189,"date":"2018-03-26T10:01:28","date_gmt":"2018-03-26T10:01:28","guid":{"rendered":"https:\/\/applicature.com\/?p=1189"},"modified":"2022-01-11T19:11:50","modified_gmt":"2022-01-11T19:11:50","slug":"erc20-token-economics","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics","title":{"rendered":"Ether Token Guide: ERC20 Token Smart Contract and Economics"},"content":{"rendered":"<h2>The ERC20 Token<\/h2>\n<p>Ether token smart contract platform is one the main smart contract platforms for current Initial Coin Offerings (ICOs) to create their own tokens. The ERC20 token smart contract is the most popular.<\/p>\n<p>This generates the necessity of token guide to understand what is ERC20 and the list of ERC20 tokens.<\/p>\n<p>As a result of issuing token technical specifications on the Ethereum blockchain in 2015, ERC20 tokens (ERC stands for Ethereum Request for Comments) were developed by Vitalik Buterin, the founder of Ethereum, with the help of Fabian Vogelsteller. Now, it is one of the most marketable token standards!<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1191 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/03\/ico-11-1.png\" alt=\"erc20 token smart contract\" width=\"1365\" height=\"924\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ico-11-1.png 1365w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ico-11-1-350x237.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ico-11-1-500x338.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ico-11-1-768x520.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ico-11-1-1024x693.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ico-11-1-600x406.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ico-11-1-132x89.png 132w\" sizes=\"(max-width: 1365px) 100vw, 1365px\" \/><\/p>\n<p>ERC20 tokens were designed on the Ethereum platform. Because of this, it’s much easier to integrate the design and function of the tokens with other projects in the ecosystem. They can be used with different tokens and their own specific functionalities. Additionally, as an Ethereum-based token, ERC20 on the foundation of smart contracts enables you to program custom specifics of the token instead of developing a custom blockchain from scratch.<\/p>\n<p>Today, more than 8,631 ERC20 token contracts have been created on <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/etherscan.io\/\" rel=\"noopener\">Etherscan.io<\/a><\/span>. Check out this platform, as it is designed for a full understanding of Ethereum’s blockchain and different ERC20 tokens. It is recommended to create own tokens on one of three test nets: <em>Ropsten<\/em>, <em>Kovan<\/em>, or <em>Rinkeby<\/em>. Learn more about a test and main nets <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/uses-for-smart-contract\" rel=\"noopener\">here<\/a><\/span>.<\/p>\n<p>ERC20 contains seven functions and two events. Developers recognized these as the minimal set for normal operation within the Ethereum ecosystem. They manage the process of token transfer, and access data about a token that users can review. In this way, tokens of different types will typically work the same.<\/p>\n<ul>\n<li>Compliance<\/li>\n<\/ul>\n<p>Using the ERC20 standard provides the possibility of creating a token exchange system that enhances token liquidity. Accordingly, this will reduce the complexity of the process of token release while adding a new token to a platform. Also, the system can support trade between tokens A and B, A and C, A and Z, and Z and M, regardless of their quantity.<\/p>\n<p>Most ICOs are trading on exchanges that exclude the importance of live communication.<\/p>\n<ul>\n<li>Allowance<\/li>\n<\/ul>\n<p>With this function, two addresses can be created repeatedly and can be transferred unidirectionally. The wallet address of a token owner and a wallet are involved in transactions as two separate wallets.<\/p>\n<ul>\n<li>Approval<\/li>\n<\/ul>\n<p>The <em>Approve<\/em> function offers functionality allowing an owner’s wallet to verify a transaction and indicate it as his own. It can be implemented within two parameters: the address of the owner and the number of tokens that are going to be sent. It gives a definitive answer to whether it is confirmed or not.<\/p>\n<ul>\n<li>Balance<\/li>\n<\/ul>\n<p>This function is designed to accept the input parameter of an address (token owner) and get a single public constant (unit balance). It indicates the total number of tokens the specific address contains. Be careful, because the transactions are usually visible.<\/p>\n<ul>\n<li>Total Supply<\/li>\n<\/ul>\n<p>The <em>Total Supply<\/em> function shows the environment of the smart contracts. As a rule, it can be defined in two ways:<\/p>\n<ol>\n<li>hardcoding a variable<\/li>\n<li>making transactions from the wallet of origin<\/li>\n<\/ol>\n<ul>\n<li>Transfer<\/li>\n<\/ul>\n<p>The <em>Transfer<\/em> function is the key feature, as it ensures direct funds transfer according to the receiver’s address and the number of tokens being sent. The transfer return value is supplied as a report on receipt of the tokens.<\/p>\n<ul>\n<li>Transfer From<\/li>\n<\/ul>\n<p>This function is implemented by the address of the wallet owner, the address of the receiving wallet, and the number of tokens sent. Accordingly, smart contracts carry out a transfer within parameters passed on behalf of the wallet owner. Also, the wallet owner can directly send tokens to an address. The output function indicates the success or failure of the transaction.<\/p>\n<p>All functions are executed by the Ethereum Virtual Machine, powered by the computational power of every Ethereum node. This introduces to ERC20 tokens the ability to be involved in automatization of complex business processes and tasks in cloud-like virtual machines. For now, Ethereum is the second-largest blockchain, with thousands of nodes working as a distributed data center. If you deploy a new blockchain and struggle for node computational power to connect to the network, Ethereum already has it and provides this power to ERC20 tokens.<\/p>\n<p>Seek out more information concerning <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/erc20-wallet\" rel=\"noopener\">ERC20 tokens<\/a><\/span> for deeper insights. Smart contracts are designed to exchange money, property, and shares, and they are self-executing. Discover great food for thought about the advantages of <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/uses-for-smart-contract\" rel=\"noopener\">smart contracts<\/a><\/span>!<\/p>\n<h2>What Is Token Economics?<\/h2>\n<p><em>Token economics<\/em> describes tokenized ecosystems and stimulates customers to make desired economic decisions and\/or start behaving in a manner appropriate to the new ecosystems. There are different economic, psychological, social, cognitive, and emotional factors that impact customers’ success. This represents a crucial component of consensus for any token. While technical consensus depends upon mining rules and cryptography function, the economic component is unique (or almost unique) for each token. For example, in Bitcoin, economic consensus relies upon agreement between users that Bitcoin has real value. For other tokens, it could be the value of flight miles, the data value hashed in the token, etc.<\/p>\n<h2>Types of Tokens<\/h2>\n<p>First of all, everyone has to know the types of tokens available in order to define their value and decide whether they will be a wise investment. Let’s consider the main types:<\/p>\n<ul>\n<li><em>Asset tokens<\/em> are useful for representing an actual product or asset. Their popularity has recently increased. On the other hand, they are not in demand among investors because they depreciate the token. This is why customers should check them properly to define their perspective.<\/li>\n<li><em>Utility tokens<\/em> are basic crypto tokens for working in a network. This includes intersystem currency, access keys, identity features, etc. Ethereum is worth mentioning here, as it can code and run smart contracts working on the global blockchain.<\/li>\n<li><em>Equity tokens<\/em>, like stocks, provide the owner with something. The more people buy them, the more profitable they can be.<\/li>\n<\/ul>\n<p>Each type of token is popular and useful. However, the success of purchase depends upon its type, which has to meet all necessary requirements. A token must:<\/p>\n<ul>\n<li>be attractive to the customer, and be endowed with the required features for users to hold them over the long-term<\/li>\n<li>develop a product that is interesting and promising<\/li>\n<li>have the appropriate potential for growth:<\/li>\n<\/ul>\n<ol>\n<li>total supply, as well as initial price, cannot be too high<\/li>\n<li>be additional token minting can’t take place, as the total supply could grow as a result<\/li>\n<li>provide enough interest in the token to grab people’s attention.<\/li>\n<\/ol>\n<ul>\n<li>incentive mechanism for computational power. In addition to users of the token, you need someone who will provide mining power or another type of value to the token, and this must be rewarded.<\/li>\n<\/ul>\n<p>The white paper describes the way the token is going to exist on the platform. All features have to be planned ahead. Decide whether it is transferable, or if it will have any other essential features. All of this information helps develop token specifications to create a smart contract. Contact <a href=\"https:\/\/applicature.com\/\" rel=\"noopener\">us<\/a> for a professional written smart contract and\/or white paper to present your ICO in the best possible way! And after that, it will be implemented on the smart-contract side.<\/p>\n<p>Usually, tokens collect money for carrying out a project. This can be done in different ways. For example, Applicature collected tokens during an ICO campaign, and, as a result, produced elektro cars. Then, investors who had tokens bought them at a discount. Users can also exchange the token for money.<\/p>\n<p>It follows that a token must be attractive to engage users. To attract their attention, a token has to possess a passionate vision and bring a unique project idea. It has to spread a driving mission to change the world within its specific ecosystem or industry.<\/p>\n<p>Of course, the most important developments in the world are happening because of people who live like a modern Moses: truly passionate communicators who not only do their jobs well while creating a massive impact but also live according to their own high standards and play a crucial role in any project. People will listen to someone like this with their full attention, and remember, follow, and trust them. They can change the lives of thousands.<\/p>\n<p>One of these people is Vitalik Buterin, co-founder of Ethereum. Check out this <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.youtube.com\/watch?v=0lJDy5wvwaU\" rel=\"noopener\">video explanation<\/a><\/span> of the Ethereum system. It’s pretty easy to understand.<\/p>\n<h2>The Evolution of Coins<\/h2>\n<p>Bitcoin is an expensive cryptocurrency, complicated to obtain and slow to transfer. It is also limited and finite, which makes it a long-term investment. Bitcoin limitations are mainly related to the technical consensus protocol called Proof of Work.<\/p>\n<p>Proof-of-Work(PoW) is an original technical consensus algorithm in a blockchain network. It is used to verify transactions, produce new blocks for the chain, and protect it from cyber-attacks. PoW rewards miners who solve mathematical problems —⁀with useless results, but with the value created by the mining process. The key idea is to ensure the system that the miner is a real computer that provides computational power for the network. Incentives for mining include rewards for block mining and transaction fees for transaction processing and packaging in a new block. This process is time- and energy-consuming, however, as thousands of miners are working simultaneously on the same task, and the reward will only be received by the one who accomplishes the task first.<\/p>\n<p>Did you know that Ethereum already launched <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/ethereum-proof-of-stake-implementation\" rel=\"noopener\">the Proof of the Stake Consensus Protocol<\/a><\/span>, on January 22, 2018? Read the great description of this fantastic event!<\/p>\n<p>In general, Proof-of-Stake, or PoS, doesn’t reward the miner, as he is chosen by his wealth (stake). Because of this, miners take transaction fees. Nodes that verify blocks with their stake are also responsible for it. If a node validates a block containing a fraudulent transaction, the person will lose his total stake, while the node that found the fraud will receive a reward. As a result, nodes are interested in competing with each other. As Vitalik Buterin describes: it is like an accountant who signs transactions, but if he cheats, his own house will be burned.<\/p>\n<p>Look through the benefits of the PoS system in comparison with the PoW system.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-1194 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/03\/infographics2017-01.jpg\" alt=\"token guide: PoS system in comparison with the PoW system\" width=\"1425\" height=\"1600\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/infographics2017-01.jpg 912w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/infographics2017-01-312x350.jpg 312w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/infographics2017-01-445x500.jpg 445w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/infographics2017-01-768x862.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/infographics2017-01-600x674.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/infographics2017-01-98x110.jpg 98w\" sizes=\"(max-width: 1425px) 100vw, 1425px\" \/><\/p>\n<p>Tokens are more than just a currency. They represent a unit of value in some other context, as well. Token features are similar to Bitcoin, but on the other hand, they are developed for use in a broader range of applications.<\/p>\n<p>With PoS ERC20, tokens will be faster, and able to provide more value for platform users. The token economy also will be changed, as you’ll have no need to involve more nodes. The amount of each transaction will be the major driver for system growth, not its structure.<\/p>\n<h2>Game Theory<\/h2>\n<p>Consensus between network users is achieved through the complicated mathematics of game theory. Incentivization can achieve its aims only when users receive value from tokens through positive behavior.<\/p>\n<p><em>The Evolution of Trust<\/em> by Nicky Case describes the most common types of behavior when it comes to cheating vs. cooperation. This is a frequent phenomenon in a blockchain system because it helps to uncover solutions in difficult situations, and, of course, predict the next step of the opponent.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-1195 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/03\/Снимок.png\" alt=\"The game of trust token guide\" width=\"404\" height=\"287\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Снимок.png 404w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Снимок-350x249.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Снимок-132x94.png 132w\" sizes=\"(max-width: 404px) 100vw, 404px\" \/><\/p>\n<p>Imagine there is a special machine, and two players each have a coin. They both have to choose: to cooperate or to cheat.<\/p>\n<p>If two players insert one coin, they both have two coins. In this way, positive behavior always gets a reward, and their transaction will be successful.<\/p>\n<p>If someone withholds his coin, he has three coins. Here, cheating is represented as the best solution, because in this case, at least you won’t lose. But the world is a balanced system. The rule of the boomerang always works. Sooner or later, everything you do will come back to you.<\/p>\n<p>If both of the players cheat, they won’t earn a profit. So, bad behavior is restricted by system design (i.e., fake transactions will not be validated due to consensus.)<\/p>\n<p>Two types of player behavior can result from this theory:<\/p>\n<ol>\n<li>People who cheat if they lose<\/li>\n<li>People who just copy the action of the opponent<\/li>\n<\/ol>\n<p>There are some derivative behavior styles, and cheating is becoming riskier. In contrast, some players use the tactic of forgiveness and cooperation. This helps both to find the optimal way to avoid falling into the logical game’s trap.<\/p>\n<p>With the evolution of trust, the most popular mistakes people make lead them to lose, and repeated actions with other players can be recognized. Check out this very interesting <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.youtube.com\/watch?time_continue=168&amp;v=S0qjK3TWZE8\" rel=\"noopener\">episode<\/a><\/span> about “the split or steal game” on the popular TV show <em>Golden Balls<\/em>. This video demonstrates that the most genius games are mind games. Obviously, the best tactic is to assure the opponent that there is only one variant to choose, which inevitably leads you to win.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The ERC20 Token Ether token smart contract platform is one the main smart contract platforms for current Initial Coin Offerings (ICOs) to create their own tokens. The ERC20 token smart contract is the most popular. This generates the necessity of token guide to understand what is ERC20 and the list of ERC20 tokens. As a [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":173940,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[192,194,268],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"Nowadays, ether token, especially erc20 token smart contract, is gaining more and more credibility and popularity from the customers. Let&#039;s discover deeply what is ERC20 and the list of ERC20 tokens, using token guide.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"Nowadays, ether token, especially erc20 token smart contract, is gaining more and more credibility and popularity from the customers. Let&#039;s discover deeply what is ERC20 and the list of ERC20 tokens, using token guide.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-03-26T10:01:28+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T19:11:50+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/29693466_10208884125980003_1780353795_o.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"550\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/17.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/#primaryimage\"},\"datePublished\":\"2018-03-26T10:01:28+00:00\",\"dateModified\":\"2022-01-11T19:11:50+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"Nowadays, ether token,\\u00a0especially erc20 token smart contract, is gaining more and more credibility and popularity from the customers. Let's discover deeply what is ERC20 and the list of ERC20 tokens, using token guide.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/erc20-token-economics\/\",\"name\":\"Ether Token Guide: ERC20 Token Smart Contract and Economics\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/1189"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=1189"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/1189\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173940"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=1189"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=1189"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=1189"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}