{"id":1361,"date":"2018-04-14T16:48:32","date_gmt":"2018-04-14T16:48:32","guid":{"rendered":"https:\/\/applicature.com\/?p=1361"},"modified":"2022-02-01T09:15:29","modified_gmt":"2022-02-01T09:15:29","slug":"ico-analysis-projects-that-raised-the-most-money","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money","title":{"rendered":"Best IDOs: Projects most Effective in Funding"},"content":{"rendered":"<p>An initial coin offering (IDO) is the perfect tool for those who are searching for innovation and global change. Developers, entrepreneurs, and investors combine their efforts to bring their projects to life, despite regulatory uncertainties and a cautious atmosphere. Undoubtedly, IDOs have changed the financial landscape over the past two years.<\/p>\n<p>An IDO is an application enabled by blockchain technology and the token-based economic model. An IDO is quite similar to an IPO, which occurs when company shares are sold to investors. In an IDO, owners sell tokens. Another important distinction is that cryptocurrency units can be sold to the public, which is impossible with an IPO.<\/p>\n<h2>IDO Market in 2017<\/h2>\n<p>There were more than <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/icobench.com\/icos?page=227&amp;filterSort=ending-asc\" target=\"_blank\" rel=\"noopener noreferrer\">2,500<\/a><\/span> IDOs as of April, 2018. The total value of all cryptocurrency market capitalization is approximately $250 billion ( as of April, 4th according to <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/coinmarketcap.com\/charts\/\" target=\"_blank\" rel=\"noopener noreferrer\">Coinmarketcap<\/a><\/span>), and is expected to hit the mark of <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.cnbc.com\/2018\/02\/13\/cryptocurrency-market-to-hit-1-trillion-valuation-in-2018-kraken-ceo.html\" target=\"_blank\" rel=\"noopener noreferrer\">$1 trillion<\/a><\/span> in 2018.<\/p>\n<p>Let’s go further by providing some insights, with a breakdown of the numbers in terms of capital raised. According to a recent joint FabricVentures x TokenData report:<\/p>\n<ol>\n<li>$5.6 billion was raised in token sales in 2017, compared to $240 million in 2016. This represents 435 projects and startups.<\/li>\n<li>More than 900 token sales were planned and active at some point in 2017. The gap is due to 131 projects that didn’t manage to meet the minimum threshold, and 347 sales that did not report the end result of their token sales. TokenData was unable to gather the information from at least two independent sources or token-sale websites that have simply disappeared.<\/li>\n<li>Capital raised: $12.7 million.<\/li>\n<li>The overall number of IDOs increased steadily throughout 2017.<\/li>\n<li>52% of token sales reported failing to reach their target, or just disappeared.<\/li>\n<li>Overall, tokens still outperformed ETH\/BTC; this was mostly due to a handful of big outperformers.<\/li>\n<li>The ten largest token sales raised 25% of all capital. This is supported by a closer look at the top ten completed token sales of 2017. Together, the ten largest sales raised approximately $1.4 billion, about 25% of the total capital raised during the year.<\/li>\n<li>Europe is actually ahead of the U.S. in terms of funding.<\/li>\n<li>Highly distributed teams represent about around 70% of IDOs, with project founders in multiple countries.<\/li>\n<\/ol>\n<p>PitchBook&#8217;s latest <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/files.pitchbook.com\/website\/files\/pdf\/PitchBook_1Q_2018_Analyst_Note_Quarterly_Crypto_Update.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">crypto research note<\/a><\/span> focuses on an assessment of financing sources for blockchain companies.<br \/>\nKey highlights include:<\/p>\n<ul>\n<li>VC investment in blockchain startups reached $911 million in 2017, an 88% YoY jump.<\/li>\n<li>Investors poured 50% more into token sales (IDOs) during December alone than VCs invested in the crypto space in all of 2017.<\/li>\n<li>In response to regulatory action on IDOs, early-stage investors will demand equity in addition to rights to discounts on tokens.<\/li>\n<\/ul>\n<h2>How to Keep Track of Various IDOs<\/h2>\n<p>The IDO environment is developing rapidly. An incredible number of web services and digital businesses are emerging to monitor the market, discuss the latest crypto news, and plan, analyze, manage, develop, or run IDOs.<\/p>\n<p>How do you keep an eye on the various IDOs that are created? To dive into this financial phenomenon in a well-thought-out manner, keep track of the following resources, and select the ones appropriate for you:<\/p>\n<ul>\n<li>IDOBench<\/li>\n<li>Bitcointalk forum<\/li>\n<li>CoinSchedule<\/li>\n<li>IDO List<\/li>\n<li>IDO Rating<\/li>\n<li>Ambisafe<\/li>\n<li>Token Market<\/li>\n<li>IDO Tracker<\/li>\n<li>IDO Now<\/li>\n<li>Reddit&#8217;s IDO Crypto forum<\/li>\n<\/ul>\n<p>Different platforms provide different indexes, but mainly, those include investment ratings, hype score, and risk score based on team, product, and vision evaluation.<\/p>\n<h2>Catching the Giants: Best in Funding IDOs Analysis<\/h2>\n<p>To get your brain melting: the startup <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/cointelegraph.com\/news\/singularitynet-announces-36mln-ico-funding-for-ai-platform-expansion\" target=\"_blank\" rel=\"noopener noreferrer\">SingularityNET<\/a><\/span> has reached the unprecedented result of raising $36 million in less than one minute (24 seconds!!!). Their tokens (AGI) were completely sold out. Though this is a tremendous amount of money, it seems obvious considering the interest. Demand was five times greater than expected: 20,000 registrations by those eager to buy tokens worth $361 million. This massive oversubscription was the reason why the company reduced the number of contributors to a more controlled level:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1993 size-large\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/Quote_best-performing_ICO-1024x178.png\" alt=\"quote best performing icos\" width=\"1024\" height=\"178\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/Quote_best-performing_ICO.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/Quote_best-performing_ICO-350x61.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/Quote_best-performing_ICO-500x87.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/Quote_best-performing_ICO-768x134.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/Quote_best-performing_ICO-600x104.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/Quote_best-performing_ICO-132x23.png 132w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>Incredible fact! Not one cent was paid to investment bankers or venture capitalists. That’s an impressive result in terms of time.<\/p>\n<p>The table below highlights ICO projects that amazed us with their achievements in terms of quantity:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-1365 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money.png\" alt=\"ico review projects that raised most money\" width=\"1130\" height=\"588\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money.png 1130w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money-350x182.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money-500x260.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money-768x400.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money-1024x533.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money-600x312.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/ICOs-that-raised-most-money-132x69.png 132w\" sizes=\"(max-width: 1130px) 100vw, 1130px\" \/><\/p>\n<p>Source: Applicature research<\/p>\n<p>Let’s recap just some of them. Because all fundraisers are required to post specific and detailed info, it makes it possible to investigate each project and develop an overall understanding of the features that enabled them to attract contributors and raise funds.<\/p>\n<h3>1. Filecoin<\/h3>\n<p>During its token offering campaign in September 2017, <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/filecoin.io\/\" target=\"_blank\" rel=\"noopener noreferrer\">Filecoin<\/a><\/span> raised over $257 million. Prior to this, the world’s leading blockchain venture capital investors (Union Square Ventures, Andreessen Horowitz, and the Digital Currency Group) backed up the project with $52 million. The aim of the Filecoin project is to build a decentralized cloud storage network. This is planned to be achieved by using the InterPlanetary File System to securely record and store data on a no-middlemen basis.<br \/>\nThis ICO stands out because it complies with the new SEC regulations on ICOs. Only contributors with accreditation will be able to participate in its token sale.<\/p>\n<p><strong>Why did it work?<\/strong> Not only was Filecoin the first regulatory-compliant initial coin offering in the U.S., the project also offers a top-tier technological solution for a growing market. Furthermore, the project had previously raised investments from several of the world’s leading blockchain venture capital investors ahead of the ICO. This gave the project the needed stamp of approval to raise the staggering amount they were able to secure during the token sale.<\/p>\n<p><strong>Tips for mastery:<\/strong><\/p>\n<ul>\n<li>A project that provides an innovative solution for a growing market with real-world demand has a good chance of performing well.<\/li>\n<li>Backing from leading blockchain investors usually leads to a successful funding round.<\/li>\n<li>A stellar team behind a project increases the likelihood of a successful crowdsale.<\/li>\n<\/ul>\n<h3>2. Tezos<\/h3>\n<p>The <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.tezos.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Tezos<\/a><\/span> project raised over $232 million during its ICO in July 2017. The Tezos team is developing a self-amending distributed ledger that allows for the creation of smart contracts. Tezos stands out from other blockchain projects because it allows token-holders to approve and fund new protocol updates, thereby preemptively mitigating any scaling or development disputes that may arise for the network in the future.<br \/>\nTezos’ token, called Tez (XTZ), will become tradable on digital currency exchanges in the coming months.<\/p>\n<p><strong>Why did it work?<\/strong> The Tezos project addresses pressing issues in the cryptocurrency community: governance and the decision-making process in relation to blockchain technology. The team behind the Tezos project has been developing a blockchain that enables its token-holders to become the decision-makers. This involves important protocol updates, and thereby democratizes the governance of its blockchain.<br \/>\nIronically, the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.reuters.com\/article\/us-bitcoin-funding-tezos-specialreport\/special-report-backroom-battle-imperils-230-million-cryptocurrency-venture-idUSKBN1CN35K\" target=\"_blank\" rel=\"noopener noreferrer\">founders of Tezos are currently embroiled in a legal dispute with the director of the Tezos Foundation<\/a><\/span> to access the ICO funds to continue the development of their platform. As the ICO funds are being held in the foundation, Tezos’ founder cannot currently access the funds they need to continue the development of the Tezos platform. This leaves investors in the dark as to whether or not they will ever be able to trade the XTZ token on exchanges.<\/p>\n<p><strong>Tips for mastery:<\/strong><\/p>\n<ul>\n<li>Innovative solutions that address real challenges, such as blockchain scalability and governance, have a good chance of raising substantial funds.<\/li>\n<li>Initial coin offerings are still a highly risky asset class. Only a tiny percentage of your overall portfolio should be invested in these newly-issued digital assets.<\/li>\n<\/ul>\n<h3>3. Bancor<\/h3>\n<p>The blockchain-based prediction market project <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.bancor.network\/\" target=\"_blank\" rel=\"noopener noreferrer\">Bancor<\/a><\/span> held its ICO on June 12, 2017, and managed to raise $153 million worth of Ether for the development of its platform. Investors in the crowdsale included the VC firm Blockchain Capital as well as seasoned blockchain investor Tim Draper.<br \/>\nThe <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/coinmarketcap.com\/assets\/bancor\/\" target=\"_blank\" rel=\"noopener noreferrer\">Bancor (BNT) token<\/a><\/span> experienced a spike on the day it launched on exchanges, hitting a high of $4.49 and then dropping off to trade at a low of $1.49.<br \/>\nIn late August, the BNT token recovered, and surpassed the $3.00 mark again.<br \/>\nToday, the BNT token is trading at $2.64.<\/p>\n<p><strong>Why did it work?<\/strong> Bancor is a protocol that allows anyone to issue new cryptocurrencies, called smart tokens. They can be easily exchanged against reserve tokens, alleviating issues surrounding liquidity and price discovery for newly-issued tokens. As the demand for digital currencies rises, the need for an easy-to-use issuance and trading platform increases, too. This is where the Bancor protocol comes into the picture.<\/p>\n<p><strong>Tips for mastery:<\/strong><\/p>\n<ul>\n<li>Backing from leading blockchain investors usually leads to a successful funding round.<\/li>\n<li>Attracting a wide range of prominent individuals as advisors usually increases the chance of a successful crowdsale.<\/li>\n<li>Projects that invest heavily in PR and marketing tend to raise the most funds.<\/li>\n<\/ul>\n<h2>What Makes an ICO Great: Basics<\/h2>\n<p>When launching an ICO, pay attention to:<\/p>\n<h3>ICO Economic Model<\/h3>\n<p>In ICO projects, efforts are mostly thrown to coding, not economic background. A token economic skeleton must be properly and thoroughly mapped out. In a long-term perspective backed by demand, the token must hold its value and outpace unsustainable inflation.<\/p>\n<h3>Token Utility<\/h3>\n<p>What does <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/en.wikipedia.org\/wiki\/Utility\" target=\"_blank\" rel=\"noopener noreferrer\">utility<\/a><\/span> stand for? Utility indicates total satisfaction with the consumption of goods or services. To make your ICO a success, you should maximize your token utility. The tokens should be absolutely integral, and must increase overall product value. Here, it is important to describe the whole idea of your token’s utility model in your project’s white paper.<\/p>\n<p>Utility is a key factor in the price of any cryptocurrency. The more it can be used for payments or investments, the higher its perceived value. In the case of Bitcoin, the utility factor is high. When changes to utility occur, they cause cryptocurrency value volatility.<\/p>\n<p>Ethereum was designed as a smart-contract platform. It holds practical utility. Its price has increased compared with alternative cryptocurrencies.<\/p>\n<p>A token is more than just a means of liquidation. Its role must be clearly explained.<\/p>\n<p>According to William Mougayar, author of The Business Blockchain, token usage and value variables include role, features, and purpose. Each of the roles has its purpose and features:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1366 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/04\/token-features.jpg\" alt=\"token features\" width=\"800\" height=\"610\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/token-features.jpg 800w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/token-features-350x267.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/token-features-500x381.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/token-features-768x586.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/token-features-600x458.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/token-features-132x101.jpg 132w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><br \/>\nIf you want to improve your token utility and bring value, more than one of these properties should be applied.<br \/>\nTo contribute significantly to the ecosystem, you should work on token utility.<\/p>\n<h3>Security &#8211; Protect Your Investors<\/h3>\n<p>Did you know that one out of ten ICOs ends up being hacked? Protect your digital assets and investors.<\/p>\n<p><img \/> <img loading=\"lazy\" class=\"aligncenter wp-image-1367 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/04\/hacked_ico.png\" alt=\"hacked ico\" width=\"510\" height=\"169\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/hacked_ico.png 510w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/hacked_ico-350x116.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/hacked_ico-500x166.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/hacked_ico-132x44.png 132w\" sizes=\"(max-width: 510px) 100vw, 510px\" \/><br \/>\nThe most common crimes fall under three categories:<\/p>\n<h4>1.Buggy Code<\/h4>\n<p>This DAO attack is a vivid example. It happened on June 17, 2016, and remains one of the worst violations ever. One-third of DAO’s funds (around $50 million) were drained into a subsidiary account (a so-called Child DAO). To put it simply, the smart contract wasn’t properly audited by the team of creators. As a result, there was a critical bug: coins were transferred multiple times before the smart contract could check (update) the internal balance, and this led to DAO failure. To save its investors, the Ethereum foundation made a hard fork. That’s how Ethereum Classic was created. Investors were refunded. But that was the beginning of the DAO’s end. It’s worth mentioning that this may have occurred not due to Ethereum itself, but because of a coding loophole.<\/p>\n<p>The United States Securities and Exchange Commision issued a report, which stated:<\/p>\n<p><img \/><img loading=\"lazy\" class=\"aligncenter wp-image-1368 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token.png\" alt=\"security report dao attack\" width=\"1512\" height=\"362\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token.png 1512w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token-350x84.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token-500x120.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token-768x184.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token-1024x245.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token-600x144.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/sec-report-dao-attack-security-token-132x32.png 132w\" sizes=\"(max-width: 1512px) 100vw, 1512px\" \/><br \/>\nWhen coming up with a decision to rely on blockchain and evolve your fundraising ideas, <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/how-to-find-best-ico-developers-when-launching-ico\" target=\"_blank\" rel=\"noopener noreferrer\">seek an accomplished team<\/a><\/span> with professional blockchain developers. Approach the process of evaluation with care.<\/p>\n<h4>2. Phishing Scams<\/h4>\n<p>Malicious motivations cause individuals to seek sensitive information (like credit cards details) in order to steal money. Phishing shows the weakness of current internet security. Phishing is constantly evolving to adopt new forms and techniques. It’s imperative that organizations conduct security awareness trainings on an ongoing basis, so their employees and executives can stay on top of emergent phishing attacks. Phone calls, emails, social media, and impersonation are the most popular means for scammers.<br \/>\nObviously, investors become victims of scammers more often then startup teams. They manipulate information about ICOs, trying to redirect investments into fake accounts. In cases like these, you lose probable revenues and reputation.<\/p>\n<h4>3. Key Mishandling<\/h4>\n<p>Where to store the keys? How to protect wallets? How to protect your investors’ tokens? These are the questions you face when developing an ICO. A multi-signature wallet is a perfect option to choose as a reliable partner.<br \/>\nBitGo offers multi-signature software that meets the most challenging security issues. Their wallets allow complete control of assets, and hold and transact digital currencies safely due to careful management of security keys.<\/p>\n<p><img \/> <img loading=\"lazy\" class=\"aligncenter wp-image-1369 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/04\/bitgo-multi-signature-wallet.jpg\" alt=\"ico analysis security multi signature wallet\" width=\"649\" height=\"481\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/bitgo-multi-signature-wallet.jpg 649w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/bitgo-multi-signature-wallet-350x259.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/bitgo-multi-signature-wallet-500x371.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/bitgo-multi-signature-wallet-600x445.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/bitgo-multi-signature-wallet-132x98.jpg 132w\" sizes=\"(max-width: 649px) 100vw, 649px\" \/><br \/>\nThe core idea is that when you want to execute a transaction, you’ll need at least two keys (yours and one saved by the company). In case you lose the key, there still is a backup (three keys are issued). This makes you more trustworthy among investors.<\/p>\n<p style=\"text-align: center;\">***<\/p>\n<p>The rise of Bitcoin seemed unbelievable, but its success does not represent the limit.<\/p>\n<p>The cases discussed here demonstrate that when it comes to cryptocurrencies, they are just gaining momentum.<\/p>\n<p>In 2017, IDOs went mainstream, and that good start gave the birth to the problem-solving startups and companies that allow us to look at 2018 feeling inspired.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An initial coin offering (IDO) is the perfect tool for those who are searching for innovation and global change. Developers, entrepreneurs, and investors combine their efforts to bring their projects to life, despite regulatory uncertainties and a cautious atmosphere. Undoubtedly, IDOs have changed the financial landscape over the past two years. An IDO is an [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":1362,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[137],"tags":[215,219],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>ICO Analysis of the Projects that Raised the Most Money<\/title>\n<meta name=\"description\" content=\"With initial coin offerings (ICOs), a new global financial phenomenon, more and more people are raising funds to bring their ideas to life. Our ICO review distinguishes projects that have raised fortunes, and reveals the factors in their success.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"ICO Analysis of the Projects that Raised the Most Money\" \/>\n<meta property=\"og:description\" content=\"With initial coin offerings (ICOs), a new global financial phenomenon, more and more people are raising funds to bring their ideas to life. Our ICO review distinguishes projects that have raised fortunes, and reveals the factors in their success.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-04-14T16:48:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-01T09:15:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/What-ICOs-raise-most-and-why-01.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"550\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/04\/What-ICOs-raise-most-and-why-01.jpg\",\"width\":1100,\"height\":550,\"caption\":\"icos that raised most money\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/\",\"name\":\"ICO Analysis of the Projects that Raised the Most Money\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/#primaryimage\"},\"datePublished\":\"2018-04-14T16:48:32+00:00\",\"dateModified\":\"2022-02-01T09:15:29+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/20c1c44e222e86f7a93fe590ecddb11b\"},\"description\":\"With initial coin offerings (ICOs), a new global financial phenomenon, more and more people are raising funds to bring their ideas to life. Our ICO review distinguishes projects that have raised fortunes, and reveals the factors in their success.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/ico-analysis-projects-that-raised-the-most-money\/\",\"name\":\"Best IDOs: Projects most Effective in Funding\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/20c1c44e222e86f7a93fe590ecddb11b\",\"name\":\"nadiya.gryvnak\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"nadiya.gryvnak\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/1361"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=1361"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/1361\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/1362"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=1361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=1361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=1361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}