{"id":1533,"date":"2018-05-09T05:55:54","date_gmt":"2018-05-09T05:55:54","guid":{"rendered":"https:\/\/applicature.com\/?p=1533"},"modified":"2022-01-26T15:57:12","modified_gmt":"2022-01-26T15:57:12","slug":"blockchain-and-food-security-future-food-tech","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech","title":{"rendered":"Blockchain and Food Security: Future Food Tech"},"content":{"rendered":"<p>Blockchain can help resolve food supply issues by bringing transparency to the complex food supply chain. Food authentication is a crucial step in finding and addressing sources of contamination around the world. Blockchain-based, food-targeted IDO projects are an innovative way to work toward achieving these goals.<\/p>\n<h2>Blockchain as a Tool to Enhance the Food Supply Chain<\/h2>\n<p>The prospects of blockchain technology have already been evaluated by both businesses and states. The governments of many countries are cautious and distrustful of cryptocurrencies, but they do not dispute the benefits that the use of blockchain technology in other fields can bring. Having gained popularity in the financial sector, the technology of blockchain is gradually spreading to other areas of application. A variety of businesses are beginning to apply the blockchain: from the sphere of <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.forbes.com\/sites\/bernardmarr\/2018\/03\/14\/how-blockchain-could-end-the-trade-in-blood-diamonds-an-incredible-use-case-everyone-should-read\/#b152114387d6\" target=\"_blank\" rel=\"noopener noreferrer\">precious-stone trade<\/a><\/span> to pork sales. In the course of time, the technology of blockchain will find wide application in a variety of human activities.<\/p>\n<p>Blockchain, a decentralized open ledger for immutable-record transactions, first appeared on the Bitcoin network. Nevertheless, blockchain is used far beyond Bitcoin, the B2B area, or the banking system, where it is used to make anonymous payments. Some experts are sure that blockchain can save the world from bureaucracy, reduce prices for many services, and eliminate intermediaries in all areas of the economy. They believe that blockchain can also contribute to the food industry by establishing an open environment where transactions can be monitored, and information on food products can be shared by farmers, consumers, and all other parties.<\/p>\n<p>Modern consumers are concerned about the lack of a simple and convenient opportunity to check the quality and <a href=\"http:\/\/www.who.int\/en\/news-room\/fact-sheets\/detail\/food-safety\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">safety of food<\/span><\/a> products in retail chains and stores. Product-quality assurance depends entirely upon the operative efficiency of the regulatory bodies that establish requirements for food-product verification, certification, labeling, and quality control.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1534\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/Безымянныйways.png\" alt=\"Six components of blockchain solutions\" width=\"683\" height=\"517\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйways.png 683w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйways-350x265.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйways-500x378.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйways-600x454.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйways-132x100.png 132w\" sizes=\"(max-width: 683px) 100vw, 683px\" \/>With online trade development and competitive growth in the global food market, participants in the product supply chain face a number of significant problems:<\/p>\n<ul>\n<li>protection against adulterated products<\/li>\n<li>improving the transparency of the product supply chain<\/li>\n<li>meeting the growing demand for food quality and providing information on its origin<\/li>\n<li>improving communication between parties involved in the food supply chain<\/li>\n<\/ul>\n<p>A lack of reliability, inaccuracy, and opacity of information on food ingredients and their origin is one of the most pressing problems of the modern food industry, and a transparent supply chain can be viewed as the most appropriate approach to ensure consistency and credibility.<\/p>\n<h2>The Increased Need for Food Traceability and Transparency<\/h2>\n<p>In recent years, we have witnessed many unusual and disturbing food scandals, like exploding watermelons, fake eggs in China, and luminous meat in Australia. Existing food safety issues associated with pollution, the spread of gastrointestinal diseases, waste, and financial loss are exacerbated by a lack of necessary information and control over the product supply chain. Consumers around the world embrace the value of private brands, but they still do not trust the quality and safety of the ingredients in any brand&#8217;s documentation. In a Trace One survey, <strong>68 percent of consumers in the U.S.<\/strong> said they do not have enough information about what&#8217;s in their food or its origins. More than <strong>90 percent of consumers<\/strong> reported that it&#8217;s very important to know where their food is coming from.<br \/>\n<img loading=\"lazy\" class=\"aligncenter size-full wp-image-1536\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic.png\" alt=\"global food supply chain\" width=\"1380\" height=\"542\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic.png 1380w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic-350x137.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic-500x196.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic-768x302.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic-1024x402.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic-600x236.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/CBI-Global-food-supply-chain-infographic-132x52.png 132w\" sizes=\"(max-width: 1380px) 100vw, 1380px\" \/>When a problem occurs in the supply chain, it takes days or even weeks to detect the issue and fix it. For instance, it took more than two months to identify the source of infection in a recent incident with salmonella in papaya. According to the <a href=\"http:\/\/www.who.int\/foodsafety\/areas_work\/food-hygiene\/5keys\/en\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">World Health Organization<\/span><\/a>, about <strong>600 million people<\/strong>, or almost one in every 10 people in the world, suffer from foodborne diseases, and <strong>420,000<\/strong> of them die each year, most of whom are young children.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1535\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/safer_food.png\" alt=\"World Health Organization foodborne diseases statistics\" width=\"558\" height=\"792\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/safer_food.png 558w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/safer_food-247x350.png 247w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/safer_food-352x500.png 352w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/safer_food-78x110.png 78w\" sizes=\"(max-width: 558px) 100vw, 558px\" \/>There are other drivers for the increased food supply chain traceability and transparency:<\/p>\n<ul>\n<li>A study conducted by <em>The Guardian<\/em> showed that <strong>38 percent of food<\/strong> from supermarkets did not have complete information about its origin, which may have an unfortunate effect on the seller&#8217;s reputation.<\/li>\n<li>A study by PwC and the Safe and Secure Approaches in Field Environments <em>(SSAFE<\/em>) showed that the problem of counterfeit products around the world results in a loss of <strong>$40 billion annually<\/strong>.<\/li>\n<li>In the U.K., falsification of beverages and food leads to a loss of <strong>£11 billion per year<\/strong> ($13.6 billion), according to a study conducted by PFK Littlejohn.<\/li>\n<li>An <em>Oceana<\/em> study revealed that the U.S. food falsification problem leads to a loss of <strong>$25 billion a year<\/strong>. And the more international the product supply chain becomes, the more opportunities appear for food fraud.<\/li>\n<li>In 2006, three people died and about <strong>200 people fell ill<\/strong> after eating spinach contaminated with Escherichia coli. As the U.S. Food and Drug Administration (FDA) could not be sure which spinach bags contained the infection, Americans were advised to avoid fresh spinach altogether. As a result, spinach producers <strong>lost $74 million<\/strong>.<\/li>\n<li>The European <strong>horse meat scandal in 2013<\/strong> horrified the entire food industry, raising questions about what we actually eat and where this food comes from. In mid-January 2013, Irish food inspectors announced that horse meat had been found in frozen, allegedly beef burgers from Ireland and the U.K. Tests showed that they contained horse DNA. The burgers were sold in British supermarket chains, including Tesco, Iceland, Aldi, and Lidl, as well as the European supermarket chains Findus and Nestle.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1537\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1.jpg\" alt=\"common sources of food poisoning\" width=\"1200\" height=\"822\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1-132x90.jpg 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1-350x240.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1-500x342.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1-768x526.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1-600x411.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1-120x82.jpg 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/FoodPoisoning_v3.0-1-300x205.jpg 300w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>The focus on global food supply-chain security is greater than it has ever been. Consumers require more information, and guarantees that the products they buy are safe and derived from reliable sources. This is where blockchain can make a positive impact and offer a solution to the problems facing the food industry.<\/p>\n<h2>Blockchain’s Role in the Food Supply Chain<\/h2>\n<p><a href=\"https:\/\/applicature.com\/blog\/the-blockchain-ecosystem\"><span style=\"color: #e70f00;\">Blockchain<\/span><\/a> operates as a single source of data that creates a clearer control trace and consistency between companies. Using blockchain technology, food companies can quickly track problems and find their source. This could increase consumer safety and reduce financial losses. If manufacturers, suppliers, processors, distributors, and sellers extract information from the same distributed registry to which they have authorized access, consumers confidence in the quality of products will grow, and regulatory bodies will have at their disposal a more powerful tool for ensuring food safety. This would allow food suppliers and other members of the ecosystem to detect sources of contaminated products at the earliest possible time with the help of a detached network, and promptly withdraw them from sale and prevent further spread of disease. Blockchain technology is a distributed network, and its application guarantees security due to the absence of a single vulnerable center. In addition, data stored in the blockchain cannot be edited or changed.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1538\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/Blockchain-technology-25719.jpeg\" alt=\"Blockchain for the food supply chain\" width=\"1452\" height=\"948\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Blockchain-technology-25719.jpeg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Blockchain-technology-25719-350x229.jpeg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Blockchain-technology-25719-500x327.jpeg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Blockchain-technology-25719-768x502.jpeg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Blockchain-technology-25719-600x392.jpeg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Blockchain-technology-25719-132x86.jpeg 132w\" sizes=\"(max-width: 1452px) 100vw, 1452px\" \/>These factors have all contributed to the success of blockchain in business. If the need arises to withdraw products, producers will not have to recall all of them: thanks to records in the blockchain, they can easily find out where the goods are, whether or not they have already been sold, and if so, to whom. Another way for food companies to track their outfit is to attach labels through the IoT to shipments, with each lot being assigned a unique identification number. These identifiers will be tied to individual farms and transmit data on storage temperature, expiration date, and so on. At each stage of the supply chain, employees can simply skip the product using their ID number, and the unit will reliably track the product through “checkpoints.” Employees can also enter an identification number to see product data in real time. The analytical module of the underlying technology calculates the number of product units according to a given formula. Taking the losses into account, the module issues a permit for their production and issuing codes. Everything else beyond these codes will be identified by the system as falsified.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1539\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/Безымянныйff.png\" alt=\"SupplyBloc blockchain infrastructure\" width=\"487\" height=\"391\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйff.png 487w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйff-350x281.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйff-132x106.png 132w\" sizes=\"(max-width: 487px) 100vw, 487px\" \/>The <em>SupplyBloc<\/em> project, for which the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/portfolio\/erc20-tokensale-contracts-design\/\">Applicature<\/a><\/span> company has provided technical support by improving and implementing the ERC20 token standard, is a good example of how blockchain can contribute to the food supply chain through three key means: transparency, trackability, and unification. These three solutions mean that accurately implemented, blockchain technology can create an unchangeable digital record of the transaction data list. Therefore, food supply chain blockchain technology may be considered the best technology for tracking the security and authenticity of goods as they move from a food supplier and further along the supply chain — all the way to store shelf and the end user.<\/p>\n<p>Marshal Cohen, an analyst with NPD Group, Inc., said: <em>&#8220;If there is a problem with the outbreak of Escherichia coli, the blockchain enables us to immediately determine where it came from, while the information will be received in a matter of minutes.&#8221;<\/em> Indeed, there are so many steps that need to be taken in order to provide people with the food they need and want. If the food supply chain blockchain technology was implemented by each store and available to every smartphone user, it would be enough to enter the identification number and the date of manufacture printed on the package in the application, and the entire history of the product would appear on the screen of a user’s mobile device.<\/p>\n<h3>Blockchain in Agriculture<\/h3>\n<p>The agricultural food business is a compound system that faces legal requirements to meet social food security yardsticks and retain customer trust at a time when international supply chains are becoming more complex. Consumers are becoming more demanding, and farmers find themselves under pressure to produce high-quality food. This is where blockchain can help. Due to its specifics, the technology provides trust between farmers and consumers in addition to the necessary transparency.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1540\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/Безымянныйgggg.png\" alt=\"DSS system information flow\" width=\"763\" height=\"317\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйgggg.png 763w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйgggg-350x145.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйgggg-500x208.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйgggg-600x249.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Безымянныйgggg-132x55.png 132w\" sizes=\"(max-width: 763px) 100vw, 763px\" \/><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/agfundernews.com\/what-is-precision-agriculture.html\" target=\"_blank\" rel=\"noopener noreferrer\">Precision Agriculture<\/a><\/span> (PA), satellite-farming or site-specific crop management (SSCM), is a farming management concept based on observing, calculating and replying to inter- and intra-field changeability in crops. The main goal of precision agriculture is to determine a decision support system (DSS) for farm management with the goal of optimizing reimbursements on input while preserving resources.<\/p>\n<p>Implementation of blockchain in agriculture and the modern farming system is lobbying by all internationals (John Deere, CNH, Monsanto, BASF, Syngenta) and entire governments (such as Industry 4.0 drives by Germany). Precision agriculture implements IoT to solve supply-chain problems, and to increase yields and maintain Big Data in a 24\/7 manner. However, there are no unified standards for those solutions, and farmers deal with them through intelligence unit offices or choose to not use it at all. On the other hand, farmers suffer from huge monopolization of their suppliers. Thus, a lack of monopoly is yet another advantage of IoT advancements.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1541\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/40672195_14752135349761_rId51.png\" alt=\"The U.S. precision agriculture market\" width=\"893\" height=\"307\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/40672195_14752135349761_rId51.png 893w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/40672195_14752135349761_rId51-350x120.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/40672195_14752135349761_rId51-500x172.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/40672195_14752135349761_rId51-768x264.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/40672195_14752135349761_rId51-600x206.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/40672195_14752135349761_rId51-132x45.png 132w\" sizes=\"(max-width: 893px) 100vw, 893px\" \/>Precision agriculture brings huge operating costs. This is where blockchain can reveal its disruption power at full scale:<\/p>\n<ol>\n<li><strong>Provenance.<\/strong> With a simple QR code and classic contracts hashed in blockchain, users can track where food comes from. Blockchain also provides the possibility of discovering who was trying to change the origin data — and when.<\/li>\n<li><strong>Advanced provenance.<\/strong> Blockchain allows the acquisition of all data about food directly from smart-meters to verify contract conditions in a digital manner via IoT. Bitcoin-like blockchains could handle it, but it would be better to use more flexible platforms, like Ethereum, Cardamom, NEO, EOS, and others.<\/li>\n<li><strong>Precision agriculture operability within blockchain.<\/strong> Simple API allows all IoT to use coins. There is no need to handle all your device data standards; blockchain deals with it trough tokenization and operates with unified data with cryptography. Users will have to check IOTA, which e provides this ability for IoT.<\/li>\n<li><strong>Autonomous business processes.<\/strong> This means that precision agriculture functions without intermediaries. With the huge power of Ethereum or HyperLedger, users could step into the digital world of economics. Computers perform automated operations in a trusted, secure manner and even without the internet (blockchain on MESH networks).<\/li>\n<\/ol>\n<p>Blockchain is a cutting-edge technology and innovative, market-based tool for tracking the origin of a product and delivering this information to the end user. This is an effective tool in the fight against falsification.<\/p>\n<h2>IBM Blockchain Food Safety<\/h2>\n<p>With blockchain, mistakes and fraud in the supply chain are transparent and easily traceable. Transparency and honesty reassure consumers that the food they consume is exactly what the label asserts it to be. Blockchain is contributing to many promising advances in the areas of food safety and authenticity, and the number of companies adopting blockchain in their businesses is growing rapidly. Blockchain also allows the entire food supply chain to be more responsive to any food-safety disaster.<\/p>\n<p>IBM is already developing <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.ibm.com\/blogs\/blockchain\/category\/blockchain-in-food-safety\/\" target=\"_blank\" rel=\"noopener noreferrer\">blockchain applications<\/a><\/span> for the financial and logistics industries. These same technologies, implemented as a cloud service, are planned to be used to strengthen control over food-product transportation and provide consumers with general information about the origin of ingredients. To implement the IBM blockchain food safety technologies in the food supply chain, in August 2017, ten of the world&#8217;s largest food companies began to cooperate with IBM in the matter of integrating food blockchain into their supply chains. These companies are <em>Walmart, Nestle, Unilever, McCormick, Tyson, Kroger, McLane, Driscoll&#8217;s, Dole, and Golden State Foods<\/em> &#8211; which represent more than half a trillion dollars in global sales per year.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1542\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/05\/БезымянныйIBM.png\" alt=\"IBM blockchain platform opportunities\" width=\"733\" height=\"621\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/БезымянныйIBM.png 733w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/БезымянныйIBM-350x297.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/БезымянныйIBM-500x424.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/БезымянныйIBM-600x508.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/БезымянныйIBM-130x110.png 130w\" sizes=\"(max-width: 733px) 100vw, 733px\" \/>The IBM blockchain food safety platform performs three functions:<\/p>\n<ol>\n<li>Development. Simple, flexible tools allow developers to deduce networks at a given speed in just a few minutes. The first commercial version of Hyperledger Composer helps them focus on business scenarios, simplifying and accelerating the writing of application code. Developers can create standard JavaScript for JavaScript, and APIs help to maintain business rather than technical orientation, so virtually any programmer can become a developer of the blockchain.<\/li>\n<li>Control. The platform offers all participants an equal level of control, without granting exclusive rights to anyone. New tools for democratic governance have been designed to improve the organization&#8217;s effectiveness by voting. When considering proposals for the distribution of smart contracts and the creation of transaction channels, signatures are collected from all participants. Quickly forming a team, distributing roles, and setting up access control, organizations can begin to register transactions in the blockchain.<\/li>\n<li>Exploitation. The platform is supported by architecture on the basis of which more than 55% of all global transactional systems are now built. This is the first proposal that allows the installation of updates in a continuously functioning network. In the cloud, IBM Cloud provides unique protection against the misuse of insider credentials and malware, and also uses hardware encryption keys.<\/li>\n<\/ol>\n<p>It is worth mentioning that all IBM blockchain food safety solutions are made with the HyperLedger framework family. Basically, this is a corporate-oriented framework that allows the creation of a “private Ethereum” with docket-arranged data, a virtual machine for Chaincode (the same as the smart contract in Ethereum) execution, and the ability to use Chaincodes as libraries for other Chaincode (as well as Ethereum). It has significant benefits over other platforms that support Turing-complete smart contracts (allows creation of DApp). Specifically, it provides variations in Practical Byzantine Fault Tolerance consensuses as well as the ability to include a cheap plug-in of AR\/VR, AI\/ML and IBM Watson, all with zero transaction fees. On the other hand, it suffers from scalability limitations, and it loses all benefits to platforms that are designed to support millions of users, for example, the Ethereum consortium chain.<\/p>\n<h3>Walmart Implements Blockchain for Food Safety<\/h3>\n<p>The American retail giant Walmart has patented a new way to use blockchain technology for creating a smart delivery-tracking system that includes devices for recording information on the blockchain, depending upon the contents of the package, surrounding features, location, and other factors. According to Walmart, online shopping has put retail chains in front of new tasks in the field of supply, especially the supply of perishable products that require a certain temperature regime. Online buyers seek to buy goods that require certain conditions of transportation. Also of great importance is security during the movement of goods. The food blockchain component will be encrypted into the device, and contain information about key addresses in the supply chain, hashing with the key address of the seller, the courier, and the buyer. In addition to supply chains, Walmart plans to use blockchain technology in other areas. The trading giant, with Kroger, Nestle, and other food producers in partnership with the IBM blockchain food safety technologies, is planning to use the food blockchain system to improve the product-tracking process.<\/p>\n<p>With greater awareness brought to the quality of our food, issues such as food-supply safety and sustainability should also be considered. Food blockchain technology may be the solution to some of the most important food supply issues today, as well as a means to improve commerce and the overall quality of our health. By using blockchain in agriculture and making supply chains public, counterfeit or adulterated food products can be eliminated. A new level of trust can be established by all parties involved in food production and distribution, whilst consumers can be aware of where their food comes from and be assured of its quality and authenticity. Blockchain brings an optimistic view to the future of our food’s lifecycle.<br \/>\nFeel free to contact the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/\">Applicature<\/a><\/span> team for more information.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Blockchain can help resolve food supply issues by bringing transparency to the complex food supply chain. Food authentication is a crucial step in finding and addressing sources of contamination around the world. Blockchain-based, food-targeted IDO projects are an innovative way to work toward achieving these goals. Blockchain as a Tool to Enhance the Food Supply [&hellip;]<\/p>\n","protected":false},"author":13,"featured_media":173949,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[134],"tags":[154,200,211,215],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Blockchain and Food Security: Future Food Tech<\/title>\n<meta name=\"description\" content=\"Blockchain can help resolve food supply issues by bringing transparency to the complex food supply chain. Food authentication is a crucial step in finding and addressing sources of contamination around the world. Blockchain-based, food-targeted ICO projects are an innovative way to work toward achieving these goals.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Blockchain and Food Security: Future Food Tech\" \/>\n<meta property=\"og:description\" content=\"Blockchain can help resolve food supply issues by bringing transparency to the complex food supply chain. Food authentication is a crucial step in finding and addressing sources of contamination around the world. Blockchain-based, food-targeted ICO projects are an innovative way to work toward achieving these goals.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-05-09T05:55:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-26T15:57:12+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/Blockchain-and-Food-Security-01.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"550\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/05\/22.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/\",\"name\":\"Blockchain and Food Security: Future Food Tech\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/#primaryimage\"},\"datePublished\":\"2018-05-09T05:55:54+00:00\",\"dateModified\":\"2022-01-26T15:57:12+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\"},\"description\":\"Blockchain can help resolve food supply issues by bringing transparency to the complex food supply chain. Food authentication is a crucial step in finding and addressing sources of contamination around the world. Blockchain-based, food-targeted ICO projects are an innovative way to work toward achieving these goals.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/\",\"url\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain-and-food-security-future-food-tech\/\",\"name\":\"Blockchain and Food Security: Future Food Tech\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\",\"name\":\"Victoria Melnychuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/g12-scaled.jpg\",\"caption\":\"Victoria Melnychuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/1533"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=1533"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/1533\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173949"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=1533"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=1533"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=1533"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}