{"id":2015,"date":"2018-07-25T13:34:08","date_gmt":"2018-07-25T13:34:08","guid":{"rendered":"https:\/\/applicature.com\/?p=2015"},"modified":"2019-08-05T13:08:19","modified_gmt":"2019-08-05T13:08:19","slug":"ethereum-better-than-bitcoin","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin","title":{"rendered":"Ethereum vs Bitcoin: Breaking Them Down Simply"},"content":{"rendered":"<p>First, we need to understand what <strong><i>Bitcoin<\/i><\/strong> is without getting technical. Bitcoin can be viewed as a digital version of gold. Gold bars are used to store value. Essentially, you buy gold and store it somewhere longterm. The gold represents a portion of your wealth, and it can be more stable than <i>FIAT currencies<\/i> in times of economic instability. So when the markets go haywire like they did in 2008, gold simply sits there and holds its value like it has done for thousands of years. It&#8217;s considered a safe haven.<\/p>\n<p>There are two main characteristics of gold that make it a good store of value.<\/p>\n<ul>\n<li><b>It&#8217;s easy to store.<\/b> Gold is inert, so it doesn&#8217;t spoil, corrode, or rust. You can be confident that your gold will still be there thousands of years later.<\/li>\n<li><b>It&#8217;s scarce<\/b>. There&#8217;s only a certain amount of gold that physically exists on the earth. This is superior to traditional money, which governments can print as much as they like, thereby increasing supply and devaluing currency. This is known as <i>inflation<\/i>.<\/li>\n<\/ul>\n<p><strong>Bitcoin<\/strong> shares these qualities. The supply of Bitcoin is predetermined, and it&#8217;s limited to 21 million. Currently, we have 17 million BTCs in circulation, with more Bitcoin being created through mining. Bitcoin is created through a digital version of this process. Instead of humans, computers calculate difficult math problems, and in doing so, they generate Bitcoin. It&#8217;s important to know that this isn&#8217;t just free money, just as mining gold isn&#8217;t free. Gold mining is expensive and arduous, while mining Bitcoin is computationally intensive; it costs a lot of money through requirements of hardware and electrical power.<br \/>\nOf course, Bitcoin is also very easy to store, since it&#8217;s a digital asset. It also won&#8217;t spoil or degrade over time. That&#8217;s <i>Bitcoin<\/i> &#8211; a medium for storing your money that&#8217;s unaffected by governments, banks, and monetary policy.<\/p>\n<p>If <strong>Bitcoin<\/strong> is like gold and functions as a digital commodity, the value of which is driven by supply and demand, then what is <strong><i>Ethereum<\/i><\/strong>? Let’s describe it as digital oil. In order for this to make sense, you need to first understand what <strong><i>Ethereum <\/i><\/strong>is. It&#8217;s essentially programmable money. This is a hard concept to wrap your head around, since nothing like this has ever existed before.<\/p>\n<p>Here&#8217;s an example. One possible application of <i>Ethereum<\/i> is insurance. In our current model, everyone pays money to insurance companies and in the event of an incident, and the company pays out to affected parties while taking a hefty cut for their own profit. This is a necessary evil, because we need an entity to manage thi process. However, using Ethereum, you could code your money to completely cut out the middleman.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2105\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts.png\" alt=\"ethereum blockchain smart contracts\" width=\"1082\" height=\"397\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts.png 1082w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts-350x128.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts-500x183.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts-768x282.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts-1024x376.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts-600x220.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-smart-contracts-132x48.png 132w\" sizes=\"(max-width: 1082px) 100vw, 1082px\" \/>In flight insurance, you can have code implemented directly into the money itself: code that says “<i>if a flight is canceled and it&#8217;s the airline&#8217;s fault, then pay x amount to the affected parties.<\/i>” This would be an automated process that would be decentralized and censorship-resistant. Instead of having to trust an insurance company, which has a huge incentive to cheat and lie for profits, you only have to trust cold, hard code, which will be completely impartial and only programmed by behavior.<\/p>\n<p>It&#8217;s also much cheaper, because instead of a cut on your flight insurance being paid to some CEO’s Christmas bonus, you would only have to pay the small amount required to run these simple lines of code on a machine. So, what is this machine? Is it a computer located in the ethereal headquarters? No; this is the revolutionary thing about blockchain. It&#8217;s the concept of decentralization.<\/p>\n<p>Instead of a central computer, Ethereum is building a global supercomputer in which anyone can participate and become part of that supercomputer. So when you “pay a small amount to run the code,” you&#8217;re not paying to the Ethereum company &#8211; you&#8217;re paying everyone within this global network to run your code on that supercomputer. The profits don&#8217;t go to Ethereum &#8211; they get shared between the users who are running the supercomputer.<\/p>\n<p>The use of Ethereum isn&#8217;t limited to just money. Anything that can be coded can be run on the Ethereum network. This has implications for existing fields like politics as well as exciting new areas like <i>automation and artificial intelligence<\/i>.<br \/>\nThis is where the oil analogy comes from. Just as oil is used to power things in our day-to day-lives, Ethereum will be the fuel that powers this global supercomputer, a technology that has the potential to be as revolutionary as the Internet.<\/p>\n<h2>Let’s Get Technical. What’s Different About Bitcoin and Ethereum?<\/h2>\n<p>What comes to mind when you think about <b>Bitcoin<\/b>? Probably “<i>digital money<\/i>?” What about <b>Ethereum<\/b>, &#8211; is it “<i>smart contracts?<\/i>” That’s right; that’s the key basic difference you need to remember.<br \/>\nBitcoin also uses smart contracts, but compared to Ethereum’s contracts, Bitcoin’s aren’t that multifunctional. Bitcoin is a tool for sending money and completing transactions. Ethereum is also used for sending money, but only when certain conditions are met. Ethereum serves as a platform for developing dApps (decentralized applications) and smart contracts. <em>DApps and <a href=\"https:\/\/applicature.com\/blog\/smart-contract-mistakes-bugs-pitfalls\">smart contracts<\/a><\/em> guarantee that transactions are secure, so a platform can send tokens that represent a certain value.<br \/>\nThere are 50,000 masternodes on the Ethereum blockchain and 10,000 on the Bitcoin blockchain. But the complexity of Bitcoin’s mining is tougher, therefore the value of a single masternode is higher at Bitcoin. That’s why Bitcoin’s price is the most stable &#8211; because its masternode is the most valuable.<\/p>\n<h2>What Types of Blockchain Do Ethereum and Bitcoin Run?<\/h2>\n<p>Blockchains are very well-known due to the rise of Bitcoin and Ethereum, which have really brought the concept forward.<\/p>\n<h3><strong><i>Bitcoin Is Based On the Public Blockchain<\/i><\/strong><\/h3>\n<p>What does this mean? It means that anybody in the world can download the blockchain and read its data. With Bitcoin, you can see the number of Bitcoins sent to and from certain addresses. But that doesn’t mean it’s insecure. The public blockchain is secured by the power of cryptography. This is part of the fully decentralized nature of blockchain technology.<\/p>\n<h3>Ethereum Is Based Upon the Consortium Blockchain<\/h3>\n<p>This sort of blockchain isn’t fully public. The consortium blockchain is controlled by preselected server nodes (i.e, computers). Here’s an example of what the consortium blockchain looks like: imagine 10 banks that run a specific blockchain (all of them have been pre-approved). For any block being processed by that chain, a minimum of six banks must sign a transaction for it in order to be added to the blockchain (of course, it can be added to the chain if all six sign).<\/p>\n<h2>What’s an ERC?<\/h2>\n<p><em>An ERC (Ethereum Request for Comments)<\/em> is a form of proposal, the goal of which is to define token standards and practices. This is different from an <i>Ethereum Improvement Proposal<\/i>, because an EIP makes changes to the actual code of Ethereum, while ERC is more like guidance on how to use Ethereum features. ERC20 is the number assigned to a specific ERC proposal that intends to standardize how Ethereum contract should be used and how different contracts should interact with each other.<\/p>\n<p>If a token follows the <a href=\"https:\/\/applicature.com\/blog\/create-your-erc20-tokens\"><em>ERC20<\/em><\/a> token standard, it will be perceived by other people as safe to invest in. However, this doesn’t mean that the contract is void of all risks. As with all code and software, the best practice is to assume that everything is very buggy. ERC20 is a way to standardize how token contracts interact with each other in order to prevent daylight chaos and increase interoperability between contracts on the Ethereum blockchain.<\/p>\n<p>Owners of tokens fully control their assets. A token contract adhering to the ERC20 standard can track how many tokens there are and whom they belong to any given time. Since each token is a sub-network of the Ethereum network, this is easy to implement. All distributions of tokens are performed through a smart contract.<\/p>\n<p>In the end, this standard is very useful for the ecosystem of Ethereum as a whole. The ability to use these assets on different platforms and in different projects will make them more useful.<\/p>\n<p>ERC20 is not a limit. Ethereum has gone above and beyond and introduced new token standards to the blockchain in order to improve and maximize its interoperability, security, and performance. More is yet to come. That’s why Ethereum is called blockchain 2.0.<\/p>\n<h2>Key Differences Between Bitcoin and Ethereum<\/h2>\n<p>[table id=7\/]<br \/>\n<em>Bitcoin and Ethereum<\/em> are not powerful enough in terms of transactions per second. A common problem of Bitcoin and Ethereum is the scalability, which is why they can’t process more transactions. For comparison, let’s have a look at the quantity of transactions per second of famous payment systems:<\/p>\n<ul>\n<li><b>Paypal<\/b> &#8211; ~ 400 tps<\/li>\n<li><b>Visa<\/b> &#8211; ~ 24000 tps<\/li>\n<li><b>IoT<\/b> &#8211; ~ 300000 tps<\/li>\n<\/ul>\n<h2>Ethereum and Bitcoin as Crypto Market Giants<\/h2>\n<p>Bitcoin’s dominance is now around 45% of the total market, despite the fact that there are 1,630 cryptocurrencies currently in existence. This means that any fluctuation in the price of Bitcoin impacts the whole market. If BTC’s price drops, the majority of other altcoin prices will drop, as well. For now, BTC sets the pace for the market. 45% dominance is huge; that’s why the crypto market is still very volatile.<br \/>\nExperts believe Ethereum might be able to lower Bitcoin’s dominance. Ethereum’s dominance is currently around 18%.<\/p>\n<h2><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2083\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin.png\" alt=\"market cap of bitcoin and ethereum\" width=\"1086\" height=\"124\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin.png 1086w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin-350x40.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin-500x57.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin-768x88.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin-1024x117.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin-600x69.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-vs-bitcoin-132x15.png 132w\" sizes=\"(max-width: 1086px) 100vw, 1086px\" \/>Defining the Pros and Cons of Ethereum And Bitcoin<\/h2>\n<p><em>Ethereum and Bitcoin<\/em> have proven their ability to be independent and decentralized. However, the crypto industry is new and not fully regulated. Let’s define the key advantages and disadvantages of the top two cryptos of the market cap.<\/p>\n<h2>Pros of Ethereum<\/h2>\n<ul>\n<li><b>Immutable<\/b> &#8211; A middleman or third party can’t make changes to the platform’s (blockchain) data.<\/li>\n<li><b>Multi-usable<\/b> &#8211; Smart contracts and dApps can have unlimited <a href=\"https:\/\/applicature.com\/blog\/use-case-blockchain-implementation\">use cases<\/a>.<\/li>\n<li><b>Collaborative<\/b> &#8211; The <i>Ethereum Enterprise Alliance<\/i> works with various enterprises from different industries (from banking and healthcare to artificial intelligence and automation). By the way, <a href=\"https:\/\/entethalliance.org\/members-directory\/?letter=a\" target=\"_blank\" rel=\"noopener noreferrer\">Applicature is a member<\/a> of the <i>Ethereum Enterprise Alliance<\/i>.<\/li>\n<li><b>Purposeful<\/b> &#8211; Ethereum has a clear vision, and knows what it wants to achieve.<\/li>\n<li><b>User-friendly &#8211; <\/b>provides plenty of opportunities for users to create and develop their own dApps.<\/li>\n<\/ul>\n<h2>Pros of Bitcoin<\/h2>\n<ul>\n<li>Payment independence<\/li>\n<li>Counterfeit-proof<\/li>\n<li>Security and control<\/li>\n<li>Transparency<\/li>\n<li>Liquidity<\/li>\n<li>Minimum transaction fees<\/li>\n<li>Short transaction times<\/li>\n<\/ul>\n<h2>Cons of Ethereum<\/h2>\n<ul>\n<li>Not fully scalable<\/li>\n<li>Low number of transactions per second<\/li>\n<li>High price of masternodes<\/li>\n<\/ul>\n<p>These are not major cons. Ethereum developers are aware of them. Ethereum is going to launch some huge projects and updates in order to deal with its cons. Read on for more about these projects.<\/p>\n<h2>Cons of Bitcoin<\/h2>\n<ul>\n<li>Volatile<\/li>\n<li>Speculative<\/li>\n<li>Payments are irreversible<\/li>\n<li>Current limited usability (less than FIAT, for now)<\/li>\n<\/ul>\n<h2>Ethereum’s Major Updates for the Future<\/h2>\n<p>As mentioned earlier, the Ethereum team is aware of the platform’s problems, and contributes everything possible toward their solution. Let’s go over the most promising projects that could make Ethereum even more widely used and successful.<\/p>\n<h3>Ethereum Casper<\/h3>\n<p>Like <em>Bitcoin, Ethereum<\/em> uses a <em>proof-of-work<\/em> consensus algorithm. This protocol requires a lot of computational power consumption. Ethereum plans to shift away from PoW to PoS. A couple of months ago, <em>Ethereum introduced Casper.<\/em> This update is meant to shift away from proof-of-work mining into a hybrid system called minting &#8211; a combination of proof of stake and proof of work. Ethereum’s current protocol relies on a pool of developers to use their resources, such as hardware and electricity, to record transactions and create new blocks. It utilizes the concept of block validators. Ethereum’s protocol is considered to be the most stable consensus algorithm.<br \/>\n<img loading=\"lazy\" class=\"size-full wp-image-2093 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/07\/ethereum-caspewr.jpg\" alt=\"proof of stake casper update\" width=\"636\" height=\"332\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-caspewr.jpg 636w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-caspewr-350x183.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-caspewr-500x261.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-caspewr-600x313.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-caspewr-132x69.jpg 132w\" sizes=\"(max-width: 636px) 100vw, 636px\" \/><\/p>\n<h3>How Does Casper Work?<\/h3>\n<p>A validator bets on blocks by assigning each of them a probability; the sum of the probabilities for blocks at the same height must equal 100%. To select one block at each height, validators may need to perform several betting rounds, until at least 2\/3 of validators bet on a certain block with a high probability. To resist majority attacks, Casper punishes deviations from the protocol by withholding generation rewards and locks funds from misbehaving validators. Casper was implemented to eradicate another essential problem — the “nothing at stake” issue — and to improve Ethereum’s performance and stability.<\/p>\n<h3>Casper’s Impact<\/h3>\n<p>Casper was expected to launch at the end of February 2018, but there were some major issues of network  adjustment. That’s why the developers decided to postpone its launch.<\/p>\n<p>However, Vitalik Buterin is convinced that with this delay, a reduction in the Ethereum masternode price will become possible. The price will be lowered from <i>1500 ETH to 32 ETH<\/i>. Buterin believes a low masternode price will attract new investors, help Casper avoid centralization, and make <i>PoS<\/i> more transparent.<\/p>\n<p>Along with lowering the masternode price, the <i>Ethereum Improvement Proposal (EIP)<\/i> suggests reducing the reward for mining a block. Mining will be less valuable: <i>instead of 3 ETH, it’s going to be 0.6 ETH<\/i>. This might pump Ethereum’s price, because there will be fewer ETHs in circulation. In this scenario, miners might want to switch to Ethereum Classic (ETC) or ZCash (ZEC), because Ethereum’s mining won’t be that profitable.<\/p>\n<p>Buterin stated that implementation of PoS\/PoW hybrid (Casper) will “expand” the platform to the “<i>theoretical maximum.<\/i>”<\/p>\n<p>As a matter of fact, <i>Applicature<\/i> has worked with <i>Ethereum<\/i>, launching the <a href=\"https:\/\/applicature.com\/blog\/launched-by-applicature-ethereum-proof-of-stake-implementation\"><b>Applicature Ethereum Proof of Stake protocol (AEPoS)<\/b><\/a>.<\/p>\n<h3>Sharding<\/h3>\n<p>This is a process with which a platform can scale. <em>Ethereum<\/em> wants to perform sharding in order to increase the number of transactions it can take per second, and increase the amount of computational power of which it is capable. <em>Sharding<\/em> achieves this by dividing the network into teams. At the current stage, there are tons of computers on the <em>Ethereum<\/em> network, all holding the public ledger and completing the same functions. The <em>Ethereum Virtual Machine (EVM<\/em>) runs on every single computer, but adding more computers to the system doesn’t improve its efficiency. This is because the same ledger is kept on every computer. That’s a waste, and not really necessary. This where <em>Sharding<\/em> comes in handy. It’s a way of splitting the network into teams. The network will be fractured into teams, and will be able to compete. Thus, every team can process transactions and perform calculations. By breaking them down into segments, the output of the network is drastically increased.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2104\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/07\/ethereum-sharding-update-scalability.png\" alt=\"ethereum sharding scalability update\" width=\"771\" height=\"606\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-sharding-update-scalability.png 771w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-sharding-update-scalability-350x275.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-sharding-update-scalability-500x393.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-sharding-update-scalability-768x604.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-sharding-update-scalability-600x472.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/ethereum-sharding-update-scalability-132x104.png 132w\" sizes=\"(max-width: 771px) 100vw, 771px\" \/><\/p>\n<ul>\n<li style=\"list-style-type: none;\">A problem with sharding is that it works for centralized servers very well. The challenge now is to bring that onto a decentralized network. What is the proof of team interaction? That’s the most dangerous part about sharding &#8211; if the shards don’t communicate with each other, there’s a chance that someone could exploit that communication gap and create extra<\/li>\n<\/ul>\n<p><em>Ethereum<\/em><\/p>\n<ul>\n<li style=\"list-style-type: none;\">on the network. This is why it has taken so long for Ethereum to launch sharding. It’s easy to create, but adoption of the network demands is really tough.<\/li>\n<li style=\"list-style-type: none;\">Vitalik Buterin has announced the possibility of a simultaneous<\/li>\n<\/ul>\n<p><em>Casper<\/em><\/p>\n<ul>\n<li style=\"list-style-type: none;\">and sharding launch, which is very important. This would make Ethereum’s Protocol 10 times more effective.<\/li>\n<li style=\"list-style-type: none;\">In the case of a successful launch,<\/li>\n<\/ul>\n<p><em>Ethereum<\/em><\/p>\n<ul>\n<li style=\"list-style-type: none;\">will surpass other payment systems like<\/li>\n<\/ul>\n<p><em>Visa<\/em><\/p>\n<ul>\n<li style=\"list-style-type: none;\">in terms of number of transactions per second (it could hit even a million transactions per second.)<\/li>\n<\/ul>\n<h3>Plasma<\/h3>\n<p><em>Plasma<\/em> is a proposed framework for incentivizing and enforcing the execution of smart contracts, scalable to a significant amount of state updates persecond (potentially billions) and enabling the blockchain to represent a significant number of decentralized financial applications worldwide.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2107\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/07\/plasma-framework-ethereum.jpg\" alt=\"ethereum plasma framework plasmachain\" width=\"538\" height=\"188\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/plasma-framework-ethereum.jpg 538w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/plasma-framework-ethereum-350x122.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/plasma-framework-ethereum-500x175.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/plasma-framework-ethereum-132x46.jpg 132w\" sizes=\"(max-width: 538px) 100vw, 538px\" \/><\/p>\n<p><em>It<\/em> will create a blockchain within a blockchain with the goal of protecting the network if someone creates an invalid or fraudulent transaction. People on the network will be incentivized to create fraud proofs, effectively allowing them to penalize people acting wrongfully and allowing them to reverse the transaction. Plasma might solve Ethereum’s scalability issue, allowing the platform to complete a million transactions per second.<\/p>\n<h3>Upcoming Hard Forks<\/h3>\n<p>Miners, who are the main backbone of Bitcoin stability, are the ones who benefit from letting the old system stay the same. They benefit from the high transaction fees that keep Bitcoin from going mainstream as a means of payment. The Ethereum blockchain could also be affected by such a situation if it doesn’t move in the direction of constant improvement.<br \/>\nThat’s why hard forks are vital for Ethereum’s ecosystem and users. They make a network more usable and sophisticated. We’ve seen major updates, and there are more yet to come.<\/p>\n<p><img loading=\"lazy\" class=\"irc_mi alignnone\" src=\"https:\/\/masterthecrypto.com\/wp-content\/uploads\/2018\/03\/wsi-imageoptim-ETH-Fork7-1-1.png\" alt=\"hard fork ethereum proof of stake casper october\" width=\"1031\" height=\"490\" \/><\/p>\n<ul>\n<li><strong>Constantinople<\/strong> is the 2nd phase of <em>Metropolis hard fork<\/em> (the first phase was Byzantium, which was launched on October 17, 2017). It is going to make <em>Ethereum<\/em> much more valuable due to decreasing inflation within the ecosystem. <em>Constantinople will introduce Casper<\/em>, and potentially sharding.<br \/>\n<em>Ethereum<\/em> wants to shift away from <em>proof-of-work (mining) to proof-of-stake<\/em>. One problem behind this issue is that miners have too much power over the current blockchain, and their dominance can make things more complicated. Miners are not interested in improvements to the network &#8211; they are interested in the maximization of their own gain. This is not how the <em>Ethereum<\/em> ecosystem will work. The release date is still unknown, but it should happen in 2018.<\/li>\n<li><strong>Serenity<\/strong> is going to represent the final step toward becoming a fully <em>proof-of-stake<\/em> platform. <em>Serenity<\/em> will provide all the necessary tools for anyone to use its network to the maximum.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3>Futures for Ethereum: A Threat, or Not?<\/h3>\n<p>Up until now, futures were available only for <em>Bitcoin<\/em>, but soon, Crypto Facilities will start selling futures for Ethereum. <em>Financial Conduct Authority (FCA)<\/em> <em>Head Manager Timo Shleifer<\/em> is sure that regulated contracts will bring more liquidity to digital assets.<br \/>\nFutures will become a useful tool for institutional investors. They will allow shorting <em>Ethereum<\/em> or taking long-term positions without any risk. Futures are a great leap forward in the evolution of cryptocurrencies.<br \/>\nOn the other hand, some independent investors have ascertained that futures will “kill” cryptocurrencies, because futures are a threat to the decentralized concept of the blockchain. As we can see, futures didn’t “kill” Bitcoin; however, it struggles to regain its winter price. Obviously, futures are not the only thing influencing cryptocurrency price. We will see what Ethereum futures bring us.<\/p>\n<h2>Will the Lightning Network Improve Bitcoin?<\/h2>\n<p>In August 2017, Bitcoin developers implemented Segregated Witness (SegWit) and released a beta version of the Lightning Network. This technological innovation allows an increase in the efficiency of Bitcoin, namely to increase transaction bandwidth and reduce commission fees. In the near future, other features that will perfect the work of the Bitcoin network will be released. These are:<\/p>\n<p><b>MAST Technology &#8211; <\/b><\/p>\n<ul>\n<li style=\"list-style-type: none;\">increasing scalability and privacy<\/li>\n<\/ul>\n<p><b>Bulletproof technology &#8211; <\/b><\/p>\n<ul>\n<li style=\"list-style-type: none;\">improving confidentiality<\/li>\n<\/ul>\n<p><b>Sidechain projects &#8211; <\/b><\/p>\n<ul>\n<li style=\"list-style-type: none;\">making the Use of tokens as safe as possible. Sidenchain projects include three major technologies:<\/li>\n<\/ul>\n<p><em>The Liquid Network<\/em><br \/>\n<em>RSK<\/em><br \/>\n<em>Drivechain<\/em><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2106\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/07\/lighting-network-bitcoin.png\" alt=\"bitcoin lighting network update\" width=\"755\" height=\"399\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/lighting-network-bitcoin.png 755w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/lighting-network-bitcoin-350x185.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/lighting-network-bitcoin-500x264.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/lighting-network-bitcoin-600x317.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/lighting-network-bitcoin-132x70.png 132w\" sizes=\"(max-width: 755px) 100vw, 755px\" \/><br \/>\n<em>The Lightning Network<\/em> was designed to “relieve” the <em>Bitcoin blockchain<\/em>, having taken transactional data beyond the basic blockchain. The Lightning Network, in its current architecture, needs to store a lot of data, which makes it difficult to download and use.The co-founder of Lightning Labs, Laolu Osantokan, published a new proposal (<i>eltoo<\/i>) which will significantly reduce the amount of information recorded on the blockchain and eliminate a major vulnerability related to the <i>penalty transaction<\/i> mechanism.<\/p>\n<p>Today, the nodes of the <em>Lightning Network<\/em> store all intermediate channel states (the data of all operations performed between the opening and closing of the payment channel). The logic  of <i>eltoo<\/i> suggests that the new confirmed operation automatically annuls the previous state of the channel: “Only the last concluded transaction will be confirmed on the block.”<\/p>\n<p>The first attempt to improve Bitcoin’s blockchain with the help of off-chain-transactions was &#8220;<i>consecutive numbers,<\/i>&#8221; which allowed tracking of which offline transactions were the newest and what amount remained in the balance after the last transaction<b>. <\/b>For example<b>, <\/b><i>if Alice had 10 BTC and sent Bob 1 BTC, consequently her balance fell to 9 BTC. This transaction received the serial number 1. If then she sent Bob 4 more BTCs, her balance would be 5 BTCs. This transaction would have the sequential number 2, and would be considered to be the newest<\/i>.<\/p>\n<p>Along with aspects of decentralization and privacy, Lightning has well-recognized strengths.<\/p>\n<ul>\n<li>First, the Lightning network does not threaten t<i>he bottleneck-debilitating fee problem<\/i>: the opening of a Lightning channel costs a few cents, so for more than 100,000 transactions, the channel will cost less than $20.<\/li>\n<li>Secondly, any participant can open a payment channel in the Lightning network, and this does not require the assistance of a third-party companies or expensive specialized equipment, thereby reducing the risk of the corporate centralization.<\/li>\n<\/ul>\n<p>Security in the Lightning network also promises to be high-level, thanks to the concept of <i>watch towers<\/i>, which will alert users if a hacker attempts to steal their funds.<\/p>\n<h2>Will Ethereum Surpass Bitcoin?<\/h2>\n<p><i>Ethereum<\/i> might have a chance of overtaking Bitcoin, since it’s becoming more widely used in different industries and spheres.<\/p>\n<p>According to analysts, Ethereum network employs more than 300,000 developers. Starting from May, 50,000 more programmers join each month. The reason for such activity is the high profitability of dApp, said the CEO of Aragon. Previously, he stated that he did not know any application developer on Ethereum, &#8220;who would not have become a millionaire.&#8221;<\/p>\n<p>Allair believes that decentralized applications will play a decisive role in the growth of the crypto-currency market.<\/p>\n<p>One of the decisive factors that contributed to the growth of crypto market last year was that Ethereum attracted a lot of developers ready to work with dApps. Now you can release new tokens on the coins blockchain or create a completely new kind of financial services, using the technology of smart contracts.<\/p>\n<p>Bryan Armstrong, the head of Coinbase, earlier stated that his portfolio has more Ethers than Bitcoins. The publication notes that the dominance of Ethereum’s blockchain over the Bitcoin’s blockchain is growing. About 90% of services and coins are developed on the basis of the distributed Ethereum registry, and this number keeps rising.<\/p>\n<p><i>Ethereum<\/i> is the prime platform of choice for almost all ICOs because of the ecosystem it’s building around. It promotes and develops real-world use cases and solutions. With the launch of <i>Casper, Plasma,<\/i> <i>sharding<\/i> and many other projects including upcoming hard forks (Constantinople and Serenity), Ethereum could upgrade and pump itself to the <i>theoretical maximum<\/i>, while Bitcoin could become the new digital gold. Experts say Ethereum won’t overtake Bitcoin in 2018-2019, but it has a lot of potential to do it later. Cryptos are unpredictable; all we have to do is wait.<\/p>\n<h2>Future Crypto Scenarios<\/h2>\n<p>It’s obvious that crypto is an inevitable phenomenon. More and more payment systems have started accepting crypto as currency, and that’s only the beginning. This is why the future of FIAT currency is questionable and crypto’s future is promising.<br \/>\nThe global market cap is worth only around $300 billion, and is still very volatile. Reasons for the market’s volatility and instability are:<\/p>\n<ul>\n<li style=\"list-style-type: none;\">governmental influence<\/li>\n<li style=\"list-style-type: none;\">trade moves by inexperienced investors<\/li>\n<li style=\"list-style-type: none;\">the behavior of “whales”<\/li>\n<li style=\"list-style-type: none;\">bullish (positive) and bearish (negative) trends<\/li>\n<li style=\"list-style-type: none;\">the security of exchanges and their pliability (resistance to hacker attacks). If an exchange gets hacked, it shakes up the whole market<\/li>\n<\/ul>\n<blockquote><p><em>&#8220;The crypto market is very overrated. 90% of all crypto projects will be extinct in the near future, while cryptocurrencies such as Bitcoin and Ethereum have way more potential than DotComs. Rapid growth in price is not an indicator of a “bubble.” Just think of Tesla, Facebook, and Google, which skyrocketed in their price in the first years. Right now, I can compare crypto to Apple in 2001. By the way, don’t make the same mistake as Ronald Wayne, who sold 10% of Apple shares only for $800. Keep HODLing &#8211; it’s a guaranteed long-term profit&#8221;.<\/em><\/p>\n<p><strong>Yoni Assia, CEO of eToro<\/strong><\/p><\/blockquote>\n<h2>Price Prediction for Bitcoin and Ethereum<\/h2>\n<p>Short-term predictions are not going to be mentioned, since nobody knows what to expect at the current stage. Long-term predictions, however, look promising:<\/p>\n<ul>\n<li>It’s believed that Bitcoin could hit $20,000-$25,000, and Ethereum could hit $3,000-$5,000 by the end of 2018.<\/li>\n<li>By the end of 2019, BTC might hit $60,000-$100,000, while ETH might be $15,000-$20,000.<\/li>\n<li><i>John Mcafee<\/i> (computer programmer and businessman) predicts that the price for 1 BTC by the end of 2022 is going to be $500,000. Sounds ridiculous, but it is not devoid of logic.<\/li>\n<\/ul>\n<h2>Conclusion<\/h2>\n<p><em>Bitcoin<\/em> has changed the way we view money forever, but Ethereum is so much more than just money. Joseph Lubin described it like this: “If <em>Bitcoin<\/em> is an app, <em>Ethereum<\/em> is an app store.” Who knows what developers are going to build on this platform in the next ten or twenty years? It&#8217;s going to be insane.<br \/>\nWhen the Internet first came around, people criticized it. They said its use cases were too limited, it was inaccessible, and it was never going to take off. How wrong were they? It&#8217;s been decades since they said that, and now it&#8217;s time to start looking forward again. In 2009, Satoshi Nakamoto introduced the world to <em>Bitcoin<\/em>, the first-ever blockchain technology. By doing so, he started a snowball effect that would change the world forever.[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>First, we need to understand what Bitcoin is without getting technical. Bitcoin can be viewed as a digital version of gold. Gold bars are used to store value. Essentially, you buy gold and store it somewhere longterm. The gold represents a portion of your wealth, and it can be more stable than FIAT currencies in [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":2101,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[133],"tags":[150,154,173,176,195,258],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Ethereum vs. Bitcoin. Will Ethereum Overtake Bitcoin?<\/title>\n<meta name=\"description\" content=\"What’s better - Ethereum or Bitcoin? What are their future prices going to look like? Will Ethereum be the next Bitcoin? What chances has it got? The big race between Bitcoin and Ethereum continues. Let’s check out their pros and cons.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Ethereum vs. Bitcoin. Will Ethereum Overtake Bitcoin?\" \/>\n<meta property=\"og:description\" content=\"What’s better - Ethereum or Bitcoin? What are their future prices going to look like? Will Ethereum be the next Bitcoin? What chances has it got? The big race between Bitcoin and Ethereum continues. Let’s check out their pros and cons.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-07-25T13:34:08+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-05T13:08:19+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/Bitcoin-vs-Ethereum-02.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/Bitcoin-vs-Ethereum-02.jpg\",\"width\":1024,\"height\":512,\"caption\":\"Bitcoin or Ethereum. Future of Bitcoin and Ethereum\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/\",\"name\":\"Ethereum vs. Bitcoin. Will Ethereum Overtake Bitcoin?\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/#primaryimage\"},\"datePublished\":\"2018-07-25T13:34:08+00:00\",\"dateModified\":\"2019-08-05T13:08:19+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/ce94472d48219af4b780950748f124e2\"},\"description\":\"What\\u2019s better - Ethereum or Bitcoin? What are their future prices going to look like? Will Ethereum be the next Bitcoin? What chances has it got? The big race between Bitcoin and Ethereum continues. Let\\u2019s check out their pros and cons.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/\",\"url\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/ethereum-better-than-bitcoin\/\",\"name\":\"Ethereum vs Bitcoin: Breaking Them Down Simply\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/ce94472d48219af4b780950748f124e2\",\"name\":\"ihor.balyuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"ihor.balyuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2015"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2015"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2015\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/2101"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2015"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2015"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2015"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}