{"id":2142,"date":"2018-08-01T11:20:57","date_gmt":"2018-08-01T11:20:57","guid":{"rendered":"https:\/\/applicature.com\/?p=2142"},"modified":"2022-01-20T15:41:44","modified_gmt":"2022-01-20T15:41:44","slug":"hedera-hashgraph","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph","title":{"rendered":"Hedera Hashgraph IDO: Vision and Working Principle"},"content":{"rendered":"<p>DLTs (distributed-ledger technologies) are significantly changing and enhancing current markets in a variety of areas. Though there are certain existing obstacles, Hedera Hashgraph IDO (coin launch) hits the global market by offering a breakthrough public ledger able to run and support numerous applications. Hedera has every chance of becoming a mass-adopted distributed ledger solving a variety of issues.<\/p>\n<p><iframe loading=\"lazy\" title=\"Hedera Hashgraph Launch Event NYC: Recap\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/F-t-KV3cXQA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<p>Hedera is a platform designed with implementation of its own technology (Hashgraph). It offers a new kind of consensus algorithm supporting smart contracts, and is capable of running all kinds of DApps.<\/p>\n<p>The Hashgraph IDO (Coin Launch) offers a platform providing people with a new, trusted, and secure way to collaborate and process transactions online without third-party or intermediary involvement. In comparison to other existing platforms, Hedera Hashgraph stands out with its high-speed performance, enhanced security, and fair conditions. Additionally, it does not require proof of work. The platform allows developers to build distributed apps using reliable and transparent sets of codes on a higher level than ever before, ensuring full control of these applications.<\/p>\n<p>The company’s mission is to present all users with a reliable and trusted online platform to:<\/p>\n<ul>\n<li>work, develop, create, conduct trades, and collaborate socially<\/li>\n<li>ensure a high level of personal safety and security<\/li>\n<li>enhance confidence and ensure trust in any interaction<\/li>\n<li>enable all to be a part of the digital future<\/li>\n<\/ul>\n<h2>Hashgraph IDO Review: How Does It Work?<\/h2>\n<p>Hedera Hashgraph functions as a governing council and network addressing all conventional market needs in a decentralized manner.<\/p>\n<p>The council consists of famous, distinguished entities and establishments from different areas worldwide.<\/p>\n<p>It will enumerate up to 39 prime entities\/enterprises from various respected industries. Participants will reflect a number of leading industries worldwide with famous and proven brands, deep experience, and the community positions to work out and develop new outlooks.<\/p>\n<p>The managing board will be chosen by the council. Hedera ensures that all users will be equal in voting, and there won’t be just one person controlling everything or a small group influencing general decision-making. Everyone will be able to contribute to decision-making in a democratic manner.<\/p>\n<p>Hedera’s main goal is to create a cyberspace providing trust and high security without involving centralized servers. All users will be protected from splitting\/forking and granted full code-base access and integrity.<\/p>\n<h2>Platform Key Characteristics<\/h2>\n<p>In order to promote any industry and give it the chance to fully realize itself, Hedera Hashgraph offers a platform combining high-performing, safe, governed, legal solutions to guarantee stability and best performance.<\/p>\n<p>Let’s take a closer look at these characteristics.<\/p>\n<h3>Performance<\/h3>\n<p>Built on its own technology, the Hedera platform provides a high level of performance with:<\/p>\n<ul>\n<li>advanced usage efficiency<\/li>\n<li>increased speed capable of processing numerous transactions in seconds<\/li>\n<li>extremely small latency period, due to the fact of it being processed in mere seconds<\/li>\n<\/ul>\n<p>Hedera performance provides:<\/p>\n<p><strong>1. Cost efficiency.<\/strong> The technology is inexpensive due to the fact that it does not use proof of work. One does not have to buy costly mining rings; instead, users are offered to the use of available and accessible hardware that is fast, affordable, and convenient.<\/p>\n<p><strong>2. Efficiency.<\/strong> There is no need to mine blocks in Hashgraph, which proves efficiency in terms of bandwidth use. In addition, the voting algorithm doesn’t claim supplementary node-voting messages.<\/p>\n<p><strong>3. Throughput.<\/strong> Hashgraph guarantees high speed and latency to process transactions in seconds. In the graphs below one can see clear tradeoffs between throughput, latency, a number of computers and geographic distribution. For 32 computers running at 50,000 transactions per second, consensus finality is reached in three seconds (across eight regions) and can drop to 1.5 or 0.75 seconds according to a number of regions.<\/p>\n<p><strong><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2178\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/1.jpg\" alt=\"Hashgraph Throughput 1 region\" width=\"493\" height=\"566\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/1.jpg 493w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/1-96x110.jpg 96w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/1-305x350.jpg 305w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/1-436x500.jpg 436w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/1-105x120.jpg 105w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/1-261x300.jpg 261w\" sizes=\"(max-width: 493px) 100vw, 493px\" \/><\/strong><\/p>\n<p><strong><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2179\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/2.jpg\" alt=\"Hashgraph Throughput 2 regions\" width=\"477\" height=\"566\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/2.jpg 477w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/2-295x350.jpg 295w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/2-421x500.jpg 421w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/2-93x110.jpg 93w\" sizes=\"(max-width: 477px) 100vw, 477px\" \/><\/strong><\/p>\n<p><strong><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2180\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/3.jpg\" alt=\"Hashgraph Throughput 8 regions\" width=\"458\" height=\"567\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/3.jpg 458w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/3-283x350.jpg 283w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/3-404x500.jpg 404w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/3-89x110.jpg 89w\" sizes=\"(max-width: 458px) 100vw, 458px\" \/>4. State efficiency.<\/strong> As soon as any event happens, all participants will be aware of it and know where exactly it is supposed to be placed in the history\/records. This is a 100% guarantee.<\/p>\n<h3>Security<\/h3>\n<p>To ensure an ideal standard of security, Hashgraph uses:<\/p>\n<ul>\n<li><strong>Cryptography.<\/strong> Cryptographic hashes are used within the system to encrypt communications and interactions, and also to sign all kinds of events. The TLS1.2 algorithms comply with security standards for private information protection.<\/li>\n<li><strong>aBFT.<\/strong> Asynchronous Byzantine Fault Tolerance ensures that a single individual or small group cannot prevent others from reaching a certain consensus. BFT protects from DDoS attacks and ensures resilience against attacks.<\/li>\n<li><strong>Acid compliance.<\/strong><\/li>\n<\/ul>\n<p>[table id=8 \/]<\/p>\n<ul>\n<li><strong>Distributed DoS resilience.<\/strong> A form of DoS attack happens when the attacker floods nodes with malicious messages, keeping it from functioning the right way (performing its role). The Hashgraph technology provides DDoS resilience by not placing any one node or small node group in charge of establishing consensus.<\/li>\n<\/ul>\n<h3>Fairness<\/h3>\n<p>Hashgraph provides everyone with equal rights and opportunities. There is no one person in charge of everything or responsible for assigning a timestamp to a certain transaction. It is calculated with a voting procedure in which consensus is established by nodes democratically.<\/p>\n<p>Hashgraph provides:<\/p>\n<ul>\n<li>fair access<\/li>\n<li>fair timestamps<\/li>\n<li>fair transaction order<\/li>\n<\/ul>\n<h3>Governance<\/h3>\n<p>The public-ledger governance model outlines the rules and general policy concerning software, coin issuance, and a reward\/incentives model.<\/p>\n<p>Hedera offers a permissioned governance model with an open consensus to ensure a higher level of trust, which is essential when dealing with cryptocurrencies globally.<\/p>\n<p>The <em>governance model<\/em> enables the election of a board and subcommittee members.<\/p>\n<p>They are authorized to:<\/p>\n<ul>\n<li>elect managers<\/li>\n<li>work out the participation policy<\/li>\n<li>regulate and vote upon coin rules<\/li>\n<li>discuss changes with regard to codebase<\/li>\n<\/ul>\n<p>The model proves security, reliability, and trust.<\/p>\n<p>The <em>open consensus model<\/em> deals with the process of nodes joining the network and eventually reaching consensus (order of transactions). The featured model creates a million-node decentralized network which eliminates the possibility of attacks like cryptocurrency forgery, inappropriate ledger modifications, etc.<\/p>\n<h3>Stability<\/h3>\n<p>Stability is Hedera’s priority. Technical and legal controls are created and worked out to grant stable working conditions not threatened by the forking possibility.<\/p>\n<p><strong>Technical controls <\/strong>provide:<\/p>\n<ul>\n<li><strong>signed state proofs:<\/strong> a third party can ensure that the received state represents full network consensus state<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2181 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/stability.jpg\" alt=\"Hedera Hashgraph stability\" width=\"595\" height=\"272\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/stability.jpg 595w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/stability-350x160.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/stability-500x229.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/stability-132x60.jpg 132w\" sizes=\"(max-width: 595px) 100vw, 595px\" \/><\/p>\n<ul>\n<li><strong>ledger ID:<\/strong> proof that includes all-member public keys and directly- or proxy-owned stakes listed in the “address book” necessary for signature validation<\/li>\n<li><strong>handling forks:<\/strong> in case certain users (a minority, for instance) want to create a separate ledger different from an existing one (and thereby forking an existing one), they will have to create a new ledger. This is technically possible, but they won’t have the ability to use the original address book, as it won’t be approved by other users. A new ledger has to be created with a new address book and unique features, thereby preventing all users from being forced to follow the fork in case they’re not interested in it.<\/li>\n<\/ul>\n<p><strong>Legal controls<\/strong> provide users with an open, transparent, and accessible codebase enabling everyone to view the code and its sources while verifying its correctness.<\/p>\n<p>Additionally, Hedera will ensure platform and crypto stability via licensing, and grant a transparent and stable codebase.<\/p>\n<h3>Regulatory Compliance<\/h3>\n<p>Know your customer (KYC) and anti-money-laundering (AML) policies are prioritized. An opt-in escrowed identity mechanism will offer participants the choice to tie their verified identity to other private crypto-accounts, providing the government with necessary supervision to prove regulatory compliance. This is optional, as every user can choose what type of information\/credentials to share.<\/p>\n<h2>Hashgraph ICO Review: Technology<\/h2>\n<p>From a technological perspective, Hedera offers sharding, staking, and smart-contract use. Let’s investigate these in detail.<\/p>\n<h3>Sharding<\/h3>\n<p>Initially, Hedera’s network will most likely function as one shard containing some nodes. With its development, the number of nodes will grow, justifying multiple shards.<\/p>\n<p>Sharding is advantageous because of the fact that each node does not have to process every transaction, as consensus can be processed simultaneously (in parallel). Considering that shards trust each other, one can send other action requests, and as long as these requests reflect the other shards’ consensus, everything is valid.<\/p>\n<p>This multiple-shard structure prevents actions like double-spending or other illegal behavior, achieving aBFT.<\/p>\n<p>Among other sharding characteristics:<\/p>\n<ul>\n<li>different shards will consist of randomly-grouped nodes<\/li>\n<li>every shard will contain a subset of nodes, sharing the same state as other ledger subsets<\/li>\n<li>transactions will be placed into consensus order within individual shards in the normal manner<\/li>\n<li>a master shard will randomly assign nodes to shards<\/li>\n<li>shards communicate with each other by exchanging messages between members<\/li>\n<li>every shard saves the history of records (messages) from the previous ones<\/li>\n<\/ul>\n<h3>Staking<\/h3>\n<p>In order to achieve network consensus, all coin-holders will be capable of setting up their own nodes. To eliminate Sybil attacks, Hedera implements a system that ensures every node will affect the consensus proportionally to the amount of cryptocurrency it possesses. To ensure that the network continues functioning, it is crucial to actually stake all the cryptocurrency.<\/p>\n<p>Proof of stake will be used to ensure that when a new node is added to the network, it will have to declare several accounts that it is capable of controlling and provide existing private keys. Only in this case will funds from these accounts be used in voting algorithms.<\/p>\n<p>If a coin-holder does not want to create his or her own nodes but owns a number of coins, he or she has an option to delegate to another account the right to use this stake and still earn, as the payment for node-running will be split between the participants. This mechanism is called proxy-staking:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2182 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Proxy-staking.jpg\" alt=\"Hedera Hashgraph proxy staking\" width=\"685\" height=\"406\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Proxy-staking.jpg 685w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Proxy-staking-350x207.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Proxy-staking-500x296.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Proxy-staking-600x356.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Proxy-staking-132x78.jpg 132w\" sizes=\"(max-width: 685px) 100vw, 685px\" \/><\/p>\n<h3>Smart Contracts<\/h3>\n<p>To significantly ease the process of DApp running, Hedera perfectly functions with a set of existing Solidity-written smart contracts. Considering the large number of Solidity libraries, the codes can be run unchanged within the platform.<\/p>\n<p>Find out <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/uses-for-smart-contract\">how smart contracts solve problems<\/a><\/span> and most prominent use cases.  If you&#8217;re interested in <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/smart-contracts-development\/\">developing your smart contract<\/a><\/span> for further use feel free to <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/contact-us\/\">contact Applicature<\/a><\/span> for guidance and assistance.<\/p>\n<h2>Coin Utility<\/h2>\n<p>Full information and coin characteristics are soon to be released. As of today, there is no precise information about coin metrics and funds allocation.<\/p>\n<p>It&#8217;s crucial to have well-developed token economics design and structure to further succeed in the project launch. Find out hot insights on <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/applicature-meetup-consensus-token-economics-hot-insights-on-the-event\">consensus and token economics event<\/a><\/span> held by Applicature.<\/p>\n<p>In general, it is known that the Hedera Hashgraph coin will be a fuel for the network, granting its owners access to Hedera DApps. The coin will have the option to be “staked” and used to run various nodes, and it is also expected to serve as a unit of value for liable use and Hedera governance motivation.<\/p>\n<h2>Roadmap and Milestones<\/h2>\n<p>The roadmap is being developed, as well, and the Hedera Hashgraph Coin Launch isn’t providing specific details, especially the Hashgraph Coin Launch date.<br \/>\nHedera expects its network to grow (from concentrated nodes and stake to widespread ones) according to the following steps representing gradual network and currency evolution:<\/p>\n<p>[table id=10 \/]<\/p>\n<p>&nbsp;<\/p>\n<h2>Team<\/h2>\n<p>The company was founded in France. Team members possess vast experience, and specialize in the following areas:<\/p>\n<ul>\n<li>product management<\/li>\n<li>business development<\/li>\n<li>technology, distributed-ledger technology (DLT), and startup development<\/li>\n<li>computer science<\/li>\n<li>strategic growth and development<\/li>\n<\/ul>\n<p>Hedera’s team consists of two founders:<\/p>\n<ol>\n<li>Lemon Baird: co-founder, CTO, chief scientist<\/li>\n<li>Mance Harmon: co-founder<\/li>\n<\/ol>\n<p>Core team members:<\/p>\n<ol>\n<li>Tom Trowbridge: President<\/li>\n<li>Jordan Fried: VP of Business Development<\/li>\n<li>Natalie Furman: General Counsel<\/li>\n<\/ol>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2170\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/07\/team.png\" alt=\"Hedera team members\" width=\"1890\" height=\"1417\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/team.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/team-350x263.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/team-500x375.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/team-768x576.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/team-600x450.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/team-132x99.png 132w\" sizes=\"(max-width: 1890px) 100vw, 1890px\" \/><\/p>\n<p>Other members include:<br \/>\n[table id=9 \/]<\/p>\n<p>In addition, Hedera Hashgraph is in partnership with twelve leading companies in the areas of business consulting, software\/technological support, and incubators.<\/p>\n<h2>Social Activity and Hype<\/h2>\n<p>Hedera Hashgraph has already drawn much attention, and considering that the project is in the development stage, various institutions, entrepreneurs, and developers are looking forward to its launch.<\/p>\n<p>Considering the advantages of Hashgraph architecture, everyone is waiting for high throughput and fast consensus solutions. According to the opinions of many, there probably won’t be any problem with raising enough funds to cover the Hashgraph ICO price.<\/p>\n<p>Hedera is socially active, with a <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"http:\/\/www.hederahashgraph.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">homepage<\/a><\/span>, <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"http:\/\/twitter.com\/hashgraph\" target=\"_blank\" rel=\"noopener noreferrer\">twitter <\/a><\/span>, and <a href=\"http:\/\/medium.com\/hashgraph\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Medium blog<\/span><\/a>. Hedera can be reached via the following social channels:<\/p>\n<ul>\n<li><a href=\"http:\/\/www.facebook.com\/hashgraph\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.facebook.com\/hashgraph<\/a><\/li>\n<li><a href=\"http:\/\/www.youtube.com\/watch?v=ZrFrXFdRW4k\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.youtube.com\/watch?v=ZrFrXFdRW4k<\/a><\/li>\n<li><a href=\"http:\/\/www.instagram.com\/hashgraph\/\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.instagram.com\/hashgraph\/<\/a><\/li>\n<li><a href=\"http:\/\/www.linkedin.com\/company\/11297622\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.linkedin.com\/company\/11297622<\/a><\/li>\n<li><a href=\"http:\/\/www.reddit.com\/r\/hashgraph\/\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.reddit.com\/r\/hashgraph\/<\/a><\/li>\n<li><a href=\"http:\/\/t.me\/hashgraph\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/t.me\/hashgraph<\/a><\/li>\n<li><a href=\"http:\/\/github.com\/hashgraph\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/github.com\/hashgraph<\/a><\/li>\n<\/ul>\n<p>To sum up, it should be noted that the Hedera Hashgraph ICO  has very high chances of success, as the technology behind it is promising and sounds fantastic. There is great potential for long-term holders due to an outstanding business model and technical architecture. Other positive aspects to be noted are:<\/p>\n<ul>\n<li>the high throughput and fast consensus speed necessary for global adoption<\/li>\n<li>a strong team and established partnerships with leading organizations<\/li>\n<li>high buzz around the project and increased interest from numerous investors and companies<\/li>\n<\/ul>\n<h2>Contradictory Opinions<\/h2>\n<p>There are several negative aspects, as well, even though full project information hasn’t been provided yet.<\/p>\n<p>Hence, coin metrics aren’t clarified, nor are coin\/funds distribution and allocation. These are several important aspects to be talked through.<\/p>\n<p>The roadmap outlines just the major working principles, but there are no dates or precise business plan offered for consideration. The Hashgraph ICO date has not yet been clarified.<\/p>\n<p>Some experts believe that Hedera could be overly controlled by the government or centralized authority. Considering that there is a governing council, all decisions depend upon their approval. If the council is corrupt, users won’t have the ability to vote and change this situation. This opinion is questionable, though; according to the information provided by Hedera, no single person or small group of people will have the ability to influence council decisions.<\/p>\n<h3>Technological System Concerns<\/h3>\n<p>Other concerns are rising within technological system aspects. aBFT-based systems (like Tange in IOTA) require nodes, but for smart-contract execution, nodes are needed to establish a virtual machine (VM). This means that<\/p>\n<p>Hedera Hashgraph has an additional layer of requirements to gain computational power for VM with the implementation of PoS consensus. This is not related to Hashgraph itself, but causes questions about security, as aBFT is considered a fast, secure consensus. PoS consensus in any configuration will be less secure, as it is more vulnerable to potential attacks.<\/p>\n<p>There is an unresolved question about how the system will protect bandwidth from self-DDoS within these shards. The same approach is being used in EOS, and it is a known statement of their team that it is the responsibility of developers to avoid such issues. Ethereum is staying more conservative, and continues to require gas for smart-contract protection. Hedera has no answers yet, at least publicly. In any case, this will influence platform speed for smart-contract execution, and it is critical to know whether their VM will be powerful and protected enough to handle smart contracts faster than Ethereum. This would be a huge advantage, together with transaction speed (output of smart contracts). Otherwise, aBFT will bring little value, and just slightly reduce time on the transmission of data between smart contracts, which is not a major issue for DApps.<\/p>\n<p>Let’s wait and see what else Hedera is going to offer and what solutions it will provide, as coin metrics and roadmap development are just a question of time!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>DLTs (distributed-ledger technologies) are significantly changing and enhancing current markets in a variety of areas. Though there are certain existing obstacles, Hedera Hashgraph IDO (coin launch) hits the global market by offering a breakthrough public ledger able to run and support numerous applications. Hedera has every chance of becoming a mass-adopted distributed ledger solving a [&hellip;]<\/p>\n","protected":false},"author":12,"featured_media":2173,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[137],"tags":[154,213,215,270],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Hedera Hashgraph ICO : Trusted, Empowered Vision for Everyone<\/title>\n<meta name=\"description\" content=\"The Hedera Hashgraph ICO (coin launch) will soon offer users a completely new-level platform for distributed application-building. We offer this Hashgraph ICO review to stress the project’s best advantages along with aspects to be developed.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Hedera Hashgraph ICO : Trusted, Empowered Vision for Everyone\" \/>\n<meta property=\"og:description\" content=\"The Hedera Hashgraph ICO (coin launch) will soon offer users a completely new-level platform for distributed application-building. We offer this Hashgraph ICO review to stress the project’s best advantages along with aspects to be developed.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-08-01T11:20:57+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-20T15:41:44+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/hedera-hashgraph-coins-launch.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/07\/hedera-hashgraph-coins-launch.jpg\",\"width\":1024,\"height\":535,\"caption\":\"Hedera Hashgraph Coin Launch\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/\",\"name\":\"Hedera Hashgraph ICO : Trusted, Empowered Vision for Everyone\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/#primaryimage\"},\"datePublished\":\"2018-08-01T11:20:57+00:00\",\"dateModified\":\"2022-01-20T15:41:44+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/17f46426cb241f38a85a4789b6367bc1\"},\"description\":\"The Hedera Hashgraph ICO (coin launch) will soon offer users a completely new-level platform for distributed application-building. We offer this Hashgraph ICO review to stress the project\\u2019s best advantages along with aspects to be developed.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/hedera-hashgraph\/\",\"name\":\"Hedera Hashgraph IDO: Vision and Working Principle\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/17f46426cb241f38a85a4789b6367bc1\",\"name\":\"Olga Hryniuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Olga Hryniuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2142"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2142"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2142\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/2173"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2142"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2142"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2142"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}