{"id":217,"date":"2017-12-29T18:54:43","date_gmt":"2017-12-29T18:54:43","guid":{"rendered":"https:\/\/applicature.com\/?p=217"},"modified":"2019-08-01T12:58:20","modified_gmt":"2019-08-01T12:58:20","slug":"blockchain","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain","title":{"rendered":"Blockchain for Supply Chain Management: the Next Technological Revolution"},"content":{"rendered":"<h1>Transparency and Traceability in the Supply Chain<\/h1>\n<p><span style=\"font-weight: 400;\">Selling certain things to a customer is based on the supply chain. Almost all companies engaged in the purchase and sale sphere cope with the fundamental phases of supply chain management. Trust and transparency in the supply chain are the two most sustainable factors for running an efficient process. What does blockchain predict for supply chain management? Read on, and figure out what the key benefits of this new robust ledger technology are.<\/span><\/p>\n<h2>Supply Chain Principles<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-219\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/supply_chain.jpg\" alt=\"supply_chain\" width=\"4500\" height=\"3000\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply_chain.jpg 1536w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply_chain-350x233.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply_chain-500x333.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply_chain-768x512.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply_chain-1024x683.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply_chain-600x400.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply_chain-132x88.jpg 132w\" sizes=\"(max-width: 4500px) 100vw, 4500px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Let’s provide the definition of the supply chain notion, its management, and the basic principles of the supply chain process. The supply chain is the cumulative network of different entities, individuals, information, and resources involved in a product’s creation, transportation, and sale, from the original manufacturer to the end customer. It combines the following process stages:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">raw material supply<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">converting materials into products<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">warehouse storage<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">distribution and delivery to retailers<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">delivering the product to the ultimate consumer<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Supply chain segment and logistics are often confused notions. <\/span><i><span style=\"font-weight: 400;\">Logistics<\/span><\/i><span style=\"font-weight: 400;\"> simply refers to the transportation of goods, whereas <\/span><i><span style=\"font-weight: 400;\">supply chain<\/span><\/i><span style=\"font-weight: 400;\"> covers many other fields. Thus, logistics is only part of the supply chain. The entire chain includes the coordination of raw materials delivery from supplier to producer to ultimate user. The supply chain impacts the quality and time frame of product manufacturing. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The whole process of delivering the materials from the supplier to the manufacturer, from manufacturer to retailer, from retailer to the end customer, must be managed. <\/span><\/p>\n<h2>What is Supply Chain Management (SCM)?<\/h2>\n<p><span style=\"font-weight: 400;\">Supply chain management <\/span><span style=\"font-weight: 400;\">is the crucial process of optimization leading to lower costs and profitable results for companies. It creates a sustainable, competitive advantage while maximizing customer value. SCM covers product development, production, logistics, and the information systems that coordinate these undertakings. The aim of SCM is to control the shipment, delivery, and distribution process while cutting costs and optimizing time management.<\/span><\/p>\n<p>SCM is important to the success of any business. Hence, it requires close monitoring of all costs paid and procedures. Supply Chain Management impacts the development of supply chains in an efficient way. CSM is based on the idea that every product is the result of the efforts of the many entities of the supply chain.<\/p>\n<p><span style=\"font-weight: 400;\">According to <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.investopedia.com\/terms\/s\/scm.asp\"><span style=\"font-weight: 400;\">Investopedia<\/span><\/a><\/span><span style=\"font-weight: 400;\"> explanation of SCM, it attempts to coordinate these efforts while minimizing costs and trimming fat. There is the example of Conglomo, making its widgets in a domestic factory. Conglomo negotiates with suppliers to buy the raw materials it needs and staffs the factory with paid workers to build the widgets. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The company also provides the factory with supplies to run operations: everything from equipment to light bulbs. The factory packages and ships the final widgets to stores for sale, requiring packaging supplies and equipment, trucks, drivers, fuel, and insurance. SCM centrally controls production, shipment, and distribution.<\/span><\/p>\n<h3>SCM challenges: Traceability and Transparency<\/h3>\n<p><span style=\"font-weight: 400;\">Due to the growing difficulties in supply chain management, this business field usually copes with challenges that are complicated to solve. Within the global business supply chain, traceability plays the most decisive role in the advancement of its sustainability.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Why is it so crucial for small and large businesses to maintain traceability and transparency of all processes within supply chain management? <\/span><i><span style=\"font-weight: 400;\">Traceability<\/span><\/i><span style=\"font-weight: 400;\"> is the whole system connecting all the stages in the chain together. It is the ability to identify and trace the history, distribution, location, and application of products, parts, and materials. As a result, a traceability system follows, records, and controls the process, from supplier to ultimate consumer.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Food and drug safety is one of the vital things to trace and control. With increasing demands from governments, suppliers, buyers, and consumers, traceability ensures information on the origin of food and goods, as well as the conditions under which they are produced, preserved, and transported.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-220 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/supply-chain-challenges.png\" alt=\"supply_chain_challenges\" width=\"609\" height=\"221\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply-chain-challenges.png 609w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply-chain-challenges-350x127.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply-chain-challenges-500x181.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply-chain-challenges-600x218.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/supply-chain-challenges-132x48.png 132w\" sizes=\"(max-width: 609px) 100vw, 609px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Traceability includes information on products’ components, quality, and safety. The collaboration of companies involved in the supply chain should provide in-depth, real-time insights, plus the mechanisms for analyzing the information gathered through the manufacturer management system. According to the practical guide of the <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.unglobalcompact.org\/library\/4481\"><span style=\"font-weight: 400;\">United Nations Global Compact<\/span><\/a><\/span><span style=\"font-weight: 400;\"> (UNGC), collaboration is the best practice for supply chain traceability:<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-221 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/traceability-ungc.png\" alt=\"suuply_chain_traceability\" width=\"714\" height=\"482\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traceability-ungc.png 714w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traceability-ungc-350x236.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traceability-ungc-500x338.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traceability-ungc-600x405.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traceability-ungc-132x89.png 132w\" sizes=\"(max-width: 714px) 100vw, 714px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Supply chain actors are responsible for tracking products from the source to the consumer, tracing their origin, and detailing their history of delivery. Mislabeling is one of the disadvantages of bad management in supply-chain segment. With traceability systems, one can perform more effective audits and share data. <\/span><\/p>\n<p>There are several factors affecting supply chain complexity. Due to the customers’ demands to have a product in time and for the reasonable price, it is very difficult to create an efficient supply chain. Finally, we are going to review some problems of supply chain management and traceability which hinder its sustainability:<\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Globalization and Customers’ Demands<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">In the globalization context, there exists a huge opportunity for fraudsters due to complex supply chains. Normally, a customer wishes to get his product immediately, and for a reasonable price. For this reason, companies have to relocate their manufacturing to countries where the price is lower. Correspondingly, this acquires extended time for implementation. Supply chain requires strict control and verification across all the stages of the process.<\/span><\/p>\n<ul>\n<li>Food Fraud<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">A lack of transparency is always the reason for food fraud. With the growth of highly-organized criminal activity, the supply chain often suffers from this natural phenomenon.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, it is very complicated for food safety systems to effectively detect and mitigate fraud. Therefore, food fraud adversely affects the population’s general state of health, and damages companies’ brands and reputations. According to the<\/span><span style=\"color: #e70f00;\"><span style=\"font-weight: 400;\"> Rey Global Food Safety<\/span><\/span><span style=\"font-weight: 400;\"> Initiative (GFSI), which provides cutting-edge information on food fraud, the most commonly reported frauds belong to fish, olive oil, milk, and honey. <\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-222 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/food-fraud.png\" alt=\"food_fraud_in_supply_chain\" width=\"482\" height=\"363\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/food-fraud.png 482w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/food-fraud-350x264.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/food-fraud-132x99.png 132w\" sizes=\"(max-width: 482px) 100vw, 482px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Companies are losing money, and customers are losing faith. Food fraud is estimated to cost the global food industry U.S. $30 billion to $40 billion every year. But that’s just the economic cost.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a transformative technology, blockchain may resolve this type of problem. This technology will keep all the players in supply chain management open, and record their every operation in a transparent and decentralized way. We will be discussing this huge opportunity in the next section. <\/span><\/p>\n<ul>\n<li>The Information Gap<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">A lack of automation not only impacts supply chain organization but also creates uncertainty in finance organization. As shown in Figure 3, an astounding 90% of enterprises report that their global supply chain technology is inadequate to provide the corporate finance organization with the timely information it requires. This information includes accurate costs and delivery dates for budgets, cash flow planning, and management. Thus, the financial productivity of enterprises is being undercut by the lack of the global supply chain visibility and automation, which are vital weapons against uncertainty.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-223 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/information-gap-supply-chain.png\" alt=\"information_gap_supply_chain\" width=\"542\" height=\"285\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/information-gap-supply-chain.png 542w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/information-gap-supply-chain-350x184.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/information-gap-supply-chain-500x263.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/information-gap-supply-chain-132x69.png 132w\" sizes=\"(max-width: 542px) 100vw, 542px\" \/><\/p>\n<blockquote><p><img loading=\"lazy\" class=\"size-full wp-image-467 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/Quote-Lo-Bello.png\" alt=\"supply chain management\" width=\"578\" height=\"195\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Quote-Lo-Bello.png 578w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Quote-Lo-Bello-350x118.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Quote-Lo-Bello-500x169.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Quote-Lo-Bello-132x45.png 132w\" sizes=\"(max-width: 578px) 100vw, 578px\" \/><\/p><\/blockquote>\n<p><span style=\"font-weight: 400;\">A properly-designed traceability system is crucial to ensure that data collection is managed effectively and that the right data are collected. Companies need to exchange traceability data with other actors in the supply chain. The sharing of information and good communication between the different actors in the supply chain are important aspects of successful supply- chain traceability. <\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Non-Compliance with the Standards <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Standards provide information about the social and environmental performance of goods and services, including information about the supply chain. When consumers purchase labeled or certified products, they are sufficiently convinced that they are buying sustainable, environmentally-friendly, safe, high-quality products. They trust the standards rather than the product or companies that make the product. The problem is that the systems for implementing standards are never perfect.<\/span><\/p>\n<ul>\n<li>Lack of transparency<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">In our everyday lives, we deal with many material products without hesitation to use them. We know a little about the things we purchase at the market or in the stores. It is a long journey for a supplier to deliver the product to the end consumer. A vast network of so many entities and individuals remains obscure in the way it is collaborated and compiled. Production, delivery, supply, storage, and distribution take prolonged time for implementation. The lack of transparency in supply-chain management has a plenty of negative consequences, including food fraud, infections, unsafe working conditions, harmful substances, improper food storage conditions, low-quality products, etc.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In this case, it is worth mentioning the horsemeat scandal, during which sold and supplied beef products in the U.K. were found to contain horse DNA. The mass media announced this on BBC news in April 2013. 50,000 tons of horse meat had been supplied across Europe since 2011. According to the <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"http:\/\/www.who.int\/mediacentre\/news\/releases\/2015\/foodborne-disease-estimates\/en\/\"><span style=\"font-weight: 400;\">World Health Organization<\/span><\/a><\/span><span style=\"font-weight: 400;\">, each year, as many as 600 million (or almost one in ten people in the world) fall ill after consuming contaminated food. Of these, 420,000 people die.<\/span><\/p>\n<h2>Blockchain Solutions for Supply Chain Management: an Important Tool in Digitized Supply Chains<\/h2>\n<p><span style=\"font-weight: 400;\">Blockchain, the ledger technology, is captivating the world with skyrocketing speed. The confirmation of this fact was noted in <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/qz.com\/1130015\/the-blockchain-obsession-in-corporate-boardrooms-is-spreading\/\"><span style=\"font-weight: 400;\">Quartz<\/span><\/a><\/span><span style=\"font-weight: 400;\">, which stated that blockchain has captured corporate executives who cannot afford to ignore it anymore. Compared to last year, blockchain mentions in quarterly reports and conference calls have more than tripled this earnings season. The statistics display that over a period of four weeks in October-November, blockchain mentioning by corporate executives was used 665 times. Robust companies with a wide range of industries are involved in ledger technology. <\/span><span style=\"font-weight: 400;\">Among them are the following: IBM, Walmart, Estée Lauder, NVIDIA, Oracle, Maersk, Citigroup, Webjet, UPS, Western Union, and others. <\/span><\/p>\n<blockquote><p>During an IBM presentation, Martin Schroeter, CFO, said:<\/p><\/blockquote>\n<p><img loading=\"lazy\" class=\"size-full wp-image-468 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/blockchain-solutions-for-supply-chain.png\" alt=\"blockchain solutions for supply chain\" width=\"640\" height=\"160\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-solutions-for-supply-chain.png 640w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-solutions-for-supply-chain-350x88.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-solutions-for-supply-chain-500x125.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-solutions-for-supply-chain-600x150.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-solutions-for-supply-chain-132x33.png 132w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Has the increase in Bitcoin price had an impact on blockchain chatting? Certainly, yes; it is part of the reason. According to <\/span><i><span style=\"font-weight: 400;\">Quartz<\/span><\/i><span style=\"font-weight: 400;\">, there is more likely an assumption that corporate execs are talking about blockchain as the sky-high price of Bitcoin has made the technology impossible to avoid. <\/span><\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-224\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain.png\" alt=\"blockchain_mentionings\" width=\"1280\" height=\"720\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain.png 1280w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain-350x197.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain-500x281.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain-768x432.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain-1024x576.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain-600x338.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Company-earnings-reports-calls-name-checking-blockchain-132x74.png 132w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" \/><\/p>\n<h2>Centralization vs. Decentralization<\/h2>\n<p><span style=\"font-weight: 400;\">To start with, let’s figure out what this huge animal called blockchain is, and let’s make a differentiation between centralization and decentralization. Centralization means that all transactions are made via third parties, which all have different internal systems—their own visions and business models. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Due to these factors, there are many frictions and much paper documentation leading to non-compliance with the legitimacy, inefficiency, and obscure state of the situation. In such networks, every participant can change the data history, which creates vulnerability with high-cost payments. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">Decentralization is an entirely new and opposite notion. The ledger where all transactions are fixed and saved is immutable and is distributed among all the nodes of the network. Everyone in the network is able to view the transaction history and all the data they have permission to see. Thus, decentralization forms the basis of blockchain technology, ensuring trust, transparency, and traceability within business processes.<\/span><\/p>\n<h2>Why Is Decentralized Technology Suitable for Modern Supply Chains?<\/h2>\n<p><img loading=\"lazy\" class=\"size-full wp-image-234 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/blockchain.jpg\" alt=\"blockchain\" width=\"960\" height=\"714\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain.jpg 960w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-350x260.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-500x372.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-768x571.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-600x446.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-132x98.jpg 132w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">This question requires an advanced answer. The aforementioned challenges of supply-chain management strictly indicate the need to take measures for efficiency. Historically, there has been a diverse set of issues affecting the sustainable development of the supply chain. For decades, the supply chain has suffered from three main problems: data visibility, customer demand management, and process optimization. Certainly, blockchain technology cannot serve as the pill to solve all problems, but it may help to improve the process of traceability, trust, and transparency. Ledger-digitized technology is trustworthy because it increases credibility and accountability within and between businesses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Plenty of industries have implemented blockchain, with its ability to maintain privacy and security in business development. Our aim is to help businesses select and deploy the right blockchain technology for their business cases, as well as to develop applications based on the blockchain. For companies’ insurance, blockchain provides smart contracts between the businesses. This provides an additional level of security and reduces costs without the need for third-party accounting services. <\/span><\/p>\n<h3>Why Does Supply-Chain Management Really Need this Powerful Digitized Tool? What Does It Predict?<\/h3>\n<p><span style=\"font-weight: 400;\">Blockchain is a decentralized, distributed digital ledger providing all participants in the supply chain the ability to conduct business-to-business exchanges. It is a single immutable database, as no one can change or delete the transactions. Therefore, potential fraud schemes are impossible to apply <\/span><i><span style=\"font-weight: 400;\">a priori<\/span><\/i><span style=\"font-weight: 400;\">. First of all, blockchain provides transparency, trust, and traceability for supply-chain management. The following advantages of ledger technology may, in the future, totally change the state of supply-chain management. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The advantages of blockchain technology for supply chains:<\/span><\/p>\n<ul>\n<li><strong>Safe Transactions Among All Players <\/strong><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">A decentralized supply chain is a distributed peer-to-peer network in which all players in the process are able to fix transactions and validate them in real time. Each participant can view the progress of goods across the whole supply-chain ecosystem. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A transparent and shared network is permitted. This means that due to the presence of confidential data, there are restrictions on who can take part and in what capacity, and who can have access to the network. In order to contribute, participants must receive an invitation and then validation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">No other individual can participate in the network; however, validated members can view all transactions made so far without the ability to change them. Based on this specific level of permission, all players in the supply chain have end-to-end visibility of the network. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The decentralized peer-to-peer model allows the involvement of participants in open, transparent collaboration with each other, with no opportunity to cheat or deceive.<\/span><\/p>\n<ul>\n<li><strong>The Provenance of Traceability<\/strong><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">No one can modify or delete the records without the permission of other participants. Blockchain enables the detailed traceability of assets, under the conditions of which they remain the responsible party\/owner(s) without question. <\/span><\/p>\n<figure id=\"attachment_225\" aria-describedby=\"caption-attachment-225\" style=\"width: 1280px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-225 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1.jpg\" alt=\"Blockchain_food_traceability\" width=\"1280\" height=\"720\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1.jpg 1280w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1-350x197.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1-500x281.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1-768x432.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1-1024x576.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1-600x338.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Retail-Food-Traceability-Transparency-1-132x74.jpg 132w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" \/><figcaption id=\"caption-attachment-225\" class=\"wp-caption-text\">Source: Blockchain and food safety with IBN and Walmart (Frank Yiannis)<\/figcaption><\/figure>\n<ul>\n<li><strong>Cybersecurity <\/strong><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Nowadays, the modern trends in various industries are digital technologies, which can considerably simplify all business operations. With these innovative solutions, however, there are increased risks of cyber attacks. Blockchain technology can help to keep precious data private and protect supply chains’ operations. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">In <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/medium.com\/\"><span style=\"font-weight: 400;\">Medium<\/span><\/a><\/span><span style=\"font-weight: 400;\">, Marin Ivezic, cybersecurity partner at PwC, shared his opinions in an article on blockchain for cybersecurity: <\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-469 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/blockchain-for-cybersecurity.png\" alt=\"blockchain for cybersecurity\" width=\"652\" height=\"238\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-for-cybersecurity.png 652w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-for-cybersecurity-350x128.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-for-cybersecurity-500x183.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-for-cybersecurity-600x219.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain-for-cybersecurity-132x48.png 132w\" sizes=\"(max-width: 652px) 100vw, 652px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">He stated that this idea has the potential to become a part of the supply-chain cyber and cyber-physical systems security efforts that are of great concern to countries around the globe, particularly noticeable in the efforts put forth in recent years by the U.S., China, Russia, India, and others. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In summary, it is worth saying that smart contracts built on blockchain are written as code in the blockchain, ensuring trust between the parties. The individuals involved are anonymous, but the contract is a public ledger. The system as a whole is less vulnerable to hacks and unauthorized modifications. No one outside the network can make alterations on blockchain applications or validate them. Only network members have access. Thus, cybersecurity <\/span><span style=\"font-weight: 400;\">is much more robust and restrains hackers from stealing private data. If you need help implementing your token distribution logics, business behavior, and storage in a decentralized way, the Ethereum ecosystem is the way to go—and <\/span><a href=\"https:\/\/applicature.com\/\"><span style=\"font-weight: 400;\"><span style=\"color: #e70f00;\">we can help<\/span>.<\/span><\/a><\/p>\n<ul>\n<li><b>Automotive Operating Costs and Saving Time<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">There is no need to hire banking systems and auditing services for making payments and finance transfers from payer to payee. Blockchain makes these procedures simple. Secure, rapid operation in minutes saves costs and reduces fees compared to standard audit clearing houses, which take several days to fulfill payment.<\/span><\/p>\n<ul>\n<li><strong>Fraud prevention<\/strong><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The increase of regulatory and consumer-demand provenance information is of substantial importance for business brands and reputation. In order to conduct criminal schemes, fraudsters delete or change information in accounting systems, substituting documents with their own fake files. On a blockchain network, there is no centralization; every transaction is made across the network between all participants. These transactions are fixed and saved on the shared decentralized ledger, where their visibility and transparency will not allow fraudsters to alter information or delete data. Due to this immutable transaction history, manufacturers’ goods will have provenance. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Let’s see how the history of transactions is created. There is an intelligible explanation provided on the <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.ibm.com\/blogs\/blockchain\/\"><span style=\"font-weight: 400;\">IBM Blog<\/span><\/a><\/span><span style=\"font-weight: 400;\">. Before adding a new transaction block on the network, its validation must be agreed to by network participants. This is called consensus. The blocks have a timestamp, are secured by a cryptographic private key, and are linked to the previous block in the chain. You can definitely add a new transaction to the network, but all original records will be open and traceable. In this case, blockchain serves as the network where everyone in the chain can view the asset origin, its owner, and its track of progress. <\/span><\/p>\n<ul>\n<li><b>Reduction in Delays Due to Paperwork<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Still, some companies undertake manual paperwork, which leads to transportation and payment delays. A decentralized platform will make all these operations quickly, safely, and transparently without third-party involvement. Blockchain implementation promises to be an optimal, high-level solution over the next few years. First, it predicts provision of a secure means for financial transactions and data-sharing. Manual paperwork has errors in orders, invoices, and other related documents due to human nature. Blockchain electronic documents have the potential to be a good substitution. <\/span><\/p>\n<h2>The Implementation of Blockchain for Supply-Chain Management<\/h2>\n<p><img loading=\"lazy\" class=\"size-full wp-image-237 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/blockchain_implementation_in_supply_chain.png\" alt=\"blockchain_implementation_in_supply_chain\" width=\"979\" height=\"570\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_implementation_in_supply_chain.png 979w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_implementation_in_supply_chain-350x204.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_implementation_in_supply_chain-500x291.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_implementation_in_supply_chain-768x447.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_implementation_in_supply_chain-600x349.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_implementation_in_supply_chain-132x77.png 132w\" sizes=\"(max-width: 979px) 100vw, 979px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Blockchain empowers the supply-chain sphere, fundamentally drawing in the interest of big worldwide players who wish to deploy it because of its lack of transparency, especially in the food sector. It has already inspired IT players and startups to launch new pilot projects that have been successfully developed alongside supply-chain management. <\/span><\/p>\n<h3>Walmart and IBM Collaboration in the Food Safety Alliance<\/h3>\n<p><span style=\"font-weight: 400;\">In an IBM press release on 14 December 2017, it was stated that IBM, Walmart, and Tsinghua University have recently announced their collaboration in the Food Safety Alliance to enhance food tracking, traceability, and safety in China, and to achieve greater transparency across the food-supply chain.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is worth mentioning that IBM and Walmart have already piloted the common blockchain project on tracking food items, including pork in China and mangoes in the U.S.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Walmart’s food safety solutions are built on the IBM blockchain platform. Frank Yinass, Walmart vice president: <\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-470 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/IBM-blockchain-solutions.png\" alt=\"IBM blockchain solutions\" width=\"646\" height=\"155\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/IBM-blockchain-solutions.png 646w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/IBM-blockchain-solutions-350x84.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/IBM-blockchain-solutions-500x120.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/IBM-blockchain-solutions-600x144.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/IBM-blockchain-solutions-132x32.png 132w\" sizes=\"(max-width: 646px) 100vw, 646px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">He said that all the transparent information will show insights that will allow people to have a safer, more affordable and sustainable food system. It will essentially reduce the time of tracing the goods: from days and weeks to minutes.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The collaboration helps to ensure brand owners’ data privacy while helping them integrate their online and offline traceability for food safety and quality-management channels. Companies that join the alliance will be able to share information using blockchain technology, and plans include them being able to choose the standards-based traceability solution that best suits their needs and legacy systems. This will, in turn, bring greater transparency to the supply chain and introduce new technologies to the retail sector designed to create a safer food environment and enhance the consumer experience.<\/span><\/p>\n<h2>Technical Blockchain Implementation for the Supply Chain<\/h2>\n<p><span style=\"font-weight: 400;\">How to use blockchain for supply-chain management? In this section, we touch on the technical methods of blockchain implementation, models of business processes, blockchain architecture, and client application specifications<\/span><span style=\"font-weight: 400;\">. <\/span><span style=\"font-weight: 400;\">Our understanding is that you need the solution that will prove provenance to your customers as well as further optimize resources arising from the benefits of data availability and new approaches to business and technology.<\/span><\/p>\n<h3>Business Process Modelling. BPMN 2.0<\/h3>\n<p><img loading=\"lazy\" class=\"size-full wp-image-235 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/bpm.png\" alt=\"blockchain-bpm\" width=\"340\" height=\"340\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/bpm.png 340w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/bpm-300x300.png 300w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/bpm-100x100.png 100w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/bpm-110x110.png 110w\" sizes=\"(max-width: 340px) 100vw, 340px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">How can you predict the future state of your business and analyze the current one? There is one effective tool called Business Process Modeling. It is a high-priority mechanism for businesses to improve processes, applying functioning tools and navigation for their effective operation. BPM is a mechanism intended to map out a workflow of business processes for analysis and advancement. This method is applied by representing different activities, steps, logical decisions, events, and resources to optimize their efficiency and improve business performance. Visualizations of the processes through diagrams, charts, and maps are used to make better decisions. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We are strongly convinced that streamlined management and well-organized work process are key priorities for smooth and flexible team functioning. BPM combines steps such as Process Mapping, Process Discovery, Process Simulation, Process Analysis, and Process Improvement.<\/span><\/p>\n<h4>Why Use Business Process Modeling?<\/h4>\n<p><span style=\"font-weight: 400;\">In this section, we are going to share the benefits of BPM and why we use it in business cases. Business Process Modeling instruments allow representation of business processes using digital transformation and automated events. In ancient times, work processes were conducted by one person from start to finish. It was definitely a time-consuming and inefficient means of production and operation. It took the last two decades to replace previous organizational techniques once BPM emerged. Through the evolution of process practices, analysts and the creators of business process tools have been learning to describe, reengineer, and standardize business processes. As a result, Business Process Modeling Notation (BPMN) has become something of a standard. The Object Management Group (OMG) has further developed it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">BPM provides plenty of benefits in business performance. Here we share highlights of some of them.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">FEATURES of Process Modeling:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">BPMN combines both IT processes and people processes<\/span><\/span><\/li>\n<li><span style=\"font-weight: 400;\">Process Communication Improvements<\/span><\/li>\n<\/ul>\n<p>Due to a common unified language, communication and decision-making are easier to implement. Well-shaped process modeling offers rapid training for new people. It also minimizes potential danger of staff loss. Mapping and flowcharts are perfect for shaping a good understanding of the situation for business managers, who want to communicate their ideas quickly and clearly.<\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Consistency and Control <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The process is executed in a consistent manner with a documented process, rather than relying on people. Modeling rules make decisions better. As for regulatory policy, BPMN ensures compliance with legal regulations by following company guidelines. <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The Visual Shape of the Processes<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Visual representations simplify the understanding of the general picture, making it comprehensive.<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Operational Efficiency Improvement<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Process Simulation is used to promote optimization, allowing analysis and understanding of process flows. It reduces cycle time, increases the productivity of existing resources, and enables better resource utilization. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Align Operations<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Business Process Modeling is a tool for team members to execute business tasks and activities in accordance with strategy implementation.<\/span><\/p>\n<h3>Business Process Modelling Notation (BPMN 2.0)<\/h3>\n<p><span style=\"font-weight: 400;\">Now we are going to briefly touch upon the technique of BPMN 2.0, which is widely applied across companies and organizations. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">BPMN 2.0 is the new industry standard our company applies for businesses to run their processes efficiently. It was last updated in 2011. According to BPMN 2.0 specifications, the primary aim of BPMN is to provide a notation that is readily understandable by all business users, from the business analysts that created the initial drafts of the processes to the businesspeople who will manage and monitor those processes. Thus, BPMN creates a standardized bridge for the gap between business process design and process implementation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This international standard represents the amalgamation of best practices within the business modeling community to define the notation and semantics of collaboration diagrams, process diagrams, and choreography diagrams.<\/span><span style=\"font-weight: 400;\"> Below is a BPMN core structure schema:<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-226 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/BPMN-core-structure.png\" alt=\"blockchain_business_process\" width=\"517\" height=\"438\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-core-structure.png 517w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-core-structure-350x297.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-core-structure-500x424.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-core-structure-130x110.png 130w\" sizes=\"(max-width: 517px) 100vw, 517px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">It includes such building blocks as: flow objects (events, activities, gateways), connecting objects (sequence flow, message flow, association), swimlanes (pools and lanes) and artifacts (data objects, text annotation, groups). BPMN is a core part of Business Process Management (BPM), an initiative of enterprise architecture.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-227\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/BPMN-2.0.png\" alt=\"BPMN 2.0\" width=\"898\" height=\"366\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-2.0.png 898w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-2.0-350x143.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-2.0-500x204.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-2.0-768x313.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-2.0-600x245.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-2.0-132x54.png 132w\" sizes=\"(max-width: 898px) 100vw, 898px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Business processes describe how a business pursues its objectives. In the <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"http:\/\/www.omg.org\/news\/meetings\/workshops\/HC-Australia\/Mancarella.pdf\"><span style=\"font-weight: 400;\">OMG BPMN Tutorial<\/span><\/a><\/span><span style=\"font-weight: 400;\">, BPMN is flexible enough to handle all variants of BP. This includes process maps (simple flowcharts of high-level activities), process descriptions (flowcharts with more information), and process models (flowcharts with enough information for analysis, simulation, and execution). <\/span><\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-228\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/BPMN.png\" alt=\"business_process_modelling\" width=\"832\" height=\"331\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN.png 832w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-350x139.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-500x199.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-768x306.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-600x239.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/BPMN-132x53.png 132w\" sizes=\"(max-width: 832px) 100vw, 832px\" \/><\/p>\n<h2>Permissioned Blockchain Implementation<\/h2>\n<p><span style=\"font-weight: 400;\">We believe that permissioned blockchains should be of great priority for businesses to run. The reason for this is the fact that businesses have a significant amount of confidential information which must be secured and inaccessible to outsiders of the network. The aforementioned blockchain feature of permissions for fraud prevention in supply chains controls access and identity management. We implement permissioned blockchain solutions to make records in the network private. There are restrictions for participation. New members must have an invitation, and then be validated to the permissioned network. This ensures intensified security. <\/span><\/p>\n<figure id=\"attachment_232\" aria-describedby=\"caption-attachment-232\" style=\"width: 1170px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-232 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management.jpg\" alt=\"blockchain_for_supply_chain_management\" width=\"1170\" height=\"776\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management.jpg 1170w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management-350x232.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management-500x332.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management-768x509.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management-1024x679.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management-600x398.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_management-132x88.jpg 132w\" sizes=\"(max-width: 1170px) 100vw, 1170px\" \/><figcaption id=\"caption-attachment-232\" class=\"wp-caption-text\">Source: Gavin Wood (2016)<\/figcaption><\/figure>\n<p><span style=\"font-weight: 400;\">All the transactions in the network are encrypted by the private key, but there is no way to view and alter previous transactions without execution of consensus protocol between the nodes. Each member of the network must solve a complex, resource-intensive cryptographic problem. Hereby, <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.typeform.com\/to\/qz0fMc\"><span style=\"font-weight: 400;\">Applicature<\/span><\/a><\/span><span style=\"font-weight: 400;\"> supports Proof-of-Authority (PoA) consensus algorithms, allowing private setups in the network. It has a number of pre-approved authority nodes that can approve and validate transactions and blocks. Therefore, a new node can be added through approval by the “validator,” who runs software allowing him or her to put transactions in blocks. The process is automated and does not require validators to be constantly monitoring their computers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, why use Proof-of-Authority? It is the most suitable engine for private blockchains, being more secured and incentivized. The concept behind PoA is that individuals earn the right to become validators, so there is an incentive to retain the position they have gained. By attaching the reputation to identity, validators are incentivized to uphold the transaction process, as they do not wish to have their identities attached to a negative reputation. This is considered more robust than PoS. <\/span><\/p>\n<h3>Blockchain Nodes<\/h3>\n<p><span style=\"font-weight: 400;\">So, let’s go deeper into blockchain nodes. They are anonymous individuals in the network. To add a transaction to the blockchain ledger by a <\/span><i><span style=\"font-weight: 400;\">node<\/span><\/i><span style=\"font-weight: 400;\">, consensus protocol must be adopted. The consensus determines whether the transaction should be validated in the ledger. This is called a <\/span><i><span style=\"font-weight: 400;\">block<\/span><\/i><span style=\"font-weight: 400;\">. Each node in the blockchain keeps a copy of the ledger, downloaded automatically upon joining the blockchain network. They propagate transactions and blogs everywhere. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are different types of actors in a supply chain who can be the nodes in the blockchain network, with the ability to make transactions and record information:<\/span><\/p>\n<ul>\n<li>producers<\/li>\n<li>retailers<\/li>\n<li>distributors<\/li>\n<li>suppliers<\/li>\n<li>end consumers<\/li>\n<\/ul>\n<figure id=\"attachment_229\" aria-describedby=\"caption-attachment-229\" style=\"width: 1070px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-229 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain.png\" alt=\"permissioned_blockchain_for_supply_chain\" width=\"1070\" height=\"451\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain.png 1070w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain-350x148.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain-500x211.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain-768x324.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain-1024x432.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain-600x253.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/permissioned-blockchain-for-supply-chain-132x56.png 132w\" sizes=\"(max-width: 1070px) 100vw, 1070px\" \/><figcaption id=\"caption-attachment-229\" class=\"wp-caption-text\">Source: Resolve<\/figcaption><\/figure>\n<h2>Blockchain Architecture and Client Application Specifications<\/h2>\n<p><span style=\"font-weight: 400;\">We understand that you need the solution that will provide provenance to your customers, as well as further optimize resources via the benefits of data availability and new approaches to business and technology. We would like to share with you our experience and knowledge on traceability implementation to your supply-chain business processes.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This first phase is to review your business processes together and decide which of them to include in a blockchain-based traceability project. Once the roadmap of the project has been generated, including goals, it’s time to get the definition of the architecture and the research of top candidates for blockchain deployment. Technical architecture includes the following steps: <\/span><\/p>\n<ul>\n<li>generating an overall architecture schema<\/li>\n<li>considerations for blockchain implementation<\/li>\n<li>research and list of blockchain platforms for deployment<\/li>\n<li>Visual Wireframes for the minimal version user-facing applications<\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The next phase covers the proof of technical assumptions and the validation of the risks standing between us and successful final proof of concept. Within a technical feasibility project, we deploy the selected blockchain candidates and run all necessary tests to confirm the match with our criteria. We intend to deliver the most appropriate configuration in its early stages of development, usable for the Proof of Concept. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Proof of Concept is a project to implement the most critical and essential functionality and provide projected business results. Proof of Concept will be a multicomponent solution containing: <\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">blockchain-based distributed server-side data storage\/data bus<\/span><\/li>\n<li><span style=\"font-weight: 400;\">centralized or decentralized business logic applications or smart contracts<\/span><\/li>\n<li>critical-version user mobile application<\/li>\n<li>critical-version user-facing dashboard web application<\/li>\n<\/ul>\n<h3>Registration of Supply Chains and User Mobile Apps<\/h3>\n<p><span style=\"font-weight: 400;\">Everyone in supply chain management has the account, with access via private key. Some of them can have a lot of information, while others have restricted data. The registration process is as follows: participants request to register their identities on the blockchain, and the registration authority verifies the identity; all results are recorded on the network, being visible to all the participants, or anonymously, depending on the situation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The essential part of blockchain implementation for supply chains concerns the linking of physical goods and products with their digital representation in the blockchain network, and a user-friendly interface, as well. On smartphone applications, there is the option to scan bar codes or serial numbers, which are linked to blockchain identifiers for simple, easy usage of the technology. There is no difference from UI, whether it is connected to API and database, or to a blockchain. Therefore, the actors in the blockchain do not undergo paradigm shifts. <\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-236 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_mobile_apps.jpg\" alt=\"blockchain_for_supply_chain_mobile_apps\" width=\"750\" height=\"457\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_mobile_apps.jpg 750w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_mobile_apps-350x213.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_mobile_apps-500x305.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_mobile_apps-600x366.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/blockchain_for_supply_chain_mobile_apps-132x80.jpg 132w\" sizes=\"(max-width: 750px) 100vw, 750px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Due to the strong integrity of the blockchain network, the customer can view the information on the product supply chain in real time. The mobile-readable cryptographic QR-code on the product’s labels is designed for customers to easily verify the origin of the material, ingredients, traceability, etc. <\/span><\/p>\n<h3>User-Facing Web Dashboards<\/h3>\n<p><span style=\"font-weight: 400;\">Using AI algorithms and big data enables businesses to leverage historic trip sheets and real-time data to estimate time of delivery, optimize vehicle routes, and sequence deliveries using information on local conditions like traffic and weather. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In order to provide valuable insight into the performance of drivers, facilities, and operations, data-driven dashboards are used. They enable organizations to examine key performance indicators like total travel time, helping to benchmark and improve service planning.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There is a flexible system supported by dashboards for managers and administrators who need to monitor, analyze, and manage the supply chain performance. Web dashboards support examination of the statistics of the goods, and these are comfortable for viewing from a user perspective. Since there is a time log, UI changes can be applied to depict the history of changes.<\/span><\/p>\n<h2>Event Sourcing and CQRS<\/h2>\n<p><span style=\"font-weight: 400;\">All blockchains are actually event-sourcing systems, the principles of which are congruent with blockchain. Event sourcing is the programming pattern that propagates a series of industry domain events to be saved in storage for future usage, and the application state is defined based upon the history of the events influencing it. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Event sourcing offers good innovation on top of an entity-focused approach by providing the ability to not only get the current state of the entity but also to review the history that led to the current state. It means that the state of the application is determined by the sequence of events. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Basically, any source control system operates using this approach. It has a history of all the changes that have ever been made to the source code system, with the option to rebuild the current state at any time. <\/span><\/p>\n<h3>Why Use Event Source for Your System?<\/h3>\n<p><span style=\"font-weight: 400;\">Why is the usage of this pattern useful and necessary for many systems? Let’s explain the reasons. The first great advantage is that event sourcing provides an <\/span><i><span style=\"font-weight: 400;\">audit trail<\/span><\/i><span style=\"font-weight: 400;\">, when every change in data is logged in a particularly strong, processable way that gives more confidence. The second powerful reason is its <\/span><i><span style=\"font-weight: 400;\">debugging<\/span><\/i><span style=\"font-weight: 400;\"> technique, enabling one to copy the productive system into a lab and making it possible to view errors and bugs by replaying the events. With the extra monitoring code, you can see the reasons for debugging. In the event log and application state context, we can view all the states through the history. Thus, the third reason is the ability to embed the <\/span><i><span style=\"font-weight: 400;\">historical state<\/span><\/i><span style=\"font-weight: 400;\"> into the application state itself, rolling back to the past states of the code with the event log.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The substantial factor that differentiates blockchain from event sourcing is the immutable feature. It is the basis of the whole concept: we can&#8217;t change what happened, but we can manage the system reaction and change of state based on the events. Therefore, blockchain, due to its core principle of immutability, is theoretically an ideal implementation of event sourcing for supply chains. We use this powerful approach in <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/yellow-paper-released-event-driven-approach-and-blockchain-in-logistics\"><span style=\"font-weight: 400;\">logistics<\/span><\/a><\/span><span style=\"font-weight: 400;\">, as well. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Event sourcing has a symbiotic relationship with CQRS, <\/span><i><span style=\"font-weight: 400;\">command query responsibility segregation<\/span><\/i><span style=\"font-weight: 400;\">. CQRS allows event sourcing to be used as the data-storage mechanism for the domain. The main idea of CQRS is that it separates the processing of updates from the provision of queries, providing two separate models: one for dealing with updates, and the other for reads.  Consequently, this means you can use a different model to update information than the model you use to read information. According to Martin Fawler, British software developer, for some situations, this separation can be valuable, but for most systems, CQRS adds risky complexity. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Martin Fawler displayed the difference between the traditional architecture and CQRS architecture in the following schemes:<\/span><\/p>\n<figure id=\"attachment_230\" aria-describedby=\"caption-attachment-230\" style=\"width: 637px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-230 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/traditional-architecture.png\" alt=\"blockchain_event_source\" width=\"637\" height=\"408\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traditional-architecture.png 637w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traditional-architecture-350x224.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traditional-architecture-500x320.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traditional-architecture-600x384.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/traditional-architecture-132x85.png 132w\" sizes=\"(max-width: 637px) 100vw, 637px\" \/><figcaption id=\"caption-attachment-230\" class=\"wp-caption-text\">Traditional architecture<\/figcaption><\/figure>\n<figure id=\"attachment_231\" aria-describedby=\"caption-attachment-231\" style=\"width: 637px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-231 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2017\/12\/CQRS-arcitecure.png\" alt=\"CQRS_blockchain\" width=\"637\" height=\"464\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/CQRS-arcitecure.png 637w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/CQRS-arcitecure-350x255.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/CQRS-arcitecure-500x364.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/CQRS-arcitecure-600x437.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/CQRS-arcitecure-132x96.png 132w\" sizes=\"(max-width: 637px) 100vw, 637px\" \/><figcaption id=\"caption-attachment-231\" class=\"wp-caption-text\">CQRS architecture<\/figcaption><\/figure>\n<p><span style=\"font-weight: 400;\">The crucial benefit of this approach is the presence of separate software components. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The combination of event sourcing and CQRS is also represented in the <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/cqrs.files.wordpress.com\/2010\/11\/cqrs_documents.pdf\"><span style=\"font-weight: 400;\">Greg Young documents<\/span><\/a><\/span><span style=\"font-weight: 400;\">, in which he depicts the intersection of these two concepts within a system where <\/span><i><span style=\"font-weight: 400;\">domain-driven design<\/span><\/i><span style=\"font-weight: 400;\"> has been applied. According to Greg, event sourcing is also very important when building out a non-trivial CQRS based system. The problem with integration between the two models is a large one. The maintenance of relational models, one for <\/span><i><span style=\"font-weight: 400;\">read<\/span><\/i><span style=\"font-weight: 400;\"> and the other for <\/span><i><span style=\"font-weight: 400;\">write<\/span><\/i><span style=\"font-weight: 400;\">, is quite costly. It becomes especially costly when you factor in that there is also an event model to synchronize the two. With event sourcing, the event model is also the persistence model on the <\/span><i><span style=\"font-weight: 400;\">write<\/span><\/i><span style=\"font-weight: 400;\"> side. This drastically lowers costs of development, as no conversion between models is needed. <\/span><\/p>\n<h2>Conclusions<\/h2>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Each participant of the blockchain network can view the progress of goods across the whole supply chain ecosystem. A decentralized, peer-to-peer model allows involvement of the participants in open transparent collaboration with each other, with no opportunity to cheat or deceive. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">No one can delete or change the transaction without consensus from other players on the chain.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Blockchain enables the detailed traceability of assets, their progress, the conditions under which they stay, how they were produced\/when and where, and the responsible party owning it, in real time. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Blockchain technology can help to keep precious data private and protect supply chains’ operations.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Smart contracts built on blockchain are written as code in the blockchain, ensuring trust between the parties. The individuals involved are anonymous, but the contract is a public ledger. They are less vulnerable to hacks and unauthorized modifications.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Secure, rapid operation in minutes saves costs and reduces fees.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">A decentralized platform makes all the operations quick, safe, and transparent without third-party involvement.<\/span><span style=\"font-weight: 400;\"> The blockchain solution will reduce transportation and payment delays. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Due to the immutable transaction history, the producer’s goods will have provenance. On a blockchain network, there is no centralization; every transaction is made across the network between all participants. Transactions are fixed and saved on a shared, decentralized ledger, where their visibility and transparency will not allow fraudsters to alter the information and delete data.<\/span><\/li>\n<\/ol>\n<p>&nbsp;    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Transparency and Traceability in the Supply Chain Selling certain things to a customer is based on the supply chain. Almost all companies engaged in the purchase and sale sphere cope with the fundamental phases of supply chain management. Trust and transparency in the supply chain are the two most sustainable factors for running an efficient [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":730,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[134],"tags":[154,264,273],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Blockchain for Supply Chain Management: the next technological revolution<\/title>\n<meta name=\"description\" content=\"What is the advantage of Blockchain for supply chain management? Blockchain technology can help to keep precious data private and protect supply chains’ operations. Decentralization forms the basis of blockchain technology, ensuring trust, transparency, and traceability of business processes.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Blockchain for Supply Chain Management: the next technological revolution\" \/>\n<meta property=\"og:description\" content=\"What is the advantage of Blockchain for supply chain management? Blockchain technology can help to keep precious data private and protect supply chains’ operations. Decentralization forms the basis of blockchain technology, ensuring trust, transparency, and traceability of business processes.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-12-29T18:54:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:58:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Supply-Chain-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"550\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2017\/12\/Blockchain-Supply-Chain-1.jpg\",\"width\":1100,\"height\":550,\"caption\":\"Blockchain Supply Chain\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/\",\"name\":\"Blockchain for Supply Chain Management: the next technological revolution\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/#primaryimage\"},\"datePublished\":\"2017-12-29T18:54:43+00:00\",\"dateModified\":\"2019-08-01T12:58:20+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/eadbd177b4774859460945c4718dd53d\"},\"description\":\"What is the advantage of Blockchain for supply chain management? Blockchain technology can help to keep precious data private and protect supply chains\\u2019 operations. Decentralization forms the basis of blockchain technology, ensuring trust, transparency, and traceability of business processes.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/\",\"url\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\/\",\"name\":\"Blockchain for Supply Chain Management: the Next Technological Revolution\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/eadbd177b4774859460945c4718dd53d\",\"name\":\"Tanya Bahrynovska\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2019\/09\/2S3A1076.jpg\",\"caption\":\"Tanya Bahrynovska\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/217"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=217"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/217\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/730"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}