{"id":2215,"date":"2018-08-22T09:51:00","date_gmt":"2018-08-22T09:51:00","guid":{"rendered":"https:\/\/applicature.com\/?p=2215"},"modified":"2022-01-20T15:35:11","modified_gmt":"2022-01-20T15:35:11","slug":"how-to-identify-scam-icos","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos","title":{"rendered":"How to Identify Scam IDOs"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Nowadays, crowdfunding is a very popular means of fundraising within the crypto community. One of its most common and profitable ways to crowdfund is an IDO launch, which is designed to engage capital to a project. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The number of crowdfunding projects is growing every day on the world market. Here is a comparison of the number of IDOs launched between June 2017 and June 2018:<\/span><\/p>\n<p><img loading=\"lazy\" class=\"wp-image-2222 size-full aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1.png\" alt=\"Monthly ICO number\" width=\"1200\" height=\"742\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1.png 1200w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1-350x216.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1-500x309.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1-768x475.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1-1024x633.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1-600x371.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Monthly-ICO-number-1-132x82.png 132w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">For dishonest IDOs, the competition is just too big and many of them are resorting to fraud and setting goals they are unlikely to actually achieve. We can call these <\/span><i><span style=\"font-weight: 400;\">scam IDOs. <\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">While IDOs, in general, are a multi-billion dollar field, they are unregulated, so scam IDOs are not something you’ll see just once. When we look at lists of recently-launched initial coin offerings, it becomes really hard to come up with reasonable filters to distinguish between a scam and a real IDO. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main problems, with the exception of projects whose team planned to just run an IDO and flee with the contributions, are:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">There is no real business and no need for the IDO as a funding mechanism; nor are there instructions for its further development.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Blockchain is not applied to a real business.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">This is why it is extremely important to learn how to distinguish all indicators of scam IDOs in order to avoid getting trapped by IDOs that do not guarantee data security, the validity of financial transactions, or protection against unpleasant accidents. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">One needs deep, expert knowledge in order to define whether or not an IDO is a scam. People are creative when it comes to scams. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here are 4 basic types of scam IDOs and their identifying features, which will actually help you distinguish them from the others and avoid wasting time, money, and resources. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Let’s observe the possible scenarios:<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">1. The Company Has No Value At All<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A company that cannot offer its customers something valuable in their field of interest, but instead encourages them to invest their money in an IDO that is likely to be unsuccessful, will not bring profit to investors. This will definitely be a trap for anyone who joins the campaign. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A lack of real components is a direct signal indicating that a project is a scam. IDOs should include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">a well-elaborated idea<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">a product that a crowd will follow<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">minimalist structure<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">blockchain application<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">token economics<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">a white paper<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">an experienced team <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">a technical roadmap<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">a plan of action <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Here’s a graphic presenting the biggest cryptocurrency hacks and scams in the world:<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2217 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/The-biggest-cryptocurrency-Hacks-and-Scams.png\" alt=\"The biggest cryptocurrency Hacks and Scams\" width=\"762\" height=\"595\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/The-biggest-cryptocurrency-Hacks-and-Scams.png 762w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/The-biggest-cryptocurrency-Hacks-and-Scams-350x273.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/The-biggest-cryptocurrency-Hacks-and-Scams-500x390.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/The-biggest-cryptocurrency-Hacks-and-Scams-600x469.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/The-biggest-cryptocurrency-Hacks-and-Scams-132x103.png 132w\" sizes=\"(max-width: 762px) 100vw, 762px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">You should also consider this <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/ico-success-or-fiasco-mistakes-that-matter\"><span style=\"font-weight: 400;\">list<\/span><\/a><\/span><span style=\"font-weight: 400;\"> of mistakes that result in a negative impact on IDO outcomes.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If a company doesn’t provide the above-mentioned components for successful IDO operation, it is not worth paying attention to at all.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">2. Blockchain Is Not Applied<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The first thing one should discover when considering a white paper is whether it predicts potential means of overcoming challenges that blockchain does guarantee. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">First, blockchain is a digital database that provides access to shared, replicated, synchronized data that is visible to all participants in a block in the form of a token.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A smart contract is a helpful means of ensuring the credibility of agreements. Consider their main benefits for investors:<\/span><\/p>\n<p>[table id=11 \/]<\/p>\n<p><span style=\"font-weight: 400;\">Blockchain use cases are increasing, leaving no doubt that they are worth applying to businesses in any field. Check out <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/use-case-blockchain-implementation\">blockchain use cases<\/a><\/span><\/span><span style=\"font-weight: 400;\"> for proof that it provides a great number of solutions for every industry to succeed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If there are still third parties (intermediaries) in the solution, this is no place for blockchain application. Blockchain offers a payment system without financial intermediaries to make transactions practically non-reversible. This decreases transaction costs and make micropayments possible.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The second type of scam IDOs includes companies that don’t involve blockchain technology in their work processes.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">3. Gaps in White-Paper Development<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">At this stage, IDO founders pay a lot of attention to IDO development by providing a detailed description of their project in a white paper. Collect information on the company’s supporters, and discover the solution it is going to bring to the global market. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Find out whether a company has a realistic, comprehensive plan of application — for example, a well-written white paper.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Community Support <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Attracting a constantly increasing pool of potential contributors from all over the world is possible if the company plans intelligently and has the right people on board. Here is the meaning of community support: the more supporters a company has, the more credible it appears in comparison with competitors, and the greater its chances of raising a lot of money. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is recommended that you find out whether or not a company receives funding from other supporters, and if so, how it can affect company obligations. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another thing worth paying attention to is who the owners of a company are, and what amount of stake they have. Nowadays, one of the most common reasons for company failure is a conflict of interest among stakeholders, and nobody knows which working scenario will be followed later if a company undergoes a change of position. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Technical and Financial Description<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Many IDOs facilitate their work processes with a white paper, which provides a full description of the existing technology or technology under development. A well-written white paper should contain the following key elements: <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">The Location and Contact Information of the Company<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">At least 32% of IDOs cannot be identified as an entity; therefore, investors can’t find out their origin, location, or the information about the founders. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This makes it difficult to understand the rules and legal protections afforded to them. Moreover, investors are provided with options in case of fraud, theft, or loss. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If a company doesn’t note a verifiable geographical location and presents itself for fundraising activity, it is obviously a scam.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Vision, Mission, and Target Goals<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">A successful company has to stand out from the crowd of millions of others, so it should have its own idea, a great vision, and a global mission that can unite different people all over the world around one goal. An IDO with significant potential and really professional developers never makes very big promises, but just describes the opportunities it offers. Moreover, no experienced developer would ever make a prediction about the token price. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Promises are not suitable when it comes to business, as no one knows exactly what is going to happen later.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Information About the Product<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">The product should be valuable, unique, and worth paying attention to — and of course, a good deal. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">The Existing Problem and the Solution Offered by the Company <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Investors should make sure the application is able to solve a particular problem that actually exists, and they should know how people will benefit from their investment. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is also important to monitor and analyze competitors’ markets to find out if there are any other companies trying to solve the same problem. They might have a better solution.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Token Description <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">There are a lot of different types of tokens, all with unique qualitative and economic features. Information on the intended use of the issued coins, their quantity, details on when and how reserved coins can be held, the possibility of liquidation, and all purchase terms must be mentioned in the white paper. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If a token doesn’t have multi-signature escrow policies, or the entity approves the transactions, the cash suddenly disappears. Such features are a direct sign of scam IDOs.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The white paper should provide all necessary information about the token standard. For example, if we are talking about a platform on top of Ethereum, we should define the type of token to be used for the IDO and for actual platform operational flow. As you can see, Ethereum now provides a pretty wide list of standards that can be used: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">ERC-20 is commonly used on the Ethereum platform. Users faced some problems with it, so other standards are improved versions of it.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">ERC-223, in contrast to ERC-20, provides the “tokenFallback” function, which may also be used as the “approve” function. This allows the receiving contract to decline the tokens or implement other actions.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">With ERC-621, users can benefit from two additional functions:“increaseSupply” and “decreaseSupply,” which can increase and decrease token supply accordingly. They can also change the amount of the token supply.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">ERC-721 offers a non-fungible token, which means that each token is absolutely unique and has different value for different users. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">ERC-827 provides token transfer and approval by the owner for later spending by a third party.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Each of these has its own set of features and legal rights, which can have different meanings for typical holders. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Additional required steps for listing a token on a regulated exchange or alternative trading system (ATS) should be included in the white paper, as well. <\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Team Professionalism<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">When talking about the team presenting the company to potential investors, beginners or unqualified members are not people who can earn credibility in the project. Therefore, the relevant experience of previous success cases is an indicator of the quality of management and professional approach to work. An ideal team should consist of professionals in every field: content, editing, marketing and PR, SMM, community, design, code, and targeting. Moreover, all data concerning engineering experience, skills, qualifications, and other relevant attributes should be highlighted. A high number of links to recent successful projects is one more sign that a company is not a scam. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">One more piece of advice is to study the profiles of company representatives on social networks. Contact them, and ask some curious questions. Also, find feedback on forums to get insights into people’s opinions about the company. Identify IDO team members and check them by monitoring their accounts. Define whether or not team members are committed to achieving success, or if this is just one more new project because IDOs are trendy today.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Industry Risk Factors <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">There are a lot of cases of successful IDOs that could collapse or be fully modified later, creating unstable conditions for token-holders because they may be surprised by another intended use. To fix this, it is necessary to check for an available alpha version of the product and find out whether a token-holder has the ability to take part in conferences, meetings, and events to be informed of all new updates. There should also be access to valuable partnerships, and a detailed roadmap with clear milestones.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Information like potential vulnerability to hacking, data loss, and disruption, and legal issues (for example, privacy concerns and data portability across borders) is worth mentioning. Be aware of all possible risks for the future.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is not a secret that financial issues are most important for investors. The underlying technological solution is paramount, so there should be a simple description of the technical problem and the solution. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A good sign is a code published on a public code repository like <\/span><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/github.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Github<\/span><\/a><\/span><span style=\"font-weight: 400;\">, allowing potential investors to check whether or not it is well-developed. Moreover, their repository might be impressive, lacking, or private. This is very important information, too. If a company doesn’t provide links to code, or if it is just a clone with a few changes, this is a true indicator of a scam IDO. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We need here Blockchain Architecture section<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Which blockchain solution is to be used, and why?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Analysis of different solutions<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Technical description of the platform<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Smart-contract applicability and description<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Use-case description<\/span><\/li>\n<\/ul>\n<h4><span style=\"font-weight: 400;\">Token Economics Applicability<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Because an IDO launch is based upon the release of tokens, blockchain application is a ‘must-do’ step, as tokens must be decentralized in order to ensure efficient processes. Such an approach facilitates the current financial system and makes shares and trading decentralized. With DD engagement in the platform environment, token circulation can be carried out in a more appropriate way. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Token economics plays a great role in investors’ lives, as the income and benefits a company promises depend upon the quality level of its development. Let’s define the factors investors should consider first:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How fees for transactions will be paid (will this be included in the token, or not)?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Does the token provide access to a product, give interaction rights to it, or grant the right of ownership to a value?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Does the token offer the opportunity to govern — for example, the right to vote or to have an impact on decision-making and\/or the development of a new product or service?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Is there the possibility to add value to the token in the network or relevant market, or to receive rewards for active work?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Does the user have access to additional value through sharing or disclosing certain data about tokens?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Is the company going to sell or buy any parts of the token?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Does the token serve as a security deposit, a principal payment unit, or the principal accounting unit to buy and sell things, or is it needed to join a network or any related entity?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Does a designated blockchain autonomously distribute profits and other benefits to token-holders?<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">If the token is claimed as a utility, does the project have any business strategies to prevent project cash-flow gaps due to the volatility of tokens and crypto?<\/span><\/li>\n<\/ol>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2219 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Token-Economics-Applicability.jpeg\" alt=\"Token Economics Applicability\" width=\"1024\" height=\"768\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Token-Economics-Applicability.jpeg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Token-Economics-Applicability-350x263.jpeg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Token-Economics-Applicability-500x375.jpeg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Token-Economics-Applicability-768x576.jpeg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Token-Economics-Applicability-600x450.jpeg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Token-Economics-Applicability-132x99.jpeg 132w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">However, if the white paper is full of the repeated buzzwords with no practical meaning, no matter how qualitative it is, then this is definitely a scam.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">4. Excellent Preparation Is Nothing Without Practical Meaning<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Having all the must-have points for a good IDO covered is great, but the following information, shows real value and should be mentioned, too:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">how the company will actually build a blockchain solution<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">how much money they need <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">timelines (roadmap and business plan with the description of MVP stage development) <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">A commonly-faced pitfall for all investors is that a company may have a well-written white paper, which, in practice, indicates no understanding of the practical plan of implementation. This is another reason for calling an IDO a scam. Marketing budgets, well-thought-out branding, great intro videos, and SEO wizards help involve potential investors and get their money. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Hyperbole is an endemic problem that buyers and sellers can face while reading a white paper. So be ready that not everything you will read is the truth.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In practice, more than 90 percent of IDOs fail, especially while there is a technological risk, and this is absolutely normal. Another interesting fact that all investors should remember is that 90–95% of IDOs won’t have any value in 3 years, regardless of whether it is a scam or not.<\/span><\/p>\n<p>[table id=12 \/]<\/p>\n<p><span style=\"font-weight: 400;\">Analyze in detail all available information about a company in order to draw the right conclusion for further cooperation. Pay attention to the details of the roadmap and the approach the company follows in order to understand what it is going to do to implement all of its outlined goals. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Remember that attractive, promising “to-do lists” are not a basis for an unconditional belief that the company can really do everything, especially under deadlines.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">To sum up, cryptocurrency is shaping the future of the world financial system, and scam IDOs are just a temporary emergency that the crypto community is trying to eradicate in order to protect itself from undesirable consequences. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whether you are just a beginner or an experienced investor, be wise and cautious. Thoroughly analyze each offering, because deep research is a vital element of the investment process that a lot of investors overlook when assessing IDOs. <\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nowadays, crowdfunding is a very popular means of fundraising within the crypto community. One of its most common and profitable ways to crowdfund is an IDO launch, which is designed to engage capital to a project. The number of crowdfunding projects is growing every day on the world market. Here is a comparison of the [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":173970,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[137],"tags":[154,156,176,194,215,255,268,280],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"An ICO scam is not a surprise today, as ICOs represent it is a great opportunity to raise money for a project development, so it is no surprise that scams are affecting the ICO realm. Here are some tips to which help one to identify a fake ICO.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"An ICO scam is not a surprise today, as ICOs represent it is a great opportunity to raise money for a project development, so it is no surprise that scams are affecting the ICO realm. Here are some tips to which help one to identify a fake ICO.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-08-22T09:51:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-20T15:35:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/34.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"575\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/34.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/#primaryimage\"},\"datePublished\":\"2018-08-22T09:51:00+00:00\",\"dateModified\":\"2022-01-20T15:35:11+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"An ICO scam is not a surprise today, as ICOs represent it is a great opportunity to raise money for a project development, so it is no surprise that scams are affecting the ICO realm. Here are some tips to which help one to identify a fake ICO.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-identify-scam-icos\/\",\"name\":\"How to Identify Scam IDOs\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2215"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2215"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2215\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173970"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2215"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2215"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2215"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}