{"id":2271,"date":"2018-09-04T13:26:36","date_gmt":"2018-09-04T13:26:36","guid":{"rendered":"https:\/\/applicature.com\/?p=2271"},"modified":"2019-08-05T12:54:02","modified_gmt":"2019-08-05T12:54:02","slug":"what-is-hashgraph-technology","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology","title":{"rendered":"What Is Hashgraph Technology?"},"content":{"rendered":"<p>Blockchain is becoming increasingly popular in today’s world. It is considered to be one of the greatest technological revolutions in history and has gained exciting popularity due to numerous successful and profitable use cases. This can be explained by the fact that people seem to be finding new ways to provide solutions to real-world problems.<\/p>\n<p>Blockchain technology allows using algorithms like proof of work (PoW), proof of stake (PoS), however, both of these face many challenges. Voting seems to be the best method, as all information is accessible to each participant in the block that provides total security to the network.<\/p>\n<p>Technology continues to develop constantly. The tech space never stops coming up with even more exciting developments as companies try to outdo each other in order to attract the attention of users.<\/p>\n<p>It’s time to welcome a new revolutionary technology, and its name is Hashgraph.<\/p>\n<h2>What Is Hashgraph Technology?<\/h2>\n<p>Hashgraph technology is a relatively new participant in the world of distributed ledger systems, but it appears to be a highly effective tool, as it includes an algorithm with a new platform for distributed consensus.<\/p>\n<p>Hashgraph was invented in 2016 by Leemon Baird, co-founder of Swirlds, a software platform for the development of distributed applications.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2272 size-full\" title=\"Hashgraph technology\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Swirlds-Hashgraph.png\" alt=\"Hashgraph technology\" width=\"952\" height=\"257\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Swirlds-Hashgraph.png 952w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Swirlds-Hashgraph-350x94.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Swirlds-Hashgraph-500x135.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Swirlds-Hashgraph-768x207.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Swirlds-Hashgraph-600x162.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Swirlds-Hashgraph-132x36.png 132w\" sizes=\"(max-width: 952px) 100vw, 952px\" \/>It uses two techniques to ensure fast, fair, secure consensus:<\/p>\n<h3>Gossip about Gossip<\/h3>\n<p>The famous concept “gossip about gossip” is a familiar mechanism in real life that is successfully being implemented in networking and business.<\/p>\n<p>Everyone is aware of its principle: Sarah tells Robin that she has bought a nice dress on sale in one shop and that there are a lot of clothes for a nice price. Later, Robin calls Eva to invite her on a shopping trip. Eva encourages Kate, Kate tells Molly, and so on. The next day, this shop will have at least 4 potential buyers.<\/p>\n<p>In Hashgraph, the function is the same. A piece of “gossip” contains a snippet of information that is provided to the hashes the last two participants talked to. Each node has the ability to randomly share transactions, events, or any other kind of signed information with others.<\/p>\n<p>Then, the node that has received the message converts it into a new one and sends it to other random nodes, which repeat the action until all of them get the information. In this way, all nodes receive and remain aware of the constantly updated information.<img loading=\"lazy\" class=\"size-full wp-image-2275 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Virtual-voting.png\" alt=\"\" width=\"497\" height=\"630\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting.png 497w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting-276x350.png 276w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting-394x500.png 394w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting-87x110.png 87w\" sizes=\"(max-width: 497px) 100vw, 497px\" \/><\/p>\n<h3><\/h3>\n<h3><img loading=\"lazy\" class=\"size-full wp-image-2274 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Leemon-Baird-quote.png\" alt=\"Hashgraph technology\" width=\"936\" height=\"264\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Leemon-Baird-quote.png 936w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Leemon-Baird-quote-350x99.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Leemon-Baird-quote-500x141.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Leemon-Baird-quote-768x217.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Leemon-Baird-quote-600x169.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Leemon-Baird-quote-132x37.png 132w\" sizes=\"(max-width: 936px) 100vw, 936px\" \/><\/h3>\n<h3>Virtual Voting<\/h3>\n<p>One can easily calculate all votes if they are divided into rounds. This is exactly what virtual voting ensures, as it is conducted in several rounds. It is quite easy to find out which node will vote because if new information is provided, all nodes immediately know who the initiator is. This can be used as input to the voting algorithm to find out which transaction has reached consensus.<\/p>\n<p>With virtual voting, it is possible to define which transactions are valid and which are not. If a transaction has two-thirds of the node in the network as witnesses, it is valid. They have to confirm that they are connected to these nodes.<\/p>\n<p>Also, we should remember that Hashgraph was created to be Byzantine Fault Tolerant, providing the opportunity for the system to work even if it turns Byzantine by a third of the nodes.<\/p>\n<h2><img loading=\"lazy\" class=\"size-full wp-image-2276 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Virtual-voting-1.png\" alt=\"Virtual voting\" width=\"254\" height=\"706\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting-1.png 254w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting-1-126x350.png 126w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting-1-180x500.png 180w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Virtual-voting-1-40x110.png 40w\" sizes=\"(max-width: 254px) 100vw, 254px\" \/>Asynchronous Byzantine Fault Tolerance (ABFT)<\/h2>\n<p>BFT can be either partially or totally asynchronous Byzantine (aBFT), and both of these are assumed at the beginning. Each of them is mathematically guaranteed; however, they differ in the level of personal assumptions about the environment. If we say that there are no botnets in the world, that means that we have a deal with partially Asynchronous BFT, because botnets do exist in the real world. On the other hand, if we try to prove mathematically the absence of botnets in the world, this means you’re living in a fantasy world.<\/p>\n<p>Hashgraph is a totally asynchronous Byzantine. aBFT assumes that evil actors really exist in every community. It guarantees to reach consensus and is secure as long as less than one-third of participants are malicious.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2277 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/quote-about-ABFT.png\" alt=\"Hashgraph technology\" width=\"942\" height=\"308\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/quote-about-ABFT.png 942w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/quote-about-ABFT-350x114.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/quote-about-ABFT-500x163.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/quote-about-ABFT-768x251.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/quote-about-ABFT-600x196.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/quote-about-ABFT-132x43.png 132w\" sizes=\"(max-width: 942px) 100vw, 942px\" \/>Security in Hashgraph comes from <i>Asynchronous Byzantine Fault Tolerance (ABFT)<\/i><span style=\"font-weight: 400;\">. W<\/span><span style=\"font-weight: 400;\">ith this protocol, CEO Mance Harmon <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.forbes.com\/sites\/jeffkauflin\/2018\/03\/13\/hedera-hashgraph-thinks-it-can-one-up-bitcoin-and-ethereum-with-faster-transactions\/#63852cc7abcb\" target=\"_blank\" rel=\"noopener noreferrer\">claims to have achieved <\/a><\/span>the gold standard of security.<\/span> <span style=\"font-weight: 400;\">Let’s find out how this consensus method works in Hashgraph.<\/span><\/p>\n<p>Imagine that there are four separate divisions of the Byzantine army, and each of them has its own commander. They have to create a plan of action, but communication between them is possible only by messenger.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2278 size-full\" title=\"Asynchronous Byzantine Fault Tolerance (ABFT)\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/ABFT-model.png\" alt=\"Asynchronous Byzantine Fault Tolerance (ABFT)\" width=\"902\" height=\"675\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/ABFT-model.png 902w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/ABFT-model-350x262.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/ABFT-model-500x374.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/ABFT-model-768x575.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/ABFT-model-600x449.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/ABFT-model-132x99.png 132w\" sizes=\"(max-width: 902px) 100vw, 902px\" \/>The following scenarios might happen:<\/p>\n<ol>\n<li style=\"font-weight: 400;\">Somebody might bribe a messenger.<\/li>\n<li style=\"font-weight: 400;\">A general might bribe a messenger to act according to his plan.<\/li>\n<li style=\"font-weight: 400;\">A messenger might be killed.<\/li>\n<\/ol>\n<p>The generals have to develop a reasonable algorithm to decide which tactic to choose, and when to attack the city. They have to act together: simultaneously, in a coordinated manner, with consensus, and in the absence of misunderstanding to avoid defeat.<\/p>\n<p>They won’t succeed if two generals tell their army to attack, and the other two two command retreat.<\/p>\n<p>Consensus is an important solution to distributed ledger technology. Blockchain uses a consensus protocol called proof of work. However, this type takes a lot of time to accomplish. A transaction is carried out several times more slowly, and transaction fees are a reason for concern among many investors.<\/p>\n<p>In a contrast, Hashgraph provides Byzantine Fault Tolerance(ABFT), which offers a consensus algorithm at the highest level of security. With ABFT, consensus can be reached with a probability of 1 if less than ⅓ of the nodes are controlled by attackers, and it can be predicted that messages from an honest node will be transferred, but it is not known how fast the messages would be sent.<\/p>\n<p>An attacker has to govern less than ⅓ of the stake in a proof-of-stake consensus protocol, or less than ⅓ of the nodes if this concept is not used. The hacker can delete messages and control their sending. In any case, there is a limitation if an honest node tries to send messages to another honest node so that one can get through.<\/p>\n<p>ABFT is able to withstand hacker attacks, DDoS attacks, botnets, and firewalls of the communication network and network nodes if any.<\/p>\n<h2>Advantages and Disadvantages of Hashgraph Technology<\/h2>\n<p>Hashgraph technology has been gathering a lot of admirers all over the world who think that it can overcome all existing problems of the blockchain nature. On the other hand, many passionate blockchain supporters contend that comparing the blockchain with Hashgraph is like comparing tomatoes and cucumbers, as each has its own unique taste.<\/p>\n<p>Let’s compare them to discover their differences.<\/p>\n<p>Hashgraph provides the first-generation tech with severe constraints in terms of speed, fairness, cost, and security. The key indicator of this technology is performance, which shows the quantity and the number of developed applications and whether they can run on a database that can conduct 5 transactions per second.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2279 size-full\" title=\"Hashgraph and Blockchain\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Hashgraph-and-Blockchain.png\" alt=\"Hashgraph and Blockchain\" width=\"1600\" height=\"900\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-and-Blockchain.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-and-Blockchain-350x197.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-and-Blockchain-500x281.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-and-Blockchain-768x432.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-and-Blockchain-600x338.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-and-Blockchain-132x74.png 132w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/>Here are the 3 key features of Hashgraph technology that can solve the scalability issue faced by  blockchain-based projects today:<\/p>\n<p>[table id=13 \/]<\/p>\n<p>Let’s give a wider explanation of each:<\/p>\n<h3>Speed<\/h3>\n<p>Sending messages to all nodes is optimized by the gossip protocol, which reduces communication overhead. It is fast, as it works in a permission setting. Hashgraph can function in private networks that require permission, and this has a great impact on the throughput of the consensus solution.<\/p>\n<p>We can divide consensus technologies into three categories, which you can learn about in this <a href=\"https:\/\/medium.com\/applicature\/utilization-of-distributed-technologies-for-custom-solutions-public-private-and-hybrid-570a1e14852\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">article<\/span>.<\/a><\/p>\n<p>1. Public networks (for example, Bitcoin and Ethereum)<\/p>\n<p>In a public network, every node can be a participant in the network, or stop its participation whenever they want. A public platform offers the ability to read and make records to every participant. Users can work on the platform, access the records, and gain permission to make changes to the records.<\/p>\n<p>However, such networks are expensive and have some limitations deriving from the proof-of-work system. This decreases the number of applications where such technologies can be implemented.<\/p>\n<p>Also, such consensuses can help to determine fraud cases; for example, Sybil attacks, in which a user can generate several entities that affect the consensus process and overall throughput.<\/p>\n<p>2.Private (leader-based consensus algorithms)<\/p>\n<p>Private networks have some restrictions to their use, so all participants are known beforehand. Only the owner has the exclusive right to make changes to the records. Permission to read may be opened or limited; it’s up to the organization.<\/p>\n<p>This provides a high level of protection against Sybil attacks, and consensus can be reached quickly. As a result, the throughput is much higher than in public blockchains.<\/p>\n<p>This also explains the lower cost in contrast to public networks. Performance is much better, making it possible to conduct more than 1,000 transactions per second.<\/p>\n<p>This type of network is suitable for financial institutions and large companies because they are able to build large systems and reduce costs while improving efficiency.<\/p>\n<p>Hashgraph is a private distributed ledger, so its throughput is more advantageous than blockchain, which is an open distributed ledger providing 10 transactions per second. Hashgraph is 50,000 times faster, offering 250,000+ transactions per second.<\/p>\n<ul>\n<li>Hybrid networks  (the so-called blockchain consortium)<\/li>\n<\/ul>\n<p>A hybrid network combines the key features and opportunities presented in both public and private networks. For example, a particular community or a group of determined people or nodes has the right to read and change records. In this way, permission to the database is restricted. This means that each participant works on his\/her decision, and supports intellectual property rights within the community.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2280 size-full\" title=\"Public, hybrid and private networks\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks.png\" alt=\"Public, hybrid and private networks\" width=\"926\" height=\"323\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks.png 926w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks-132x46.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks-350x122.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks-500x174.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks-768x268.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks-600x209.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks-120x42.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Public-hybrid-and-private-networks-300x105.png 300w\" sizes=\"(max-width: 926px) 100vw, 926px\" \/><\/p>\n<ol>\n<li style=\"font-weight: 400;\">\n<h3>Reliability<\/h3>\n<\/li>\n<\/ol>\n<p>Hashgraph uses consensus timestamping, which defines a transaction as a first if it reaches ⅔ of the network. On one hand, it is very fair, as it excludes the possibility of cheating on major nodes. On the other hand, nodes can be Byzantine or malicious in the gossip protocol if choosing neighbors randomly. Successors can prevent nodes from receiving a message.<\/p>\n<p>By the way, if two-thirds of the network does not reach the transaction, this can cause an inappropriate result for the node-initiator. This is one of the main challenges users of Hashgraph might face because this scenario will be difficult to implement during the release of a public distributed ledger.<\/p>\n<ol>\n<li style=\"font-weight: 400;\">\n<h3>Security<\/h3>\n<\/li>\n<\/ol>\n<p>Hashgraph is based on ABFT consensus, which means that it is a non-deterministic asynchronous protocol with the ability to choose the neighbor node randomly. The consensus protocol will stop its operation, but it is impossible to know when this will occur. All information received by nodes is continually reconciled\/updated so they all have the same value, even after numerous rounds of gossip about gossip protocol, and become unanimous.<br \/>\n<img loading=\"lazy\" class=\"aligncenter wp-image-2281 size-full\" title=\"Hashgraph Sybil Attack\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack.png\" alt=\"Hashgraph Sybil Attack\" width=\"1200\" height=\"742\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack.png 1200w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-132x82.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-350x216.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-500x309.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-768x475.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-1024x633.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-600x371.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-120x74.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/Hashgraph-Sybil-Attack-300x186.png 300w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>However, a serious problem arises if Byzantine nodes begin to manipulate and govern all events that the network is spreading.<\/p>\n<p>Let’s review the challenges faced by Hashgraph technology:<\/p>\n<ol>\n<li style=\"font-weight: 400;\">Hashgraph is a private ledger, so the founders decide who can use this platform by themselves. This is extremely useful for MESH networks.<\/li>\n<li style=\"font-weight: 400;\">The community is still skeptical about Hashgraph’s patent. Moreover, a few experts believe that it neglects the very idea of a decentralized system. They predict that in the future, it will become centralized, as it uses the gossip protocol and is open-source.<\/li>\n<li style=\"font-weight: 400;\">In Hashgraph, no one has an impact on transaction order. In contrast, blockchain miners can change the order of transactions according to the value of transaction fees.<\/li>\n<li style=\"font-weight: 400;\">As private enterprise businesses are the main source of Hashgraph funding, they can use it for centralized applications.<\/li>\n<li style=\"font-weight: 400;\">Hashgraph design does not require nodes with computational power sufficient to establish a virtual machine, excluding the possibility of introducing Turing-complete smart contracts and the logic of balances without compromising security and scalability.<\/li>\n<\/ol>\n<p>A more extended list of the problems Hashgraph is facing is provided in this <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/hashgraph-problems\" target=\"_blank\" rel=\"noopener noreferrer\">article<\/a><\/span>.<\/p>\n<p>For a profound understanding of Hashgraph technology, read the article on <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/hedera-hashgraph\"><span style=\"font-weight: 400;\">Hashgraph ICO review<\/span><\/a><\/span><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><a href=\"https:\/\/www.hederahashgraph.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">The Hedera Hashgraph Platform<\/span><\/a> is another creation besides Swirlds, Baird, and Harmon, which were designed to develop a distributed public ledger using the Hashgraph algorithm to provide reliable and transparent sets of codes on a higher level. The Hedera platform combines three services (i.g., cryptocurrency), allowing for microtransactions, micro-storage on the distributed ledger, and smart contracts offering a new kind of consensus algorithm that supports them. It is capable of running all kinds of DApps.<\/p>\n<p>The platform also provides robust API support, making the creation of applications an accessible option for developers.<\/p>\n<h2>Summary<\/h2>\n<p>Undoubtedly, Hashgraph is a fast, reliable, secure technology that solves the scalability issue and works within the permission-setting system. In the process of changing settings into public, however, it will face a lot of the same challenges any public distributed ledgers do. Moreover, it is still questionable if it would still be able to operate in the same way if things go differently.<\/p>\n<p>Each network, public or private, has its own advantages and disadvantages, but remember that there is no silver bullet for solving all painful problems.<\/p>\n<p>Let’s discover the new innovations the current world is presenting to us. Hashgraph is definitely worth paying attention to.<\/p>\n<p>In any case, we should remember that Hashgraph is still developing, and no one knows how it will work and what problems it will have in the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Blockchain is becoming increasingly popular in today’s world. It is considered to be one of the greatest technological revolutions in history and has gained exciting popularity due to numerous successful and profitable use cases. This can be explained by the fact that people seem to be finding new ways to provide solutions to real-world problems. [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":2283,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,176,215,268],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"Hashgraph technology is a data structure and consensus algorithm that provides many advantages that help it stand out from other technologies. So how does Hashgraph work?\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What Is Hashgraph Technology?\" \/>\n<meta property=\"og:description\" content=\"Hashgraph technology is a data structure and consensus algorithm that provides many advantages that help it stand out from other technologies. So how does Hashgraph work?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-09-04T13:26:36+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-05T12:54:02+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/What-Is-the-Hashgraph-Technology-01.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"575\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"What Is Hashgraph Technology?\" \/>\n<meta name=\"twitter:description\" content=\"Hashgraph technology is a data structure and consensus algorithm that provides many advantages that help it stand out from other technologies. So how does Hashgraph work?\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/What-Is-the-Hashgraph-Technology-01.png\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/08\/What-Is-the-Hashgraph-Technology-01.png\",\"width\":1100,\"height\":575,\"caption\":\"Hashgraph Technology\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/#primaryimage\"},\"datePublished\":\"2018-09-04T13:26:36+00:00\",\"dateModified\":\"2019-08-05T12:54:02+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"Hashgraph technology is a data structure and consensus algorithm that provides many advantages that help it stand out from other technologies. So how does Hashgraph work?\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/what-is-hashgraph-technology\/\",\"name\":\"What Is Hashgraph Technology?\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2271"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2271"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2271\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/2283"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}