{"id":2332,"date":"2018-09-07T12:27:13","date_gmt":"2018-09-07T12:27:13","guid":{"rendered":"https:\/\/applicature.com\/?p=2332"},"modified":"2022-01-11T20:10:55","modified_gmt":"2022-01-11T20:10:55","slug":"how-does-eos-crypto-work","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work","title":{"rendered":"How Does EOS Crypto Work?"},"content":{"rendered":"<p>According to <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/coinmarketcap.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">CoinMarketCap<\/a><\/span>, <em><strong>EOS cryptocurrency<\/strong><\/em> is the fifth most popular currency after Bitcoin, Ethereum, XRP, and Bitcoin Cash on the crypto exchanges. On June 1, Cointelegraph <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/cointelegraph.com\/news\/eos-about-to-secure-a-record-4-bln-in-year-long-ico\" target=\"_blank\" rel=\"noopener noreferrer\">reported<\/a><\/span> that EOS had accomplished its year-long token sale, raising a record-breaking $4 billion.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2368 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/Market-cap-of-crypto.png\" alt=\"Market cap of cryptocurrencies\" width=\"600\" height=\"371\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Market-cap-of-crypto.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Market-cap-of-crypto-132x82.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Market-cap-of-crypto-350x216.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Market-cap-of-crypto-500x309.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Market-cap-of-crypto-120x74.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Market-cap-of-crypto-300x186.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/>Its position on the exchange platforms brings about the need for profound research of the currency and its technical features, means of buying and selling, and storage capability in order fully benefit from it.<\/p>\n<p>First of all, let’s discover its creator —the EOS — platform, to understand its goals and offerings.<\/p>\n<h2>What Is EOS Technology?<\/h2>\n<p>Ethernet over Sonnet (EOS) is a blockchain-based platform that was created to help developers come up with decentralized applications, commonly referred to as DApps.<\/p>\n<p>With an operating-system-like set of services and functions, EOS provides easy, comfortable conditions. It brings together the best features of modern technologies, and promises scalable, flexible features to provide a complete operating system for decentralized applications.<\/p>\n<p>The number of DApps is getting larger every day, which causes some limitation in the availability of resources on the network. Here we can mention:<\/p>\n<ul>\n<li>the high number of false transactions and similar requests<\/li>\n<li>applications containing spam<\/li>\n<li>slow speed of implementation<\/li>\n<li>limited computing power within the network<\/li>\n<\/ul>\n<p>In a contrast with other platforms, EOS offers a scalable and flexible manner of execution to solve these problems. Ethereum, for example, operates under the Rental Model, in which gas fees are required in exchange for every calculation, storage operation, and bandwidth utilization. Transactions fees are undetermined and may change, as they fluctuate. Their owners can select the transactions with the largest fees.<\/p>\n<p>EOS technology’s great advantage is the absence of fees. It provides low latency, which allows for scaling of transactions to thousands per second.<\/p>\n<p>EOS is the brainchild of a company called Block.one, led by Dan Larimer (co-founder of Bitshares and Steemit) and Brendan Bloomer, both of whom have deep experience in running crypto projects.<\/p>\n<ul>\n<li>Authentication<\/li>\n<\/ul>\n<p>The EOS system enables full-featured authentication that allows the sharing of database access between accounts and storage of data on a local machine off of the blockchain.<\/p>\n<p>In addition, there are various options for recovering a stolen account, which help to prove one’s identity and restore all data.<\/p>\n<ul>\n<li>Keeping All Information in the Cloud<\/li>\n<\/ul>\n<p>Server hosting and cloud storage are other advantages of the EOS network that application developers can benefit from. This will help them deploy the application regardless of the demands of securing storage and bandwidth.<\/p>\n<p>Direct access to analytics for storage and bandwidth from EOS shows the limitations for each application. Users can pay for these services by staking EOS tokens.<\/p>\n<p>As developers determine transactions fees individually, companies have the option to set their own prices for services according to their monetization strategies.<\/p>\n<ul>\n<li>Block Formation<\/li>\n<\/ul>\n<p>Developers create blocks every three seconds. The network restricts their number, and only allows production of blocks in batches of 21.<\/p>\n<h2><img loading=\"lazy\" class=\"size-full wp-image-2334 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/EOS-crypto-review.jpg\" alt=\"EOS technology\" width=\"1280\" height=\"720\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-crypto-review.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-crypto-review-350x197.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-crypto-review-500x281.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-crypto-review-768x432.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-crypto-review-600x338.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-crypto-review-132x74.jpg 132w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" \/>EOS Economy<\/h2>\n<p>The EOS economy is not based on a mining system. Developers of blocks must create a specified number of blocks. They are rewarded for each new token created. The number of produced tokens depends upon the median value of the expected pay that all block creators have decided. However, according to the EOS white paper, the total annual hike in token supply won’t be higher than 5% in order to avoid intentional increase in price. Token holders can also regulate the company price on the market by voting out block developers who are setting up higher prices.<\/p>\n<p>Additionally, token holders should remember that the EOS tokens they keep in storage will lose their value at the rate of inflation, as they pay for the storage of files according to a portion of annual inflation.<\/p>\n<p>Consequently, the more storage is required, the more tokens should be created, and the higher the price — as high as the developers can demand. On the other hand, if there is a lower demand for the storage, inflation will be lower, as well, and EOS tokens will lose less value.<\/p>\n<h2>The EOS Token<\/h2>\n<p>The EOS network, as with any decentralized operating system, provides the opportunity to develop applications within an ecosystem governed by the EOS coin. The EOS token was released on the Ethereum platform and switched to EOS coins after the ICO.<\/p>\n<p>A developer who is willing to build an EOS blockchain-based application needs to possess some EOS coins in order to have the ability to meet the demands of the network and have access to the EOS blockchain. The tokens can be easily used and exchanged for other cryptocurrencies.<\/p>\n<p>First, you have to buy server time using EOS tokens, then publish the capacity of elements like disk space,CPU, time, and RAM to get access to the tools and resources needed to develop an application on the EOS blockchain. To run a particular application, EOS token holders must vote for it on the platform with Proof of Work (POW) or Proof of Stake (POS) algorithms.<\/p>\n<h2>Where to Buy the EOS Coin<\/h2>\n<p>Participants in the token sale have the opportunity to buy EOS tokens in two ways:<\/p>\n<ol>\n<li>Using Fiat Currency<\/li>\n<\/ol>\n<p>It is recommended that you use this method and buy EOS tokens with USD or any other fiat currency if you are a beginner and do not have any significant trade experience.<\/p>\n<p>Helpful tips for buying EOS tokens:<\/p>\n<p><em><strong>Step 1<\/strong><\/em>: Create an account on an exchange that supports fiat-to-crypto exchanges.<\/p>\n<p>EOS tokens are included in the lists of a huge range of exchanges, but not all of them accept fiat currency. That’s why learning all the details of participation and the possibilities with which exchanges provide their users is recommended before selecting the most suitable one.<\/p>\n<p>Consider exchanges like Gemini, GDAX, and Coinbase, as they are common options in this case.<\/p>\n<p>Then, provide this information:<\/p>\n<ul>\n<li>your name<\/li>\n<li>your email address<\/li>\n<li>your phone number<\/li>\n<li>proof of ID<\/li>\n<li>proof of residency<\/li>\n<li>a personal photo in which you are holding a signed statement<\/li>\n<\/ul>\n<p>Remember to enable two-factor authentication on the account.<\/p>\n<p><em><strong>Step 2<\/strong><\/em>: Deposit funds into a personal account.<\/p>\n<p>Once you have successfully confirmed personal identity and given your information, log into the account and click the “Deposit USD” link on the account interface. Then choose to deposit via debit or credit card.<\/p>\n<p><em><strong>Step 3<\/strong><\/em>: Buy EOS<\/p>\n<p>When the funds have been transferred to your account, click on the “Buy\/Sell” link and select “EOS” from the list of provided currencies.<\/p>\n<p>Then click “Buy EOS” and indicate the amount of EOS you want to buy or the amount of USD you want to spend.<\/p>\n<p>Check the details of the transaction carefully before submitting it to be fully sure of the correctness of all information.<\/p>\n<p>2. Using Another Cryptocurrency<\/p>\n<p><em><strong>Step 1<\/strong><\/em>: Choose an EOS wallet.<\/p>\n<p>First, you’ll have to choose a functional digital wallet to store your tokens. The EOS network does not provide official EOS wallets, so customers have to look for third-party wallets.<\/p>\n<p>EOS is built on <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/erc20-compatible-wallets\">the ERC20 token standard<\/a><\/span>, so the wallet should be ERC20-compliant. This standard is the most commonly used to create tokens, so most major wallets are suitable.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2335 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/Token-wallets.jpg\" alt=\"Token wallets\" width=\"535\" height=\"398\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-wallets.jpg 535w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-wallets-350x260.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-wallets-500x372.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-wallets-132x98.jpg 132w\" sizes=\"(max-width: 535px) 100vw, 535px\" \/>Today, there are many wallets one can use and benefit from. Let’s discover the main types to determine which one would be the best for any purpose:<\/p>\n<h3>Desktop Wallets<\/h3>\n<p>Most people prefer to use wallets like Jaxx and Exodus for EOS storage, because they can be used on Windows, Mac, and Linux. Users of Android, iOS-powered devices, and Chrome browser extensions can use Jaxx wallets. In addition, Jaxx is perfect for beginners, as it is comfortable and easy to use. Its users are provided with the ability to recover their wallet with a 12-word master seed.<\/p>\n<p>Also, these desktop wallets are endowed with ShapeShift functionality, making it possible to trade ERC20 tokens, if any.<\/p>\n<p>Another desktop wallet worth mentioning is Exodus. Its great advantage is its availability to everyone, including a live chat feature that allows easy checking storage value.<\/p>\n<h3>Web Wallets<\/h3>\n<p>Web wallets are considered the best, because users can store their tokens on a computer, in a contrast to those that only allow doing so online.<\/p>\n<p>For example, MyEtherWallet, an open-source wallet, is one of the most popular and reliable. This can be explained by the fact that users can store their private keys on their computers, allowing them to safely keep their information and data.<\/p>\n<h3>Mobile Wallets<\/h3>\n<p>Today, people can get immediate access to their EOS holdings through their mobile phones. Users just have to use a wallet that their operating system supports. The best choice is the Jaxx wallet, as it is compatible with both iOS and Android devices.<\/p>\n<h3>Hardware Wallets<\/h3>\n<p>Hardware wallets provide special cold storage which ensures the entire security of tokens. One option, Trezor, provides multiple layers of security, which means it can operate on zero-trust approach. It protects people from fraud cases with a four-digit pin code. Also, if you forget your pin code, you can restore your access to the wallet with a special 24-word seed. An encrypted passphrase and wipe password create additional layers of this wallet’s security.<\/p>\n<p>The Trezor wallet’s big disadvantage is that it is one of the most expensive EOS wallets. Anyone who wants to benefit from all its offerings has to pay $104 for usage.<\/p>\n<h4>What Holders Should Pay Attention to While Choosing the EOS Wallet<\/h4>\n<h5>Security<\/h5>\n<p>We live in a world full of fraud and hacker traps trying to cheat and steal holder’s tokens. This makes safety the most important aspect when choosing an EOS wallet.<\/p>\n<p>First of all, learn the security features that a wallet offers in order to be completely sure that your own tokens are kept safely. Any wallet that provides two-factor authentication and advanced encryption should automatically be considered.<\/p>\n<h5>Private Keys<\/h5>\n<p>Really reliable wallets come with the support of private keys, through which the process of sending and receiving of tokens is conducted.<\/p>\n<h5>Continued Development<\/h5>\n<p>The cryptocurrency landscape is changing by the day, but hackers are also mastering their skills every single day in order to run their cons and steal the most profitable wallets. To avoid this, wallet developers must constantly evolve new opportunities to help users to protect their wallets.<\/p>\n<h5>Reviews<\/h5>\n<p>The best way is to conduct your own research and find out the real value of a particular wallet. Listen to what people are saying about a wallet — its security, general vulnerabilities, customer service, and development team — before starting usage. Pay attention to all the details, and learn about previously-known cases, as they might happen to you, as well.<\/p>\n<p><em><strong>Step 2<\/strong><\/em>: Log into a cryptocurrency exchange cabinet.<\/p>\n<p>After setting up a digital wallet, consider a list of cryptocurrency exchanges for buying and selling different digital currencies.<br \/>\nAs EOS is the fifth biggest cryptocurrency after Bitcoin, Ethereum, Ripple, and Bitcoin Cash on the market, its tokens are available on major exchanges.<\/p>\n<p>Here are the most popular:<\/p>\n<ul>\n<li>Binance is one of the biggest and most widely-known crypto exchanges, and it lists a number of cryptocurrencies. However, fiat money is not accepted here.<\/li>\n<li>Kraken is considered one of the best exchanges to store EOS tokens, as it ensures greater flexibility for its users by offering different payment methods, including fiat currencies like USD, EUR, and GBP. It is also worth mentioning that Kraken charges low transaction fees.<\/li>\n<li>ShapeShift does not require signing up for an account or the submission of any personal data. In this way, users have the ability to store EOS tokens anonymously, but this comes with high transaction fees.<\/li>\n<li>Bitfinex facilitates the purchase of EOS using U.S. dollars, which is one of the rarest traded pairs on the exchange. On the other hand, it is now considered a controversial trade platform because of a huge hack that caused over $70 million in user loss in 2016.<\/li>\n<\/ul>\n<p><em><strong><img loading=\"lazy\" class=\"size-full wp-image-2336 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market.png\" alt=\"EOS crypto volume\" width=\"1200\" height=\"742\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market.png 1200w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-132x82.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-350x216.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-500x309.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-768x475.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-1024x633.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-600x371.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-120x74.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-market-300x186.png 300w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>Step 3<\/strong><\/em>: Withdraw EOS Tokens to a Wallet<\/p>\n<p>After buying a certain number of EOS tokens on crypto exchanges, it is recommended to avoid holding on an exchange because they might be attacked by hackers. Transferring to a crypto wallet ensures security and protection from personal fraud cases.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2337 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency.png\" alt=\"EOS token\" width=\"1200\" height=\"742\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency.png 1200w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-132x82.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-350x216.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-500x309.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-768x475.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-1024x633.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-600x371.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-120x74.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-volume-by-currency-300x186.png 300w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>If you are interested in buying EOS, pay attention to the following factors:<\/p>\n<ol>\n<li><em><strong>Supply<\/strong><\/em>. Data from <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/coinmarketcap.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">CoinMarketCap<\/a><\/span> (July 2018) said that the circulating supply of EOS was 896,149,492. The maximum supply of coins was 1 billion EOS, and 10% of them had been received by Block.one.<\/li>\n<li><em><strong>Competition<\/strong><\/em>. EOS has a lot of serious opponents, like NEO, Cardano, Qtum, and other blockchain-based coins trying to get a market share. Don’t forget to discover possibilities provided by other projects.<\/li>\n<li>Whit<em><strong><em>e<\/em> paper<\/strong><\/em>. Read <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/github.com\/EOSIO\/Documentation\/blob\/master\/TechnicalWhitePaper.md\" target=\"_blank\" rel=\"noopener noreferrer\">the EOS technical white paper<\/a><\/span> to become aware of all the possible scenarios buyers and sellers may experience.<\/li>\n<\/ol>\n<h2>Token Sale<\/h2>\n<p>According to data provided by <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"http:\/\/eoscollective.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">EOS Collective<\/a><\/span>, the EOS token sale was one-of-a-kind and lasted a full one year, starting from June 26, 2017, and had 350 periods of distribution. With this type of distribution, people had enough time to learn the features of the token sale and made their own predictions about its possible results. This allowed them to learn the token sale process deeply and, as a result, make a profitable deal.<\/p>\n<p>At the end of each period, all contributors were given their stake of the total amount of distributed tokens. The token sale was known for high funds and token growth, and continues to bring great income to participants. Here we can see the growth of token value from the beginning of 2018:<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2338 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018.png\" alt=\"the growth of the EOS token value\" width=\"791\" height=\"419\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018.png 791w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018-132x70.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018-350x185.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018-500x265.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018-768x407.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018-600x318.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018-120x64.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/The-growth-of-token-value-from-the-beginning-of-2018-300x159.png 300w\" sizes=\"(max-width: 791px) 100vw, 791px\" \/>EOS token distribution was aimed at spreading tokens far and wide within the whole ecosystem at favorable market prices. As we can see in the chart provided below, all participants had to adhere to the same conditions in order to be involved in the distribution process, and were offered equal chances of selling and buying during the ICO period:<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2339 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/Token-distribution.png\" alt=\"EOS crypto review\" width=\"746\" height=\"333\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-distribution.png 746w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-distribution-132x59.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-distribution-350x156.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-distribution-500x223.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-distribution-600x268.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-distribution-120x54.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Token-distribution-300x134.png 300w\" sizes=\"(max-width: 746px) 100vw, 746px\" \/>200 million tokens (20%) were distributed from June 26, 2016, to July 1, 2017.<br \/>\n700 million tokens (70%) are currently being sold in the amount of 2 million per day for 350 days.<br \/>\n100 million tokens (10%) being kept in <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/block.one\/\" target=\"_blank\" rel=\"noopener noreferrer\">Block.one<\/a><\/span> to ensure procurement of 10 million tokens a year.<\/p>\n<p>EOS tokens were listed on most exchanges, which meant the market determined the price of the tokens. The token sale was open to everyone who was interested in buying and selling tokens. Holders and investors could use Ethereum Wallet, MyEtherWallet, and MetaMask to hold EOS tokens and easily trade them, for example, on exchanges like <em>Bitfinex<\/em> and <em>YoBit<\/em>.<\/p>\n<h2><img loading=\"lazy\" class=\"size-full wp-image-2340 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/EOS-token-distribution.jpg\" alt=\"EOS token sale\" width=\"905\" height=\"516\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-token-distribution.jpg 905w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-token-distribution-350x200.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-token-distribution-500x285.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-token-distribution-768x438.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-token-distribution-600x342.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/EOS-token-distribution-132x75.jpg 132w\" sizes=\"(max-width: 905px) 100vw, 905px\" \/>Summary<\/h2>\n<p>To sum up, EOS is a controversial project. However, the fact that it is among the most popular coins today with tokens listed in major exchanges leaves no doubt that it is worth considering when thinking about running a cryptocurrency. The potential of EOS blockchain-based technology seems impressive, as it solves problems linked with pre-existing blockchain-based networks.<\/p>\n<p>No one knows what will happen in the next couple of years, but the $4 billion budget should be more than enough, for the project to accomplish its goals and develop new opportunities for its admirers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to CoinMarketCap, EOS cryptocurrency is the fifth most popular currency after Bitcoin, Ethereum, XRP, and Bitcoin Cash on the crypto exchanges. On June 1, Cointelegraph reported that EOS had accomplished its year-long token sale, raising a record-breaking $4 billion. Its position on the exchange platforms brings about the need for profound research of the [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":173968,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,156,173,176,190,192,215,267,268],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"EOS cryptocurrency is considered to be the fifth most popular in the world. Let’s discover what it has to offer, along with the key features of EOS crypto.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"EOS cryptocurrency is considered to be the fifth most popular in the world. Let’s discover what it has to offer, along with the key features of EOS crypto.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-09-07T12:27:13+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T20:10:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/32.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"575\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/32.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/#primaryimage\"},\"datePublished\":\"2018-09-07T12:27:13+00:00\",\"dateModified\":\"2022-01-11T20:10:55+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"EOS cryptocurrency is considered to be the fifth most popular in the world. Let\\u2019s discover what it has to offer, along with the key features of EOS crypto.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/how-does-eos-crypto-work\/\",\"name\":\"How Does EOS Crypto Work?\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2332"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2332"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2332\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173968"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2332"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2332"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2332"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}