{"id":2390,"date":"2018-09-17T13:32:12","date_gmt":"2018-09-17T13:32:12","guid":{"rendered":"https:\/\/applicature.com\/?p=2390"},"modified":"2019-08-01T12:37:58","modified_gmt":"2019-08-01T12:37:58","slug":"getting-started-with-solidity-ethereum-development-why-and-how","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how","title":{"rendered":"Getting Started with Solidity Ethereum Development: Why and How"},"content":{"rendered":"<p>[vc_row row_type=&#8221;row&#8221; use_row_as_full_screen_section=&#8221;no&#8221; type=&#8221;full_width&#8221; angled_section=&#8221;no&#8221; text_align=&#8221;left&#8221; background_image_as_pattern=&#8221;without_pattern&#8221;][vc_column][vc_column_text]Creating and deploying smart contracts on Ethereum is getting easier with Solidity, contract-oriented programming language. Developers extensively use Solidity to write smart contracts in Ethereum.<\/p>\n<h2>What Is Ethereum, Anyway?<\/h2>\n<p>Surely, you’ve heard about blockchain and its ability to change the game, right? Invented in 2008, blockchain technology came before Bitcoin. This tendency continued in similar cryptocurrencies, like Ethereum. Before we get to know Ethereum, let’s define its features and properties.<br \/>\nEthereum is a decentralized platform that keeps smart contracts running. It allows developers to write dApps that protect against fraud and eliminate third parties.<br \/>\nMoreover, the decentralized Ethereum blockchain makes every computer in the network its server, without any need for a central authority. This means that every transaction is secured with a hash, and only network nodes (current users) may sign it.<br \/>\nEthereum’s blockchain is similar to Bitcoin’s, meaning that it is a distributed record of transaction histories. Obviously, that’s not all; so, to describe it further, we will go deeper into its principles.<br \/>\nConsidering Bitcoin and Ethereum as similar ecosystems, we will draw a parallel and present their differences. While Bitcoin uses unspent transactions to track how many coins each node has, the Ethereum network uses accounts. This picture will specify the process:<\/p>\n<p class=\"aligncenter\"><img loading=\"lazy\" class=\"aligncenter wp-image-2405 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/09\/1391558.jpg\" alt=\"\" width=\"1045\" height=\"1100\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558.jpg 973w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558-105x110.jpg 105w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558-333x350.jpg 333w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558-475x500.jpg 475w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558-768x808.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558-600x632.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558-114x120.jpg 114w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/1391558-285x300.jpg 285w\" sizes=\"(max-width: 1045px) 100vw, 1045px\" \/>In contrast with Bitcoin, the Ethereum blockchain is capable of communication with smart contracts as well their deployment. Buterin&#8217;s promise has worked well.<br \/>\nIn order to read or execute any contract, we trigger the Ethereum Virtual Machine (EVM). EVM is an engine of the network, which confirms transactions (including contract-creation transactions), guarantees and ensures security, and provides assurance that the smart contract will work similarly on all nodes.<br \/>\nApart from storing an up-to-date status, nodes also keep a full history of all actions in the network.<br \/>\nLet’s see why Ethereum wins as a platform for decentralized apps.<\/p>\n<h2>The Benefits of Ethereum<\/h2>\n<p>As we continue to explore the cryptomarket, Ether comes in second after Bitcoin as a cryptocurrency used worldwide. Despite the fact that it appeared five years after Bitcoin, its success is skyrocketing. Here are some reasons why:<\/p>\n<h3>How Widespread Is It?<\/h3>\n<p>Jeremy Allaire, CEO and co-founder of FinTech, assumes the Ethereum blockchain will be as popular as the internet one day. Allaire says Ethereum has blasted the market, as it allows creation of apps and the ability to issue tokens, as well. Therefore, it is unlimited.<br \/>\nAlso, new kinds of financial-contract development are now possible due to smart-contract technology.<\/p>\n<h3>Lower Cost<\/h3>\n<p>Similarly to Bitcoin’s mining, nodes on the Ethereum blockchain mine Ether (its cryptocurrency). Ether fuels the system. As soon as miners solve an NP-class problem, they set a fee (gas) to add the solved transaction to the blockchain. While the gas amount per operation is fixed, the gas price depends on market conditions. By paying bigger gas, you potentially decrease confirmation time for your transactions, because miners give higher priority to transactions with the bigger gas amounts in the transaction pool.<\/p>\n<h3>Time-Consuming Approach<\/h3>\n<p>While Bitcoin’s block-mining time remains at about 10 minutes, it takes approximately 14 seconds to mine an Ether block. Although parties require 30 confirmations of the transaction to get Ether, time consumption is still relatively less.<br \/>\nOverall, Ethereum is a sophisticated platform for starting decentralized applications and smart contracts. We’ve added some extra Ethereum blockchain advantages to this picture:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-2382 size-full\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Ethereum-benefits.jpg\" alt=\"\" width=\"1069\" height=\"649\" \/><\/p>\n<h2>Smart Contracts<\/h2>\n<p>To make the Ethereum ecosystem live and function, developers fall back on the writing of smart contracts. They create functions and commands that are activated, self-executed, and deactivated according to certain conditions.<br \/>\nTo put it simply, a smart contract is a set of code lines that is like a self-executing computer program, but also eliminates intermediaries. The main issue with a traditional treaty law is security, which smart contracts principally ensure.<br \/>\nIn blockchain, smart contracts are digital assets, developed to store funds, receive funds, and carry out payments.<br \/>\nIn brief, smart contracts function on the Ethereum blockchain with their own Ethereum address and balance. One of the functions sends and receives money. When a smart contract gets its function trigger, it activates.<\/p>\n<h3>Smart-Contract Implementation<\/h3>\n<p><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/bitcoin.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Bitcoin<\/a><\/span> creates smart contracts using C++ or Java programming languages. Bitcoin smart contracts serve as multisignature accounts, payment channels, or a multi-party lottery without an operator.<br \/>\nSidechain technology makes <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.rootstock.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">RootStock<\/a><\/span> a platform similar to Bitcoin. A Smart contract built for RootStock is quite comparable with a smart contract on Ethereum.<br \/>\n<a href=\"https:\/\/www.ethereum.org\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Ethereum<\/span><\/a> works with a contract-oriented, Turing-complete programming language called Solidity. Smart contracts self-execute their functions via Ethereum Virtual Machine.<\/p>\n<h2>Solidity Programming Language<\/h2>\n<p>Originally suggested in 2014 by Gavin Wood, Solidity has become the most popular programming language for Ethereum smart contract creation. C++, JavaScript, and PowerShell had a bit of influence on its development.<br \/>\nFurthermore, Solidity is a statically-typed, Turing-complete language. For EVM to read Solidity, its compiler converts it to bytecode.<br \/>\nWith experience in writing code in an object-oriented language, it won’t be difficult to start using Solidity, a contract-oriented language. This is due to the similarity of the contract with the OOP class.<br \/>\n<a href=\"https:\/\/solidity.readthedocs.io\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Solidity’s documentation<\/span><\/a> says:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2381 size-full\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Solidity-documentation.jpg\" alt=\"\" width=\"1242\" height=\"644\" \/><\/p>\n<p>With its features, developers can create blind auctions, crowdfunding events, multi-signature wallets, and much more. You can find examples of listed smart contracts <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/solidity.readthedocs.io\/en\/latest\/solidity-by-example.html#voting\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a><\/span>.<br \/>\nAdditionally, there is no ability to generate random numbers in Solidity (without using <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"http:\/\/www.oraclize.it\/\" target=\"_blank\" rel=\"noopener noreferrer\">Oracle<\/a><\/span>) due to two factors:<br \/>\nComplex algorithms are quite expensive. At the same time, each computation increases the total gas price needed for a transaction, which is why Solidity requires a more plain approach.<br \/>\nAs multiple nodes will run the contract, it should be degenerative.<br \/>\nOne more peculiarity is time. The Solidity time concept is relative, as it depends on gas, the number of transactions in the blockchain pool, and market conditions.<br \/>\nIt’s worth mentioning that Solidity is limited in string function. According to Solidity documentation, you’d better use bytes for arbitrary-length, raw-byte data, and string for arbitrary-length string data. If possible, cut the length and use one of bytes1 to bytes32, as they are cheaper.<\/p>\n<h3>Solidity Tutorials<\/h3>\n<p>Even though Solidity is relatively young and is still developing, there are plenty of sensible, comprehensive tutorial books and videos on it.<br \/>\nLearning the Solidity programming language may get easier with Chris Dannen’s contribution: “Introducing Ethereum and Solidity.” Unlike other resources, this book will help many people in addition to professional programmers who decide to redirect their skills to blockchain technology. Chris Dannen makes it comprehensive enough even for beginners in programming, as his tutorial contains full and complete information on the Ethereum project and Solidity programming language. “Introducing Ethereum and Solidity” contains:<\/p>\n<ul>\n<li>an overview of the Ethereum network<\/li>\n<li>a comparison of distributed and web apps<\/li>\n<li>an example of a smart contract written in Solidity<\/li>\n<li>basic and intermediate smart-contract tutorials<\/li>\n<li>dApp, coin, and blockchain deployment<\/li>\n<\/ul>\n<p>The video tutorials mentioned below may also help you figure out how Solidity programming works:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.youtube.com\/watch?v=v_hU0jPtLto\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Tutorial 1: Basics<\/span>;<\/a><\/li>\n<li><a href=\"https:\/\/www.youtube.com\/watch?v=6hkmLOtIq8A\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Tutorial 2: Inheritance<\/span>;<\/a><\/li>\n<li><a href=\"https:\/\/www.youtube.com\/watch?v=3ObTNzDM3wI\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Tutorial 3: Custom Modifiers and Error Handling<\/span>;<\/a><\/li>\n<li><a href=\"https:\/\/www.youtube.com\/watch?v=3ObTNzDM3wI\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">A Beginner’s <\/span>Gguide<span style=\"color: #e70f00;\"> to <\/span>Ssmart<span style=\"color: #e70f00;\"> C-contracts in Solidity<\/span>;<\/a><\/li>\n<li><a href=\"https:\/\/www.youtube.com\/watch?v=3681ZYbDSSk\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">How to Build an Ethereum dApp<\/span>.<\/a><\/li>\n<\/ul>\n<h2><\/h2>\n<h2>Create Your Smart Contract in Solidity<\/h2>\n<p>As mentioned earlier, EVM, Ethereum’s environment for processing transactions and smart contract code approval, runs smart contracts (a digital asset) through every node. Let’s consider in detail how a Solidity smart contract should be structured.<br \/>\nThe first line in the contract shows the Solidity compiler version used for writing this code. “Pragmas” are instruction for the compiler code execution process.<\/p>\n<pre line=\"1\" lang=\"Javascript\">pragma solidity ^0.4.24;<\/pre>\n<p>Through the next lines of code, we designate that this is a smart contract for simple token creation. We set token balance mapping (key -&gt; value pair); its key is an ETH address, and its value is presented by a token balance. The commands you see will store the balance of each token holder:<\/p>\n<pre line=\"1\" class=\"\" lang=\"Javascript\">contract ERC20ExampleToken {\r\nmapping (address =&gt; uint256) balanceOf;<\/pre>\n<p>The next step is to set the total amount of tokens you are willing to issue:<\/p>\n<pre line=\"1\" lang=\"Javascript\">uint256 public totalSupply;<\/pre>\n<p>“string” commands will set the name of your token and its symbol. The token’s symbol is abbreviated from the name. None of them is unique; therefore, there is the possibility of encountering two tokens of the same name. The only thing that distinguishes one from the other is their ETH address.<\/p>\n<pre line=\"1\" lang=\"Javascript\">string public name;\r\nstring public symbol;<\/pre>\n<p>The “constructor” function is a kind of entrance. It will run the contract when deployed to the blockchain.<\/p>\n<pre line=\"1\" class=\"\" lang=\"Javascript\">constructor \r\nuint256 _totalSupply,\r\nstring _name,\r\nstring _symbol\r\n) public {<\/pre>\n<p>Then we assign values from a constructor to our smart contract local variables:<\/p>\n<pre line=\"1\" lang=\"Javascript\">totalSupply = _totalSupply;\r\nname = _name;\r\nsymbol = _symbol;<\/pre>\n<p>Now we set the balance of the contract creator to _totalSupply. After the line presented below, the owner of the contract will get the supply of tokens on his\/her balance:<\/p>\n<pre line=\"1\" lang=\"Javascript\">balanceOf[msg.sender] = totalSupply;\r\n}<\/pre>\n<p>When implementing the ERC-20 token standard, the “transfer” function expects to have 2 parameters: _to (for the token receiver) and _amount (for the number of tokens we want to transfer):<\/p>\n<pre line=\"1\" lang=\"Javascript\">function transfer(address _to, uint256 _amount) public {<\/pre>\n<p>The “require” statement appears for checking that the receiver is not a zero address, and the number of tokens for transfer is larger than zero:<\/p>\n<pre line=\"1\" lang=\"Javascript\">require(_to != address(0));\r\nrequire(_amount =&gt; 0);\r\nbalanceOf[msg.sender] = balanceOf[msg.sender] - _amount;\r\nbalanceOf[_to] = balanceOf[_to] + _amount;\r\n}\r\n}<\/pre>\n<p>Also, you can find tutorials on smart-contract development in <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/create-smart-contract-quickly-and-easily\"><span style=\"font-weight: 400;\">Applicature blog<\/span><\/a><\/span><span style=\"font-weight: 400;\">. For any help or more information contact us <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/smart-contracts-development\/\">here<\/a><\/span>.<\/span><\/p>\n<h2>Conclusion<\/h2>\n<ul>\n<li>Ethereum is an open platform based on blockchain technology. Ethereum serves to create dApps and store transaction data.<\/li>\n<li>The engine of the platform is the Ethereum Virtual Machine (EVM), which operates smart contracts. In this case, “operating” means executing functions and commands in smart contracts.<\/li>\n<li>The cryptocurrency that keeps the Ethereum ecosystem alive is Ether. It is much faster to mine than Bitcoin.<\/li>\n<li>A smart contact is a digital protocol that guarantees security and eliminates third parties (banks, logistics companies, retailers, etc.)<\/li>\n<li>Developers prefer writing Ethereum smart contracts in the Solidity contract-oriented programming language. Smart contracts in Solidity provide the opportunity to write programs that are able to solve computational problems and apply complex logic.<\/li>\n<li>Solidity is a statically typed language that supports inheritance, libraries, and complex user-defined types, among other features.<\/li>\n<\/ul>\n<p>[\/vc_column_text][\/vc_column][\/vc_row]    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row row_type=&#8221;row&#8221; use_row_as_full_screen_section=&#8221;no&#8221; type=&#8221;full_width&#8221; angled_section=&#8221;no&#8221; text_align=&#8221;left&#8221; background_image_as_pattern=&#8221;without_pattern&#8221;][vc_column][vc_column_text]Creating and deploying smart contracts on Ethereum is getting easier with Solidity, contract-oriented programming language. Developers extensively use Solidity to write smart contracts in Ethereum. What Is Ethereum, Anyway? Surely, you’ve heard about blockchain and its ability to change the game, right? Invented in 2008, blockchain technology came before [&hellip;]<\/p>\n","protected":false},"author":15,"featured_media":2400,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Getting Started with Solidity Ethereum Development: Why and How<\/title>\n<meta name=\"description\" content=\"Applicature defines Solidity Ethereum in its thorough tutorial for developers. Our exhaustive guide will help you figure out how Ethereum and Solidity work.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Getting Started with Solidity Ethereum Development: Why and How\" \/>\n<meta property=\"og:description\" content=\"Applicature defines Solidity Ethereum in its thorough tutorial for developers. Our exhaustive guide will help you figure out how Ethereum and Solidity work.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-09-17T13:32:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:37:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Solidity-for-Ethereum-Smart-Contracts-03.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/09\/Solidity-for-Ethereum-Smart-Contracts-03.jpg\",\"width\":1024,\"height\":535,\"caption\":\"Solidity smart contracts\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/\",\"name\":\"Getting Started with Solidity Ethereum Development: Why and How\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/#primaryimage\"},\"datePublished\":\"2018-09-17T13:32:12+00:00\",\"dateModified\":\"2019-08-01T12:37:58+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\"},\"description\":\"Applicature defines Solidity Ethereum in its thorough tutorial for developers. Our exhaustive guide will help you figure out how Ethereum and Solidity work.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\/\",\"name\":\"Getting Started with Solidity Ethereum Development: Why and How\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\",\"name\":\"Kateryna Hanko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Kateryna Hanko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2390"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/15"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2390"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2390\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/2400"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2390"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2390"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2390"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}