{"id":2466,"date":"2018-10-04T08:29:24","date_gmt":"2018-10-04T08:29:24","guid":{"rendered":"https:\/\/applicature.com\/?p=2466"},"modified":"2022-01-11T20:26:53","modified_gmt":"2022-01-11T20:26:53","slug":"bitcoin-technology-introduction","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction","title":{"rendered":"Bitcoin Technology Introduction"},"content":{"rendered":"<p>The best way to foresee the future of Bitcoin is to realize its global role in the sphere of finance. For this, we will review its mode of operation and its types of forks. With this information, we will try to understand why the world still needs it.<\/p>\n<h2>The Essence of Bitcoin and Economic Relations<\/h2>\n<p>As economic relations develop, the government&#8217;s monopoly on the definition of legally significant facts expands. This comes along with increased risk when conducting transactions. The state assesses the benefits <em>ex-ante<\/em>, stipulating the legal status of all parties and transactions. It determines the laws applicable to legal relations, and, accordingly, the potential consequences for business and individuals.<\/p>\n<p>Finally, it is the state that has the authority to authenticate legal norms. The state&#8217;s monopoly should ensure the stability of civil turnover. It inevitably puts the business into dependence upon an arbitrary view of the manifestations of the rule of law. Thus, as the state apparatus and bureaucracy grow, other risks grow. These include corruption, misuse of administrative resources, and legal conflict. All of this makes participants in the turnover look for alternative ways of processing and executing transactions.<\/p>\n<h3><em>Bitcoin Technology Introduction<\/em><\/h3>\n<p><em>The Bitcoin technology introduction happened in 2008. It is an alternative infrastructure for <\/em>the negotiation<em> and conclusion of transactions.<\/em><\/p>\n<p>Bitcoin protocol was developed in 2008 and is described in <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/bitcoin.org\/bitcoin.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">the white paper<\/a><\/span> by Satoshi Nakamoto. Experts cannot establish the author&#8217;s identity to this day. In addition, the article was the first to consider in detail the mechanism for registering transactions on the blockchain. It enabled the launch of the Bitcoin transaction settlement system and the provision of instant Bitcoin transactions anywhere in the world.<\/p>\n<p>In 2009, the developers of the protocol registered the first Bitcoin transaction protocol block or genesis block. They released the first 50 bitcoins into circulation. In the same year, they published the first Bitcoins rate on the exchange in relation to the dollar.  At that time, for the price of 1 U.S. dollar, it was possible to buy 1,309 bitcoins.<\/p>\n<h3>A Peer-to-Peer Payment Network<\/h3>\n<p>Bitcoin is a distributed (peer-to-peer) payment network based upon its own<span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/blockchain-implementation\"> blockchain<\/a><\/span> protocol. This means that users can store the encrypted payment information on each node, thereby eliminating data loss. The use of encryption algorithms reduces the cost of verifying the authenticity of data. To confirm the reliability of the information, it is enough to compare special codes. These are assigned to each Bitcoin transaction or block of transactions. It is not necessary to check the subject of the transaction or the availability of the parties&#8217; authorities to conclude it. The number of funds and the will of the parties to complete the Bitcoin transaction are confirmed by consensus. Thus, even if a security issue remains open, we still have progress. The acceleration of economic relations at the expense of the blockchain network speaks for itself.<\/p>\n<h2>Bitcoin Blockchain: A Unique and Generous Technology<\/h2>\n<p>The initial goal of its creation was not to serve the world of finance but to replace its current operating system. Payments in the distributed Bitcoin system are decentralized and confidential. Information about users is encrypted using virtual keys. These allow the sender to confirm the legitimacy of the Bitcoin transaction. The recipient, in turn, can publish a public address to which payments can be made.<\/p>\n<p>With the evolution of the Bitcoin distributed network and the emergence of crypto exchanges, new opportunities have arisen. It has become possible to exchange units of digital assets for fiat money and tangible assets. This confirmed the viability of Bitcoin as a technology and pointed to the innovative role of digital currency in the real world.<\/p>\n<h3>Structure and Consensus<\/h3>\n<p>On the distributed ledgers, in order to add a transaction and create new Bitcoins, you must engage in <em>consensus<\/em>. This process is called <em>mining<\/em>. It assumes that individuals will be rewarded for their services with a certain number of Bitcoins. Thus, miners find and process transactions, providing network security with specialized equipment. In exchange, they receive new bitcoins. Users (nodes) use their computing power to verify, store and ensure the security of transactions on the Bitcoin blockchain.<\/p>\n<h3>Bitcoin Proof of Work<\/h3>\n<p>Thousands of miners start calculations, but only one finds a solution and validates transactions. In order to be approved and registered on the network, each block must be the result of a machine\/algorithmic consensus. This is called <em><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/en.wikipedia.org\/wiki\/Proof-of-work_system\" target=\"_blank\" rel=\"noopener noreferrer\">Proof of Work<\/a><\/span> (PoW)<\/em>, or confirmation of the performance of the work. The complexity changes every 2,016 blocks. The network assigns complexity such that the world&#8217;s computing power requires 14 days to generate 2,016 blocks. Therefore, Bitcoin’s complexity grows with the power of the network.<\/p>\n<p>Proof of Work (PoW) works as follows: nodes run a hash algorithm multiple times or compute a mathematical puzzle. They are based upon a certain algorithm to verify digital transactions. Within the Bitcoin blockchain ecosystem, all nodes are anonymous and potentially malicious, so the consensus is necessary for network security.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2467\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain.png\" alt=\"longest proof-of-work chain\" width=\"915\" height=\"422\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain.png 915w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain-132x61.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain-350x161.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain-500x231.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain-768x354.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain-600x277.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain-120x55.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/longest-proof-of-work-chain-300x138.png 300w\" sizes=\"(max-width: 915px) 100vw, 915px\" \/><\/p>\n<p>The security of a public blockchain like Bitcoin is based upon the achievement of consensus. This makes it impossible for mathematicians to commit illegal transactions or records, and, above all, to change or delete them.<\/p>\n<p>This is how the Bitcoin Proof of Work (PoW) code works:<\/p>\n<pre line=\"1\" class=\"\" lang=\"Javascript\">def prove(m=10, prefix='000'):\r\nnonce = 0 # a nonce needn't be an integer\r\nproofs = {}\r\nwhile (len(proofs) &lt; m):\r\nnonce_str = str(nonce).encode('utf-8')\r\nattempt = base + nonce_str\r\nh = hashlib.sha256(attempt).hexdigest()\r\nif h.startswith(prefix):\r\n# assume p(collision) is approx. 0\r\nproofs[attempt] = h\r\nnonce += 1\r\nreturn proofs<\/pre>\n<p>The use of public cryptography and structure (such as the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/brilliant.org\/wiki\/merkle-tree\/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Merkle tree<\/em><\/a><\/span>) inside the public blockchain has other useful functions. It allows the verification of data and prevents illegal Bitcoin transactions in a chain of blocks.<\/p>\n<p>In the Bitcoin public blockchain, trust results from the operations themselves rather than the status of the parties. In this distributed, secure, open-source system, each participant keeps his or her own copy of the data. The entire team of participants validates payments and they appear on the network instantly.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2469\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree.png\" alt=\"bitcoin transactions hashed in Merkle tree\" width=\"861\" height=\"472\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree.png 861w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree-132x72.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree-350x192.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree-500x274.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree-768x421.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree-600x329.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree-120x66.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transactions-hashed-in-Merkle-tree-300x164.png 300w\" sizes=\"(max-width: 861px) 100vw, 861px\" \/><\/p>\n<p>Cryptography guarantees that certified parties conduct transactions and that there is only one true version of the transaction. Proceeding from these general provisions, we may assume that private blockchains are just a new type of database.<\/p>\n<h3>Bitcoin Transactions<\/h3>\n<p>In order to obtain a reliable status, each node signs transaction using <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/searchsecurity.techtarget.com\/definition\/asymmetric-cryptography\" target=\"_blank\" rel=\"noopener noreferrer\">asymmetric cryptography<\/a><\/span> (<em>private key\/public key<\/em>).  Asymmetric cryptography or public key\/private key encryption stands in opposition to symmetric cryptography. The main principle of asymmetric encryption is the presence of two keys (which the user &#8220;creates&#8221; him\/herself). Therefore, in order to implement a transaction in the Bitcoin public ledger, users need three types of information:<\/p>\n<ul>\n<li>the personal key of the debit address<\/li>\n<li>the general key of the credit address<\/li>\n<li>the amount of the transaction.<\/li>\n<\/ul>\n<p>The Bitcoin-address is a specialized coding of alphanumeric characters. These include figures as well as upper and lowercase letters. Satoshi Nakamoto excluded the I, I, 0 and O letters and digits, as in some fonts, they look the same. A Bitcoin-address is the only information necessary to get bitcoins.<\/p>\n<h3><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2470\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/bitcoin-transaction.png\" alt=\"bitcoin transaction\" width=\"732\" height=\"410\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transaction.png 732w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transaction-132x74.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transaction-350x196.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transaction-500x280.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transaction-600x336.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transaction-120x67.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/bitcoin-transaction-300x168.png 300w\" sizes=\"(max-width: 732px) 100vw, 732px\" \/>Bitcoin Currency<\/h3>\n<p>Bitcoin currency, unlike other currencies, is not the embodiment of a state body, bank, or company. Each Bitcoin is identified in the ledger using the transaction history of all participants since its creation. Since the advent of Bitcoin, a large number of forks have been created. A fork is the use of a software project code as a base for starting another project. Each such branch can evolve independently from the main project, implementing opportunities that were not originally in the main project.<\/p>\n<h3>Network Operation<\/h3>\n<p>Bitcoin technology is a peer-to-peer network. When a new computer tries to connect to the network, its first task is to find other computers connected to it. Once the user connects the computer, the second step is to download the Bitcoin transaction database. This is a record of all operations that the project had carried out since its launch. It also contains all Bitcoin transactions that transferred a certain number of Bitcoins from one account to another. A bit-address identifies this account in a way that is schematically similar to a bank account number.<\/p>\n<p>To become legitimate, each node must sign a transaction using asymmetric encryption or double-key encryption. At input, the Bitcoin transaction receives a reference to the previous transaction. It confirms the fact that the funds mentioned in the transaction are real. At the output, it produces one or more Bitcoin-addresses with corresponding amounts assigned to them. The inputs and outputs of any transaction are always balanced.<\/p>\n<p>However, nodes do not immediately identify this new Bitcoin transaction as valid. They first included it in the transaction register (sequence of blocks). The register consists of a set of transaction blocks. Bitcoin transactions, sent in the encoded form, are recognized as valid by corresponding coded signatures. Those signatures represent the transaction. Currently, the daily number of Bitcoin transactions is growing rapidly.<\/p>\n<h3>Wallet<\/h3>\n<p>The Bitcoin blockchain is arranged in a fundamentally different way from banking institutions, which allow clients to have multiple accounts. They usually contain all the information relating to the history of each account. Blockchain keeps track of Bitcoin transactions, but it does not keep information on the balance in the user’s account. Therefore, it is impossible to restore user data.<\/p>\n<p>Users own a wallet that contains &#8220;addresses&#8221; associated with a pair of keys. These keys work with an asymmetric encryption system (public key\/private key). Note that the private key is stored in the <a href=\"https:\/\/applicature.com\/blog\/blockchain-bitcoin-wallet\"><span style=\"color: #e70f00;\">Bitcoin wallet<\/span>.<\/a> The public key is written in the blockchain, and is, therefore, inviolable.<\/p>\n<h2>Bitcoin Forks<\/h2>\n<p>The slang term &#8220;fork&#8221; is used to indicate a change in the program code of a particular network. In the blockchain, at the moment of a fork, a single chain is divided into two separate branches. The initial chain can drag further in parallel with the new branch, or even cease to exist. If it functions further, then its program code remains the same. The new branch already carries a new program code, different from the code of the main chain.<\/p>\n<p>Let’s review the list of Bitcoin blockchain forks:<\/p>\n<p><strong>Bitcoin XT<\/strong> (August 15, 2015) is an alternative version (fork) of the standard Bitcoin Core program for network nodes. The developers of Bitcoin XT stated that they are committed to Bitcoin’s original principles. These were formulated by Satoshi Nakamoto, and strive to make the system more convenient for ordinary people. Bitcoin realized support for instant transactions and increased block size in comparison with Bitcoin Core.<\/p>\n<p><strong>Bitcoin Unlimited<\/strong> was the next after Bitcoin XT fork. It appeared in January 2016, and also focused on solving the problem of network scaling. However, in this case, the project team chose a different path for its development. They suggested that the nodes themselves decide the size of the network blocks, and in this way, they take a bet on democracy. The initiative had no success. The community faced the threat that large pools of miners could determine the development of the network by concentrating computing areas. It devalued Satoshi Nakamoto’s original idea about decentralization.<\/p>\n<p>Bitcoin Classic was launched by Gavin Andersen (creator of Bitcoin XT) in February 2016. The goal of this project was to enlarge network bandwidth by doubling block size. It did not fully function because of the need for a hardcore.<\/p>\n<p><strong>Bitcoin Cash<\/strong>: a group of developers led by Amory Sechet held a planned fork on August 1, 2017. The division of Bitcoin&#8217;s block was on block number 478558. This was the last common block for Bitcoin and Bitcoin Cash. The next block was formed in two different formats. The first one, by the SegWit 2x protocol, was adopted for the Bitcoin blockchain. The second one was by the original Bitcoin Cash protocol. An interesting point is connected to this event. All users with a certain number of Bitcoins in their account at the time of division received a similar amount of new cryptocurrency.<\/p>\n<p>Bitcoin Cash benefits:<\/p>\n<ul>\n<li>increased Bitcoin transactions speed due to an increased block size<\/li>\n<li>the use of simpler equipment for mining in comparison with conventional Bitcoin<\/li>\n<li>the rapid growth of market capitalization (4th place in the general rating of cryptocurrencies)<\/li>\n<li>the advanced system of protection against break-ins<\/li>\n<\/ul>\n<p>On October 25, 2017, another fork of Bitcoin was held. The new branch was called <strong>Bitcoin Gold<\/strong>. As in the case of Bitcoin Cash, users automatically received a new currency. Their amount was equal to the existing number of Bitcoins in their account.<\/p>\n<p><strong>Bitcoin Pizza<\/strong> (BPA). The main fork feature was to change the protocol by using the acyclic DAG graph. It is successfully used in the IOTA cryptocurrency. It is also recognized by specialists as the fastest algorithm for achieving consensus.<\/p>\n<p><strong>Bitcoin Interest<\/strong> (BCI). This project is also focused on the introduction of the PROGPOW algorithm. It was planned in order to implement a function to adjust the complexity of each block. Bitcoin Interest will allow the owners of tokens to receive interest from their current capital. In addition, the Segwit will increase the reliability of the block.<\/p>\n<p><strong>The Bitcoin LITE<\/strong> (BTCL) main feature is the use of PoS consensus. The main competitor of the coin, according to numerous forecasts, will be Litecoin, not BTC.<\/p>\n<h3>The Lightning Network<\/h3>\n<p>With the implementation of the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/lightning.network\/\" target=\"_blank\" rel=\"noopener noreferrer\">Lightning Network<\/a><\/span>, nodes can perform an incredibly large number of Bitcoin transactions. This may solve the problem of network scalability.<\/p>\n<p>Benefits of the Lightning Network:<\/p>\n<ul>\n<li>Outputs are part of transactions outside the blockchain, thereby increasing network bandwidth to 1,000 transactions per second.<\/li>\n<li>Increases the security of interaction between network participants through the introduction of smart contracts.<\/li>\n<li>Establishes extremely low commissions for conducting transactions (while the project is being tested, many transactions pass without commissions at all).<\/li>\n<li>Makes it possible to conduct Bitcoin transactions in the amount of 1 Satoshi. Creates favorable conditions for the implementation of micropayments.<\/li>\n<li>In the future, it will make direct exchange possible between blockchains. This will allow the exchange one cryptocurrency for another without the participation of a third party.<\/li>\n<\/ul>\n<h2>Bitcoin’s Future<\/h2>\n<p>The year 2010 was a crucial period in Bitcoin’s development. As a result of a significant strengthening of user infrastructure, the rate of Bitcoin cryptocurrency compared to the U.S. dollar soared tenfold. Bitcoin experienced a period of ups and downs from 2010 to 2017. In spite of this, the protocol continued to evolve and attract users.<\/p>\n<p>Today, we can see that something really negative is happening with Bitcoin. In 2018, the Bitcoin’s price significantly decreased — to about 60% of its historic peak price. But we can also see something positive in that.  <em>The Bitcoin&#8217;s price reduction and the inevitable drop of other altcoins will improve the situation in the crypto market. It will preserve only pragmatists and tech professionals doing business, and leave its speculative audience segment in the past.<\/em><\/p>\n<h3>Why Do We Still Need Bitcoin?<\/h3>\n<p>Because the Bitcoin blockchain is the safest in the world. First of all, it is public. Second of all, blockchain technology was designed to ensure the reliability of transactions and payment information. A full realization of its potential allows it to counteract against unscrupulous users. This will thereby protect participants in the turnover from state intervention. In 2010, blockchain confirmed its effectiveness in protecting users from software errors. In August of that year, a program bug was registered in the transaction chain. After checking the distributed chain of transactions, users found an error and corrected the code on the basis of consensus. So, blockchain technology, which is the basis for Bitcoin payments, has confirmed its status. As a security instrument, it has protected users from unfair program errors.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2471\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/privacy-models-comparison.png\" alt=\"privacy models comparison\" width=\"768\" height=\"260\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/privacy-models-comparison.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/privacy-models-comparison-132x45.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/privacy-models-comparison-350x118.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/privacy-models-comparison-500x169.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/privacy-models-comparison-600x203.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/privacy-models-comparison-120x41.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/privacy-models-comparison-300x102.png 300w\" sizes=\"(max-width: 768px) 100vw, 768px\" \/><\/p>\n<p>Bitcoin technology also provides security with its PoW consensus. The PoW algorithm, as a distributed and decentralized consensus, consists of decrypting data or mathematical calculations. So, in order to produce cryptocurrency, it is necessary to go through the decryption process. At this point, it is important to clarify that miners are involved in more than the verification of Bitcoin transactions. In fact, anyone can run Bitcoin and verify the correctness of all operations. This is a distinctive feature and a strength of the Bitcoin protocol. It provides everyone with the ability to make sure that everything goes according to the rules.<\/p>\n<h3>What About Bitcoin Computational Power?<\/h3>\n<p>Recently, the aggregate processing power in the main Bitcoin network reached an absolute maximum of 61.8 EH\/s.<\/p>\n<p>According to existing data, the computing power of the Bitcoin network is gradually and continuously increasing. It is also important to note that the complexity of mining new blocks on the blockchain is growing. Therefore, the speed of mining does not change significantly.<\/p>\n<p>This is another indirect confirmation that mining has not lost its relevance. The quantity and quality of miners are steadily growing.<\/p>\n<h2>Summary<\/h2>\n<p>The Bitcoin blockchain is a free, open technology. It operates in a peer-to-peer network without a central authority (financial institution). This allows the exchange of objects (BTC) and records each transaction in a large, unchangeable ledger.<\/p>\n<p>Bitcoin is now on the list of the top 5 actively-developing projects. Since the introduction of Bitcoin technology, it became a trigger for the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/ico-consulting\/\">cryptocurrency sphere development<\/a><\/span>.  For this reason, we’re still hoping that in the future, there will be a place for this unique and generous technology.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The best way to foresee the future of Bitcoin is to realize its global role in the sphere of finance. For this, we will review its mode of operation and its types of forks. With this information, we will try to understand why the world still needs it. The Essence of Bitcoin and Economic Relations [&hellip;]<\/p>\n","protected":false},"author":13,"featured_media":173973,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[150,154,156,157,176],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Bitcoin Technology Introduction: Everything You Need to Know<\/title>\n<meta name=\"description\" content=\"In 2008, Bitcoin triggered the beginning of the cryptocurrency era. Let’s take a closer look at the introduction of Bitcoin technology.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Bitcoin Technology Introduction\" \/>\n<meta property=\"og:description\" content=\"Applicature explains Bitcoin technology and its significance for the global economy.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-10-04T08:29:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T20:26:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Bitcoin-The-Essence-and-the-Future.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Bitcoin Technology Introduction\" \/>\n<meta name=\"twitter:description\" content=\"Applicature explains Bitcoin technology and its significance for the global economy.\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/37.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/\",\"name\":\"Bitcoin Technology Introduction: Everything You Need to Know\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/#primaryimage\"},\"datePublished\":\"2018-10-04T08:29:24+00:00\",\"dateModified\":\"2022-01-11T20:26:53+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\"},\"description\":\"In 2008, Bitcoin triggered the beginning of the cryptocurrency era. Let\\u2019s take a closer look at the introduction of Bitcoin technology.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/bitcoin-technology-introduction\/\",\"name\":\"Bitcoin Technology Introduction\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\",\"name\":\"Victoria Melnychuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/g12-scaled.jpg\",\"caption\":\"Victoria Melnychuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2466"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2466"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2466\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173973"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2466"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2466"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2466"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}