{"id":2484,"date":"2018-10-12T12:54:06","date_gmt":"2018-10-12T12:54:06","guid":{"rendered":"https:\/\/applicature.com\/?p=2484"},"modified":"2020-03-18T16:12:01","modified_gmt":"2020-03-18T16:12:01","slug":"ethereum-smart-contract-storage","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage","title":{"rendered":"Ethereum Smart-Contract Storage"},"content":{"rendered":"<p>2018 is the year of the boom of cryptocurrency popularity. A vivid example of this is the fact that the number of Ethereum addresses in use is becoming bigger every day. More users mean more funds that people trust to the Ethereum blockchain, which they use to store their capital.<\/p>\n<p>The market capitalization of the Ethereum platform was <strong><span style=\"color: #339966;\">$64<\/span><\/strong> billion USD as of May 23rd, 2018. In addition, Ethereum tokens, which are included to the top 100, achieved <strong>$39<\/strong> billion USD.<\/p>\n<p>This creates a need to discover how Ethereum storage works and what can be stored there to understand what is happening to money after people have trusted it to the Ethereum blockchain.<\/p>\n<p>First of all, let’s learn about the Ethereum platform more deeply.<\/p>\n<h2>What Is Ethereum?<\/h2>\n<p>Ethereum is a blockchain-based decentralized computing platform that allows the execution of programs that are created on the Ethereum blockchain with the Solidity contract-oriented programming language.<\/p>\n<p>In short, Ethereum provides a network that includes a lot of computers operating together in order to build a true “supercomputer” which democratizes the current client-server model. It offers thousands of &#8220;nodes&#8221; that are run by volunteers from all over the world, instead of servers and clouds.<\/p>\n<p>Ethereum executes insurance contracts, exchanges financial instruments, and stores data. It enables equal opportunity for offering services on top of this infrastructure for all users. For example, there are a lot of applications users can download and install on their computers, but they rely on a company (or another third-party service) to store their credit card information, purchase history, and other private information, which means those parties have access to all of them.<\/p>\n<p>Providing an open network to all users facilitates stealing, leaks, and potential changes to important private information of users without their awareness. Users store their personal information on clouds and servers that are the property of companies like Amazon, Google, and Facebook. With a variety of conveniences, like secure data and an absence of costs for hosting and uptime, these companies also bring vulnerabilities to the entire computer system.<\/p>\n<p>Moreover, third parties like Google and Apple allow applications that are governed exclusively by them (Evernote, Google Docs, iTunes).<br \/>\nEthereum is a disruptive technology that helps us withstand the vulnerabilities internet third parties bring to users. Ethereum returns control of personal data to users and provides creative rights, as well. The main idea is that third-party companies won’t have access to make changes to user data. If the owner of the data saves edits or adds or deletes notes, each node on the network will see the changes.<\/p>\n<p>Looking at Ethereum from the software perspective, it contains a set of accounts, each of which has a balance (in Ether).<\/p>\n<p>After a user has created his\/her own Ethereum wallet, he or she can execute transactions, transfer Ether to other users, or deploy smart contracts.<\/p>\n<p>The transaction processing system of Ethereum consists of:<\/p>\n<ul>\n<li>a state: a set of all accounts and their balances<\/li>\n<li>a transaction<\/li>\n<li>a new state: an updated set of accounts and their balances<\/li>\n<\/ul>\n<p>Each account has an address and a balance. There are two types of accounts in Ethereum: user and smart-contract. A smart contract is a digital asset deployed to EVM (the Ethereum Virtual Machine) that can store data, hold Ether, and execute functions.<\/p>\n<h2>What Is an Ethereum Array?<\/h2>\n<p>All smart contracts run in the Ethereum Virtual Machine (EVM) and keep a state in its own permanent storage. Ethereum storage is a gigantic array that initially contains zero information. Each value in the array is 32 bytes wide. In total, there are 2,256 values. Smart contracts can read from or write to a value at any given place.<\/p>\n<p>As zero does not occupy any space, and there is the possibility to restore all values by setting them to zero. The amount of gas spent on changing a value to zero can be refunded.<\/p>\n<h3>Locating Fixed-Sized Values<\/h3>\n<p>A known variable of fixed size receives a particular place in storage. The Solidity programming language places slots (specific locations of values within the storage):<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2485 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage.png\" alt=\"specific locations of values within the storage\" width=\"831\" height=\"235\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage.png 831w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage-132x37.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage-350x99.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage-500x141.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage-768x217.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage-600x170.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage-120x34.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/specific-locations-of-values-within-the-storage-300x85.png 300w\" sizes=\"(max-width: 831px) 100vw, 831px\" \/>“a” value is stored at slot 0<br \/>\n“b” values are stored at slots 1 and 2<br \/>\n“c” value occupies slot 3; and the next slots as the entry structure stores two 32-byte values.<\/p>\n<p>The slots are defined during the compilation time, which depends on the order of the variables appearing in the contract code.<\/p>\n<h3>Dynamically-Sized Values<\/h3>\n<p>Dynamically-sized arrays need locations to keep their sizes and elements.<\/p>\n<p>Only the information that the dynamically-sized array “d” has placed in slot 5 is stored. The array stores the values consecutively, starting at the hash of the slot.<\/p>\n<p><em><img loading=\"lazy\" class=\"size-full wp-image-2486 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values.png\" alt=\"Dynamically-Sized Values\" width=\"854\" height=\"265\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values.png 854w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values-132x41.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values-350x109.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values-500x155.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values-768x238.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values-600x186.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values-120x37.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Dynamically-Sized-Values-300x93.png 300w\" sizes=\"(max-width: 854px) 100vw, 854px\" \/>Note: Reserved slots cannot be used in dynamically-sized arrays and mapping, as we do not know the number of slots to reserve. Solidity performs a hash function to repeatedly compute locations for dynamically-sized values.<\/em><\/p>\n<h3>Mapping<\/h3>\n<p>In mapping, there is the requirement to find the location related to a given key. We can hash the key; however, consider the fact that different mappings should generate different locations.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2487 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/Mapping.png\" alt=\"Mapping\" width=\"853\" height=\"328\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping.png 853w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping-132x51.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping-350x135.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping-500x192.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping-768x295.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping-600x231.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping-120x46.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Mapping-300x115.png 300w\" sizes=\"(max-width: 853px) 100vw, 853px\" \/>“e” value is placed in slot 6, and “f” in slot 7, but there are no lengths or personal values stored at those locations.<\/p>\n<p>It is possible to determine the location of a particular value within mapping by hashing the key and the mapping’s slot.<\/p>\n<p>We can combine dynamically-sized arrays and mappings to find a location of a value by recursively applying the calculations.<\/p>\n<p>We can find items within the following complex types.<\/p>\n<h2>What Data Can Be Stored in Ethereum Storage?<\/h2>\n<p>First, let’s find out what type of information we can store to enable blockchain network operation. Here is a simple example of a transaction:<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2489 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/Alice-and-Bob.png\" alt=\"a simple example of a transaction\" width=\"512\" height=\"211\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Alice-and-Bob.png 512w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Alice-and-Bob-132x54.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Alice-and-Bob-350x144.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Alice-and-Bob-500x206.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Alice-and-Bob-120x49.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Alice-and-Bob-300x124.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" \/>Trace the balances and other data from different customers and each piece of data that is running on the blockchain; for example, transactions. Every platform behaves differently. Let’s discover what is happening on the Ethereum platform.<\/p>\n<p>Ethereum is a transaction-based “state” machine, which means that all transactions based on state-machine concepts can be created. It starts from its own genesis block. Transactions, contracts, and mining are constantly changing the state of the Ethereum blockchain. For example, an account balance that is stored in a state tray remembers all changes made upon transaction execution.<\/p>\n<p>The state trie, or Merkle Tree, of Ethereum provides a key and value pair for every account in the system. This “key” is a single 160-bit identifier (the address of the Ethereum account). The “value” in the state trie is generated through encoding the following account details of the Ethereum account, with the recursive-length prefix (RLP) encoding method:<\/p>\n<ul>\n<li>nonce<\/li>\n<li>balance<\/li>\n<li>storageRoot<\/li>\n<li>codeHash<\/li>\n<\/ul>\n<p>The state trie’s root node (a hash of the current state trie) can be used to identify the state trie; the state trie’s root node cryptographically depends upon all internal state-trie data.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2492 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/The-state-trie’s-root-node-2.jpg\" alt=\"a hash of the current state trie\" width=\"512\" height=\"207\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-state-trie’s-root-node-2.jpg 512w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-state-trie’s-root-node-2-350x142.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-state-trie’s-root-node-2-500x202.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-state-trie’s-root-node-2-132x53.jpg 132w\" sizes=\"(max-width: 512px) 100vw, 512px\" \/>The <em><strong>storage <\/strong><\/em>trie is the place where contract data is stored. Every account has its own storage trie. A 256-bit hash of the storage trie’s root node is a storageRoot value in the global state trie.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2493 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/The-storage-trie .png\" alt=\"storageRoot value in the global state trie\" width=\"1055\" height=\"545\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie .png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie -132x68.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie -350x181.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie -500x258.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie -768x397.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie -600x310.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie -120x62.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-storage-trie -300x155.png 300w\" sizes=\"(max-width: 1055px) 100vw, 1055px\" \/>The <strong><em>transaction trie<\/em> <\/strong>is included in every Ethereum block. The miner who governs the block determines the order of transactions in the block.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2494 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/The-transaction-trie.png\" alt=\"The transaction trie\" width=\"928\" height=\"243\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie.png 928w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie-132x35.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie-350x92.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie-500x131.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie-768x201.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie-600x157.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie-120x31.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/The-transaction-trie-300x79.png 300w\" sizes=\"(max-width: 928px) 100vw, 928px\" \/>One can gain access to a particular transaction in the transaction trie through its index. A transaction will always have the same position, as the mined blocks are immutable. Having determined the location of the transaction, you will use the same path to it every time you need it.<\/p>\n<p>The Ethereum blockchain stores the root node hashes of transactions, states, and receipts directly; however, it does not provide the option to keep data such as account balances, for example.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2495 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/the-root-node-hashes-of-transactions.jpg\" alt=\"the root node hashes of transactions\" width=\"512\" height=\"389\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/the-root-node-hashes-of-transactions.jpg 512w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/the-root-node-hashes-of-transactions-350x266.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/the-root-node-hashes-of-transactions-500x380.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/the-root-node-hashes-of-transactions-132x100.jpg 132w\" sizes=\"(max-width: 512px) 100vw, 512px\" \/>In the scheme provided above, we notice that the root node hash of Ethereum storage that contains all smart-contract data indicates the state trie that points to the blockchain.<\/p>\n<p>The Ethereum blockchain stores two types of data:<\/p>\n<ol>\n<li>Permanent (e.g., the record of a transaction that has already been confirmed and cannot be changed)Ephemeral (e.g., the balance of a particular Ethereum account address that the storage keeps is changed after every individual account.)<\/li>\n<li>Ethereum structures both of these types of data and stores them separately in order to manage them.<\/li>\n<\/ol>\n<p>We can compare the record-keeping system of Ethereum to the type of ATM\/debit card that banks use to track the amount of money every debit card possesses. This provides a response to its owner about whether or not the card has enough money before approving the transaction.<\/p>\n<h2>Types of Ethereum Tries<\/h2>\n<p>Mainly, Ethereum clients use 2 different database software solutions to store their tries:<\/p>\n<h3>Rocksdb<\/h3>\n<p>RocksDB is built over LevelDB, and is scalable to run on servers with many CPU cores; to efficiently use fast storage; to support IO-bound, in-memory, and write-once workloads; and to be flexible to allow for innovation. In RocksDB, many of the drawbacks of LevelDB are eliminated. In addition, functionality is significantly expanded. Well-known users of RocksDB include: Facebook, Yahoo, LinkedIn, Airbnb, Pinterest, Uber, and Netflix. In addition, RocksDB is applied in projects like CockroachDB, TiDB, and Apache Flink.<\/p>\n<h3>Leveldb<\/h3>\n<p>Leveldb is a commonly-used data storage for system logging that provides platform persistence. It is an open-source Google key-value storage library that offers forward and backward iterations over data, ordered mapping from string keys to string values, custom comparison functions, and automatic compression. The open-source Google compression\/decompression library “Snappy” provides automatic data compression. By the way, GoLang, C++, and Python clients use this database.<\/p>\n<h2>Decoding Data<\/h2>\n<p>When a user queries leveldb, it returns encoded results because the Ethereum blockchain uses its own unique Modified Merkle Patricia Tree implementation during leveldb execution.<\/p>\n<p>The information on the design and implementation of both Ethereum’s Modified Merkle Patricia Tree and Recursive Length Prefix (RLP) encoding can be found on the Ethereum Wiki.<\/p>\n<p>As Ethereum uses a tree data structure, the Modified Merkle Patricia provides a method of “extending” a node according to which one can shortcut the descent.<\/p>\n<p>A Modified Merkle Patricia tree node isone of the following:<\/p>\n<ul>\n<li>an empty string (referred to as NULL)<\/li>\n<li>an array that includes 17 items (referred to as a branch)<\/li>\n<li>an array that includes 2 items (referred to as a leaf)<\/li>\n<li>an array that includes 2 items (referred to as an extension)<\/li>\n<\/ul>\n<p>It is recommended to use computer code to inspect all tries. For example, we can use ethereumjs, which implements Ethereum’s VM in Javascript, the repositories of which are easy to install and use. Also, they are useful for peering into Ethereum leveldb database.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2496 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/10\/ethereumjs.png\" alt=\"computer code to inspect all tries\" width=\"846\" height=\"293\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs.png 846w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs-132x46.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs-350x121.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs-500x173.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs-768x266.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs-600x208.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs-120x42.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/ethereumjs-300x104.png 300w\" sizes=\"(max-width: 846px) 100vw, 846px\" \/>An interesting fact is that Ethereum accounts can be included in a state trie after a transaction has already been located. If one creates a new account using the field “get account new,” this account will not be included in the state trie. This is also impossible even after the mining of many blocks.<\/p>\n<p>On the other hand, if a transaction is successful (costs gas and is located to a mined block), it is recorded against that account, so it will be recorded to the state trie. This feature helps avoid hacker attacks that register new accounts and bloat the state trie.<\/p>\n<h2>Storage Issues<\/h2>\n<p>One of the main issues users face is rapid database increase, which results in significant storage costs. The database, also known as the Ethereum state, contains all of the computations memorized by the computers. The cost of storing the database is constantly increasing, which makes the ability to run full nodes impossible for more and more users. As a result, the network can be changed into a centralized one, and become accessible only to a few users.<\/p>\n<p>Ethereum developers have provided really effective protocol-level changes: for example, sharding to minimize the size of the database.<br \/>\nTo cope with other issues, Geth and Parity recently developed the following updates.<\/p>\n<p>First, they offered to eliminate temporary files from the network history in order to reduce storage requirements. Because of long synchronization times, Ethereum has been unable to use hard drive since last summer. This update allows the running of full nodes and Ethereum software with faster synchronization times on a hard drive instead of a solid-state drive (SSD). This has brought a lot of positive comments from Ethereum users.<\/p>\n<p>The independent developer Alexey Akhunov suggested a second update: to simplify the process of the overall state through rewriting the geth client (&#8220;turbo geth&#8221;). In his opinion, the adaptation of the software can help to run random access memory or RAM much faster, and enable users to synchronize with the network instantly.<\/p>\n<p>Additionally, Ethereum can implement &#8220;stateless clients&#8221; who store a compression of the overall state. If these clients have no need to access storage from files or for block validation, they can keep their information. Pruning old, irrelevant data, empty or long-inactive accounts, and the time required for checks will all drop significantly. There are also difficulties with code operation: coordination difficulties that need to be overcome in order to ensure the code continues to operate as designed.<\/p>\n<p>The Constantinople update, which will be released in October 2018, will bring a new challenge for Ethereum users: a balance between a web of diverse stakeholders. The ‘difficulty bomb,’ a piece of code from the Constantinople update, was developed to promote new technology for the platform. However, it can also make blocks steadily less time-efficient to mine. Special measures should be taken to allow the processing of transactions and the operation of the blockchain as originally conceived.<\/p>\n<p>The delay with the difficulty bomb release also had a negative impact on Ether inflation; therefore, the Ethereum platform must upgrade its code before the difficulty bomb hits.<\/p>\n<p>There are three offerings on how to improve Ether inflation (EIPs): EIP 145, EIP 1014, and EIP 1052 will facilitate state channels and increase the speed of contract verification.<\/p>\n<p>Some clients think the Constantinople update should also reduce the amount of Ether given to miners — people who run special computing hardware to ensure the security of transactions. This opinion is also expressed by ETH traders, who believe that it will preserve the value of the currency and the network.<\/p>\n<p>In response, miners state that a decrease in their income will cause a decrease in the security of the Ethereum platform.<\/p>\n<p>Also, learn more about <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/smart-contract-mistakes-bugs-pitfalls\">smart contract bugs and pitfalls<\/a><\/span> while implementation in order to avoid some technical issues.<\/p>\n<h2>Conclusion<\/h2>\n<p>Having discovered the operation of the Ethereum network and its storage, we can make a conclusion that Ethereum provides effective alternative storage for transactions involving third-party companies.<\/p>\n<p>The fact that the number of Ethereum adherents is constantly growing proves that today, people prefer to use a decentralized application over a centralized one. This means that the era of blockchain-based technologies will continue for a long time to come. By the way, you have a great chance to contact <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\">Applicature team<\/a><\/span> to develop your own smart contract that meets all regulatory requirements in your country. \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>2018 is the year of the boom of cryptocurrency popularity. A vivid example of this is the fact that the number of Ethereum addresses in use is becoming bigger every day. More users mean more funds that people trust to the Ethereum blockchain, which they use to store their capital. The market capitalization of the [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":2501,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[156,195,252,261],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"Ethereum cold storage keeps all information on carried out transactions and funds flow in the Ethereum blockchain.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"Ethereum cold storage keeps all information on carried out transactions and funds flow in the Ethereum blockchain.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-10-12T12:54:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-03-18T16:12:01+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Ethereum-Smart-Contract-Storage-03.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"575\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/10\/Ethereum-Smart-Contract-Storage-03.jpg\",\"width\":1100,\"height\":575,\"caption\":\"ethereum storage\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/#primaryimage\"},\"datePublished\":\"2018-10-12T12:54:06+00:00\",\"dateModified\":\"2020-03-18T16:12:01+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"Ethereum cold storage keeps all information on carried out transactions and funds flow in the Ethereum blockchain.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-smart-contract-storage\/\",\"name\":\"Ethereum Smart-Contract Storage\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2484"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2484"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2484\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/2501"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2484"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2484"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2484"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}