{"id":2700,"date":"2018-11-13T17:47:29","date_gmt":"2018-11-13T17:47:29","guid":{"rendered":"https:\/\/applicature.com\/?p=2700"},"modified":"2019-08-05T05:34:23","modified_gmt":"2019-08-05T05:34:23","slug":"consensus-protocol","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol","title":{"rendered":"The Use of Cryptocurrency Consensus: Why and How"},"content":{"rendered":"<p>With no single leader, blockchain consists of a network of individual nodes that are connected in a decentralized manner. In order for any action to happen or for any transaction to go through, common consensus must be reached. This system functions according to a consensus protocol (mechanism). In this article, we outline the functionality of cryptocurrency consensus algorithms along with their types, peculiarities, and pros and cons in various blockchains.<\/p>\n<p>Blockchain technology functions as a decentralized digital ledger with a peer-to-peer payment and interaction system. Its main characteristic is its independence and freedom from centralized control and the interference of authority. Devoid of single-institution dependence and corruption, the blockchain is currently solving a myriad of organizational issues within a wide range of industries. It provides users, providers, and organizations with transparent record-tracking, immutability, enhanced security, and, of course, safe, fast transaction processing.<\/p>\n<p>On the other hand, the implementation of blockchain might not be as easy as its concept. It is crucial to understand how to make decisions within the system, and how to perform all sorts of actions without the common pattern of centralized leadership management.<\/p>\n<h2>What Is a Consensus Mechanism?<\/h2>\n<p>According to Wikipedia, consensus decision-making is:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2701\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2.jpg\" alt=\"Consensus Protocol Wikipedia Definition\" width=\"748\" height=\"276\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2.jpg 748w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2-132x49.jpg 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2-350x129.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2-500x184.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2-600x221.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2-120x44.jpg 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanism-definition2-300x111.jpg 300w\" sizes=\"(max-width: 748px) 100vw, 748px\" \/><br \/>\nTo put it simply, the process of reaching consensus is a common agreement within a group of people that a certain action is true and valid. Commonly, this is performed according to a voting procedure to ensure that the decision is beneficial for the whole group of users, not just a single individual or minority. What’s interesting is that a number of nodes from any part of the world can make this type of decision, without geographical limitation. This approach contributes equality, fairness, and unity to our modern society.<\/p>\n<p>Various blockchains use the consensus mechanism (and there are many types of consensus that will be discussed) with the following objectives:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2702\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/Consensus-Mechanisms.jpg\" alt=\"Consensus Protocol Objectives\" width=\"799\" height=\"1738\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanisms.jpg 471w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanisms-51x110.jpg 51w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanisms-161x350.jpg 161w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanisms-230x500.jpg 230w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanisms-55x120.jpg 55w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Mechanisms-138x300.jpg 138w\" sizes=\"(max-width: 799px) 100vw, 799px\" \/><\/p>\n<p>Having defined consensus, it is now crucial to understand exactly how it is used in the blockchain. Considering that blockchain is a huge network of nodes, it is essential to provide a way to establish trust in the system. Various types of consensus serve as a means of agreement on any transaction placed on the blockchain. If someone wants to send funds to another, it is essential to check whether the sender has sufficient funds in his or her wallet, and whether the receiver has complied with his obligations according to the smart contract. As long as the transaction is verified, it is considered valid, and only then can be executed\/processed.<\/p>\n<h2>Types of Consensus Algorithms on the Blockchain<\/h2>\n<p>Blockchain technology provides different ways of reaching cryptocurrency consensus within the system. This process is called <strong><em>eventual consistency<\/em><\/strong>, which means that any action or transaction must eventually go through confirmation and validation in order to be processed. For this, blocks of data, as well as transaction mechanisms, are hosted within data patterns of different parties who do not trust each other. These parties verify data validity with the use of cryptocurrency consensus algorithms and cryptographic data audits, relying on a system of hashes within a Merkle tree:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2703\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/merkle-tree.png\" alt=\"cryptocurrency consensus merkle tree\" width=\"640\" height=\"362\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/merkle-tree.png 640w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/merkle-tree-132x75.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/merkle-tree-350x198.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/merkle-tree-500x283.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/merkle-tree-600x339.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/merkle-tree-120x68.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/merkle-tree-300x170.png 300w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p>In order to reach the eventual consistency, an order-executive architecture commonly comes into use. This means that the blockchain system first orders all transactions in sequential order, and only afterward does it execute them one by one. This type of approach often results in low performance due to time inefficiency and high computational costs.<\/p>\n<p>These characteristics refer to the proof-of-work consensus algorithm. The first blockchain platform, <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/bitcoin-transactions\">Bitcoin<\/a><\/span>, primarily used it. Let’s take a closer look at its working principles and major pros and cons.<\/p>\n<h3>Proof-of-Work (PoW) Consensus Algorithm<\/h3>\n<p>Proof of Work functions on the principle that miners solve difficult cryptographic problems in order to mine a block and verify its validity for inclusion in the blockchain. In order for a transaction to be executed, it has to go through six stages of verification. Therefore, the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/bitcoin-transaction\">proof-of-work process<\/a><\/span> requires a large amount of computational power, energy, and mining effort. The problems miners solve often appear to be complicated in order to provide higher security. This is beneficial in terms of safety, but significantly slows down the process of transaction verification.<\/p>\n<p>The process includes the following:<\/p>\n<ul>\n<li>miners compete against each other in order to solve a problem\/puzzle first<\/li>\n<li>miners solve mathematical problems and puzzles including hash function definition, integer factorization, and guided puzzle protocol<\/li>\n<li>the miners who succeed first receive rewards for completed tasks (usually in cryptocurrency)<\/li>\n<\/ul>\n<p>The major benefit of the PoW consensus protocol is that it definitely works. For this reason, such blockchains as Bitcoin, Ethereum, Litecoin, and many others still use it.<\/p>\n<p><strong>Pros<\/strong>: highest scalability and security; serves as one of consensus <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/smart-contracts-development\/\">smart contracts’<\/a><\/span> best practices.<\/p>\n<p><strong>Cons<\/strong>: low performance.<\/p>\n<p>Its variations include:<\/p>\n<p>[visualizer id=&#8221;2704&#8243;]<\/p>\n<p>Currently, there exists a wide range of consensus algorithms to choose from. In order to solve the problem of eventual consistency, various platforms have started implementing alternatives to Proof of work. As a result, blockchains have managed to provide more efficient speed of transaction processing, higher scalability, and enhanced security. Let’s take a look at a few alternative consensus mechanisms.<\/p>\n<h3>Proof-of-Stake Consensus Algorithm<\/h3>\n<p>Proof of stake is another popular algorithm used for reaching consensus. As a matter of fact, Ethereum has been planning to switch PoW to PoS. It hasn’t yet, but the intention remains.<br \/>\nProof of stake replaces the mining process of data verification with validators. This requires them to own a stake: a number of coins. Validators vote on transaction validity based upon this stake. The votes of nodes holding higher amounts of stake are more valuable. This is further multiplied by computational power.<\/p>\n<p>The process includes the following features:<\/p>\n<ul>\n<li>a block validator is chosen according to the stake he\/she owns<\/li>\n<li>instead of a reward, the miner charges transaction fees<\/li>\n<li>PoS currencies can be much more cost-effective<\/li>\n<\/ul>\n<p>PoS algorithm doesn’t require as much computational power as PoW; therefore, it is less expensive.<\/p>\n<p>On the other hand, the biggest drawback of this consensus protocol is the so-called “nothing at stake.” If a fork occurs, the consensus mechanism enables the network to decide which chain to choose. The problem is that the majority wins, and this doesn’t depend upon which chain is actually the right one. “Nothing at stake” allows the choice of a “wrong” chain, even if it has malicious intentions and will lose nothing. Moreover, the block validator can choose two chains, and get his or her rewards either way.<\/p>\n<p><strong>Pros<\/strong>: high performance, scalability, smart-contract support.<\/p>\n<p><strong>Cons<\/strong>: medium security, nothing-at-stake problem.<\/p>\n<p>PoS has the following variations:<\/p>\n<p>[visualizer id=&#8221;2705&#8243;]<\/p>\n<h3>Delegated Proof-Of-Stake Consensus Algorithm<\/h3>\n<p>Delegated Proof of Stake is a variation of the above-mentioned PoS algorithm. Currently, EOS, Steemit, and Bitshares implement DPoS in order to provide better scalability.<\/p>\n<p>According to its working principle, token holders don&#8217;t have to vote on block validity themselves. Instead, they can delegate their vote to other validators. In EOS, for instance, there are between 21 and 100 random validators.<\/p>\n<p>This approach allows a lot of members participate in the process of decision-making with the opportunity to validate blocks according to the total number of votes they receive relative to other producers.<\/p>\n<p>The process includes the following stages:<\/p>\n<ul>\n<li>Blocks get confirmed in a round of 21.<\/li>\n<li>At the beginning of a new round, block producers\/validators are chosen (according to the number of votes they have).<\/li>\n<li>According to the block’s random number, validators shuffle around to assure that the connection of balance and producer maintains.<\/li>\n<li>Producers have to validate at least one block per 24 hours to avoid the punishment.<\/li>\n<\/ul>\n<p>Another DPoS peculiarity is that no forking option exists. This is due to an absence of competition and the necessity of cooperation. If a fork does occur, DPoS consensus protocol will switch to the longest chain.<\/p>\n<p><strong>Pros<\/strong>: scalability, speed, cost-efficiency.<\/p>\n<p><strong>Cons<\/strong>: partial centralization in terms of legal agreement between the delegates.<\/p>\n<p>Possible variations:<\/p>\n<p>[visualizer id=&#8221;2706&#8243;]<\/p>\n<h3>Byzantine Fault Tolerance<\/h3>\n<p>The idea of Byzantine Fault Tolerance (BFT) is to ensure the existence of a certain number of validators who must agree on transaction validity. This concerns the Byzantine Generals’ problem. If one person decides to validate a transaction even if it is corrupt, everyone would have to go with it. The BFT algorithm requires the votes of at least one third of the validators in order to provide higher security.<\/p>\n<p>To achieve the agreement, it is important to solve the Byzantine Generals’ Problem through the votes of numerous nodes on the leader of decision-making. The leader is the node that first receives a transaction to verify, and the others vote whether they believe it or not.<\/p>\n<p>Hyperledger, Stellar, Dispatch, and Ripple use this algorithm.<\/p>\n<p><strong>Pros<\/strong>: high throughput, cost-efficiency, smart-contract support<\/p>\n<p><strong>Cons<\/strong>: low scalability, semi-centralized system<\/p>\n<p>Possible variations:<\/p>\n<p>[visualizer id=&#8221;2707&#8243;]<\/p>\n<h3>Quorum-Based Protocol Example<\/h3>\n<p>Quorum has designed another interesting solution for consensus protocol. Quorum is an Ethereum sidechain platform which is especially advantageous for use in the financial sector. This enterprise-focused blockchain functions as a permissioned blockchain. This means that the network won’t be open or freely accessible to anyone. It is possible to store data privately as well as publicly, with certain read or write permissions.<\/p>\n<p>The Quorum consensus protocol, referred to as QuorumChain, initiates from the first block: the genesis block. Quorum protocol is pretty straightforward, as it functions according to a majority of votes. According to this principle, a set of nodes can relegate voting rights and re-assign them to other nodes. For this purpose, smart-contract use comes in handy, as it tracks the conditions and status of voting nodes within the system. The smart contract triggers a voting procedure and further pings the nodes to conduct a transaction within a specific block. Quorum-protocol transactions include hashes of global transactions, public-state root hashes, and the signature of the block creator.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2708\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/quorum-protocol.jpg\" alt=\"quorum consensus protocol\" width=\"800\" height=\"393\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/quorum-protocol.jpg 800w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/quorum-protocol-350x172.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/quorum-protocol-500x246.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/quorum-protocol-768x377.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/quorum-protocol-600x295.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/quorum-protocol-132x65.jpg 132w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h2>Conclusion<\/h2>\n<p>Having discussed the most commonly-used consensus protocols, it is clear that there exists a wide range to choose from. It is crucial to understand, though, that each consensus has its advantages and disadvantages. There is no best match.<\/p>\n<p>To choose the right algorithm, the question of the blockchain platform should be approached. Financial-sector businesses that need to confirm their transactions quickly and scalably with smart-contract use would not choose the Bitcoin platform, as the PoW algorithm isn’t the best match. Even the Ethereum mainnet, the most widespread network in use, charges high gas fees and still uses the PoW. Therefore, considering Ethereum side chains such as Quorum, Corda, Loom, Plasma, and Plasma Cash would be better, as they have an absolutely new approach to the problem of eventual consistency.<\/p>\n<p>Want to launch your project, but still wondering how, and which platform to use? <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/contact-us\/\">Contact Applicature<\/a>!<\/span> Our team of experts would be happy to help you out.[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With no single leader, blockchain consists of a network of individual nodes that are connected in a decentralized manner. In order for any action to happen or for any transaction to go through, common consensus must be reached. This system functions according to a consensus protocol (mechanism). In this article, we outline the functionality of [&hellip;]<\/p>\n","protected":false},"author":12,"featured_media":2709,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,168],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What is Cryptocurrency Consensus, and Which Consensus Is Best?<\/title>\n<meta name=\"description\" content=\"A consensus protocol is an integral part of a cryptocurrency transaction processing within the blockchain. Find out their different types and features.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What is Cryptocurrency Consensus, and Which Consensus Protocol Is Best?\" \/>\n<meta property=\"og:description\" content=\"A consensus mechanism is an integral part of a cryptocurrency transaction processing within the blockchain. Find out their different types and means of application.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-11-13T17:47:29+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-05T05:34:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Protocols-Pros-and-Cons.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"What is Cryptocurrency Consensus, and Which Consensus Protocol Is Best?\" \/>\n<meta name=\"twitter:description\" content=\"A consensus mechanism is an integral part of a cryptocurrency transaction processing within the blockchain. Find out their different types.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Protocols-Pros-and-Cons.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Consensus-Protocols-Pros-and-Cons.jpg\",\"width\":1024,\"height\":535,\"caption\":\"Consensus Protocol: pros and cons\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/\",\"name\":\"What is Cryptocurrency Consensus, and Which Consensus Is Best?\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/#primaryimage\"},\"datePublished\":\"2018-11-13T17:47:29+00:00\",\"dateModified\":\"2019-08-05T05:34:23+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/17f46426cb241f38a85a4789b6367bc1\"},\"description\":\"A consensus protocol is an integral part of a cryptocurrency transaction processing within the blockchain. Find out their different types and features.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/consensus-protocol\/\",\"name\":\"The Use of Cryptocurrency Consensus: Why and How\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/17f46426cb241f38a85a4789b6367bc1\",\"name\":\"Olga Hryniuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Olga Hryniuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2700"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2700"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2700\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/2709"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2700"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2700"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2700"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}