{"id":2735,"date":"2018-11-15T08:04:34","date_gmt":"2018-11-15T08:04:34","guid":{"rendered":"https:\/\/applicature.com\/?p=2735"},"modified":"2022-01-11T20:36:10","modified_gmt":"2022-01-11T20:36:10","slug":"ethereum-fork","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork","title":{"rendered":"Ethereum Hard Forks Explained"},"content":{"rendered":"<h2>What Is a Cryptocurrency Fork?<\/h2>\n<p>The world of cryptocurrency is quite young, and it is constantly evolving. A striking feature of cryptocurrencies is that all transactions are recorded in the blockchain. On the one hand, this makes it possible to track all transactions and remain confident of their security. On the other, it is impossible to change or rewrite cryptocurrency code. Sometimes, while working, cryptocurrency users find errors in the code or in system operation. This is where forks come to the rescue.<\/p>\n<p>Before proceeding to an analysis of Ethereum soft fork and hard fork, however, we must delve into technical terminology.<\/p>\n<p>A fork is a change or modification to the program code that underlies a cryptocurrency or a change in the operating principles of the blockchain system, according to which transaction data blocks are considered authentic and are added to the global network. The cryptocurrency program code is opened for viewing, and anyone can interact with it. As it is publicly available for viewing, one can identify problems and errors unaccounted for by its creators and suggest options for eliminating them. Of course, no one can make changes to the global blockchain network, since other participants will not accept them. It is possible to offer an option and submit it for coordination with the most influential market participants, who have concentrated most of their production capacity into their own hands and serve the vast majority of transactions.<\/p>\n<p>There are two types of forks:<\/p>\n<p>A<em><a href=\"https:\/\/www.investopedia.com\/terms\/s\/soft-fork.asp\" target=\"_blank\" rel=\"noopener noreferrer\"> soft fork<\/a><\/em> implies minimal intervention in the existing technology and will have only a point effect, without serious consequences for the asset. A soft fork introduces updates to the existing protocol. Its previous versions can still be used, but there are additional features in the new version. For example, if you do not upgrade Skype, you can still use it, but without the new functions. You will not lose your contact list. Ethereum soft fork operates on the same principle.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2736\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork.png\" alt=\"Blockchain Soft Fork\" width=\"1124\" height=\"426\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork.png 1124w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-132x50.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-350x133.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-500x190.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-768x291.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-1024x388.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-600x227.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-120x45.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Soft-Fork-300x114.png 300w\" sizes=\"(max-width: 1124px) 100vw, 1124px\" \/><\/p>\n<p>Most often, soft forks are used by developers of a cryptocurrency or top mining pools who decide to make minor changes to the network. It is not necessary to update the software nodes for this. Usually, the network simply “rolls” a few blocks back and makes the necessary changes to the code. The implementation of the Ethereum soft fork requires the consent of a majority of network participants.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2737\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/a-soft-fork.jpg\" alt=\"a soft fork\" width=\"1614\" height=\"563\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork-132x46.jpg 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork-350x122.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork-500x174.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork-768x268.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork-600x209.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork-120x42.jpg 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-soft-fork-300x105.jpg 300w\" sizes=\"(max-width: 1614px) 100vw, 1614px\" \/><\/p>\n<p>Users who did not support the innovation can still work on the old chain.<\/p>\n<p>A<em><a href=\"https:\/\/www.investopedia.com\/terms\/h\/hard-fork.asp\" target=\"_blank\" rel=\"noopener noreferrer\"> hard fork<\/a><\/em> is a radical restructuring of the asset&#8217;s software code, which affects the fundamentals of its work. This results in changes all the way up to the mining principles and rules by which transactions take place. In simple terms, a soft fork assumes a change in the code. New units of the blockchain network released after the changes to the network do not contradict the old blocks of information and can interact with them within a single mechanism.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2738\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork.png\" alt=\"Blockchain Hard Fork\" width=\"1124\" height=\"482\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork.png 1124w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-132x57.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-350x150.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-500x214.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-768x329.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-1024x439.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-600x257.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-120x51.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Blockchain-Hard-Fork-300x129.png 300w\" sizes=\"(max-width: 1124px) 100vw, 1124px\" \/><\/p>\n<p>A hard fork changes the rules so much that it results in a split of the old asset into two parts, one of which works according to the old principles. The other functions according to the rule set by the initiators of the hard fork. It can be said that a hard fork leads to the emergence of a new asset on the market based on the older one, but their principles of work differ. Despite the similar essence of their working principles, the assets cannot interact with each other, as the systems upon which they are based will not understand each other. Hard forks are quite rare, but when they happen, they attract the close attention of the public, as users will be forced to take a side.<\/p>\n<p>A hard fork generates drastic change in the source code and is incomparable with the old protocol and software. In this case, a new chain is separated from the old one, and no longer interacts with it. Transactions made in the previous chain are not recognized by the new chain. The approval of network participants is required for carrying out hard forks; however, if some miners come out against it, a split will occur. That is, two separate chains will appear on the basis of one source code. They can exist in parallel; the chain that users have chosen most often survives. The second immediately dies away or goes through a long period of stagnation.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2739\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/a-hard-fork.png\" alt=\"Ethereum hard fork\" width=\"1603\" height=\"586\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork-132x48.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork-350x128.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork-500x183.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork-768x281.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork-600x219.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork-120x44.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/a-hard-fork-300x110.png 300w\" sizes=\"(max-width: 1603px) 100vw, 1603px\" \/><\/p>\n<p>Recently, the cryptocurrency community has been talking about a third type of network fork: the<em> user soft fork<\/em>. The idea is that network rules will not be changed by developers or miners, but rather by cryptocurrency exchanges and ordinary coin holders. So far, however, there is neither a clear plan for the implementation of such a scheme nor a real understanding of how it will work.<\/p>\n<p>The causes and factors leading to forks can be very different. For example, an error may be detected in the source code of a cryptocurrency that weakens its protection. In order to close this gap, developers update the source code. This increases the reliability of the asset and the safety of its use by other market participants. In a different scenario, the cryptocurrency and the system in which it exists cannot cope with the load, transaction speed suffers, commission costs increase, and an extra load is placed on the miners. All of this adversely affects the indicators of demand for the cryptocurrency, and given that this is the only measure of its cost, a fork can become a necessary measure to help an asset maintain its position in the market.<\/p>\n<p>In fact, there are many factors that can lead to a fork. And in general, forks can be called a positive phenomenon, because they can often strengthen an asset, making it more competitive and relevant to the requirements of the market.<\/p>\n<p>So, a fork is the use of the source code of a certain software project to create a new project based upon it. A fork is possible wherever program code is used. Given that the blockchain is based upon software code, the concept of a fork is applicable to most cryptocurrency networks. This means that the rules according to which the block receives its valid status simply change.<\/p>\n<p>The mechanism of blockchain functioning is based upon confirmation of the authenticity of blocks. In any blockchain network, there are basic rules according to which blocks are considered authentic. These rules are written into the program code. They can be changed during a fork, and this will create a branch from the main chain. This is done in order to:<\/p>\n<ul>\n<li>make changes to the network (for example, to introduce new data encryption or a new mining algorithm)<\/li>\n<li>fix network bugs and flaws or increase scalability<\/li>\n<li>create a new product based upon proven technology.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2740\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model.png\" alt=\"Ethereum forks model\" width=\"1035\" height=\"643\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model.png 1035w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-132x82.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-350x217.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-500x311.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-768x477.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-1024x636.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-600x373.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-120x75.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/all-Ethereum-forks-model-300x186.png 300w\" sizes=\"(max-width: 1035px) 100vw, 1035px\" \/><\/p>\n<h3>Is It Difficult to Create a Fork?<\/h3>\n<p>Theoretically, anyone can create a fork. One only needs to copy the <a href=\"https:\/\/applicature.com\/blog\/ethereum-programming-tutorial\">source code of the Ethereum blockchain<\/a>. But the implementation of the project and its development are labor-intensive processes. First, you need to create sufficient demand for new coins; otherwise, they are useless. Second, it is necessary to solve the problem of the complexity of mining. If you remember, the level of complexity should provide a solution to the puzzle network for a certain time (10 minutes on the Bitcoin network). If the community cracks (as happened with BTC and BCH in 2017) by 90% BTC and 10% BCH, statistically, in BCH, you will need to look 10 times longer for a new block (100 minutes). Since the cost of electricity and equipment remains the same, the amount of remuneration remains in question. BCH was difficult at first, and if not for a number of political and economic factors, BCH, like 99% of all other forks, could simply disappear.<\/p>\n<p>Apart from the fact that a fork by itself is an absolutely stressful phenomenon (you need to deal with the concepts of both projects, then pull coins into your cold wallet), network attacks can also occur. Since the code is completely open, someone is constantly trying to hack it with more sophisticated methods. A development team, fighting this off, improves the code of the software product. For instance, replay attacks occur when, after a fork, someone copies\/repeats a transaction from one chain to another.<\/p>\n<p>Since you sign a transaction with your private key, which leads to a unique transaction identifier (a piece of the puzzle), a person needs to go to another chain, copy the identifier (it will remain the same), and repeat the transaction. This can happen when, after the fork, you made a transaction in one blockchain. You can protect yourself by setting anti-replay protection. This is a kind of code update, but it does not happen immediately. In the <a href=\"https:\/\/ethereumclassic.github.io\/\" target=\"_blank\" rel=\"noopener noreferrer\">Ethereum Classic<\/a> fork, it took a couple of weeks to solve the problem.<\/p>\n<p>Therefore, if a fork of your coin occurs, the most important thing is not to transfer funds anywhere. Wait until replay protection is available.<\/p>\n<h2>Ethereum Classic: The DAO Experience<\/h2>\n<p>The DAO project, launched by the <a href=\"https:\/\/slock.it\/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Slock.it<\/em> <\/a>startup on May 16, 2016, had a huge fundraising campaign. Within four weeks, they managed to raise more than $120 million. This defect in the system allowed the hacker to squander a third of The DAO’s capital by using an address that wasn’t controlled by community members.<\/p>\n<p>Let’s explore this case in more detail.<\/p>\n<p>In June 2016, one person (or a group of individuals) used the smart-contract code vulnerability of an autonomous decentralized organization: The DAO. The DAO’s task was to raise funds to finance Internet projects (IOT). Ultimately, the damage amounted to almost a third of the collected $168 million: about $50 million. The attacker adhered to the (informational) code of The DAO, and was therefore “legally” invulnerable. Since there is no central authority determining the type of action that should be taken in such a situation, The DAO miners should have made a final decision by July 14, 2016 by voting. Otherwise, this person could take his prey and harm investors. To solve the problem, Ethereum resorted to a hard fork, editing the blockchain code in order to recover the stolen money and transfer it to the legitimate owners.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2741\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/hard-fork.png\" alt=\"hard fork\" width=\"927\" height=\"336\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork.png 927w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork-132x48.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork-350x127.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork-500x181.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork-768x278.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork-600x217.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork-120x43.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/hard-fork-300x109.png 300w\" sizes=\"(max-width: 927px) 100vw, 927px\" \/><\/p>\n<p>Vitalik Buterin’s team held an Ethereum hard fork to reset the system, withdraw smart contracts related to the ICO, and return the stolen money to depositors. It was possible to return the funds, but not all users were delighted with the changes in the system. Opponents claimed that the Ethereum fork opposed the policy of decentralization. They remained on the old chain, and called it <a href=\"https:\/\/applicature.com\/blog\/ethereum-analysis\" target=\"_blank\" rel=\"noopener noreferrer\">Ethereum Classic<\/a>.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2742\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts.png\" alt=\"ethereum classic charts\" width=\"1153\" height=\"621\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts.png 1153w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-132x71.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-350x189.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-500x269.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-768x414.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-1024x552.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-600x323.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-120x65.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/ethereum-classic-charts-300x162.png 300w\" sizes=\"(max-width: 1153px) 100vw, 1153px\" \/><\/p>\n<p>The new chain kept the name Ethereum. The attack was carried out only on The DAO, and the Ethereum network was in no way affected. Still, this was enough for investors to become very skeptical about the Ether. To restore the funds, Vitalik Buterin made the decision to roll back the system until the funds were still in the account. In this way, Vitalik was able to return absolutely all of the stolen funds while making changes to the system in order to prevent future incidents.<\/p>\n<p>In traditional systems, we can assume that system weakness is concentrated mainly in management, as it either does not exist or is unreliable. This question will not even arise in non-public blockchain (consortium blockchain or private), since the security, control, and organization of rights is implemented by a central body (legal entity). This is transferred to management, which bears the entire burden of responsibility. All work of the organization will be governed by its charter and regulations.<\/p>\n<p>The DAO hacker attack experience demonstrated the need for changes in private (or exclusive) blockchain systems. As for the technology of the “usual” blockchain, if someone tries to make changes to a block, it “breaks the math” of the chain of algorithms supporting the whole set of blocks. Except for situations when participants accept the changes, the system experiences failure, leaving the blockchain in its previous form and creating a tracked confirmation of the manipulation. If a sufficient number of participants agrees on the need to make changes, then you can add a fork (as happened with Ethereum in July 2016). The branch ends where the faulty unit is located, and the other branch continues after the corrected unit. After the block has been fixed, it is necessary to restore all subsequent blocks. This can be destructive and very expensive — and, in some cases, completely impracticable.<\/p>\n<h3>Ether Zero Fork<\/h3>\n<p><a href=\"https:\/\/etherzero.org\/index.html?id=2\" target=\"_blank\" rel=\"noopener noreferrer\">Ether Zero<\/a> (ETZ) is an Ethereum hard fork that operates on a bi-level blockchain model. It has become a third type of Ethereum.<\/p>\n<p>Ether Zero is an Ethereum fork designed to interact with DApps on a daily basis. It will implement the main functions that most projects want to achieve at the moment: zero-cost commissions, instant transactions, and a blockchain with very large bandwidth. It also implements a network system at two levels. All management belongs to the network community.<\/p>\n<p>Developers started talking about the new Ethereum hard fork date release for the first time in December 2017. It was assumed that a completely new platform for smart-contract creation would be released. The platform was developed by real professionals who specialize in creating decentralized autonomous applications. Even before the coin release, networks were full of reviews that the new fork would surpass the Ethereum network in terms of its abilities.<\/p>\n<p>The new network uses the Ethereum blockchain, but, as with any Ethereum fork, it has its own characteristics:<\/p>\n<ul>\n<li>PoW node and master node structure. The PoW node is needed to synchronize data, and the master node to check ongoing transactions. The extraction of new coins in this network is performed separately from the verification of transactions.<\/li>\n<li>Autonomous community network management<\/li>\n<li>No commission for the implementation of transactions<\/li>\n<li>Instant transfers<\/li>\n<li>Instant payment function<\/li>\n<li>A large number of transactions starting at 10,000 payments per second<\/li>\n<li>Increased network scalability (higher than the Ethereum).<\/li>\n<\/ul>\n<p>What is the difference between Ether Zero and Ethereum? The basic difference is the amount of time it takes to generate new blocks. On the Ether network, a user needs 15 seconds, while the new version copes much more quickly: in 10 seconds. There are also differences in recalculating the complexity of generating new blocks. Online Ethereum recalculation of complexity occurs after the release of a new unit. In ETZ, complexity is recalculated in a dynamic way. The size of an ETZ block does not differ from its “parent” block. The block size is still 2 MB. There is also a function for protection against payment duplication.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2743\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/EtherZero-charts.png\" alt=\"EtherZero charts\" width=\"919\" height=\"609\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts.png 919w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts-132x87.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts-350x232.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts-500x331.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts-768x509.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts-600x398.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts-120x80.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-charts-300x199.png 300w\" sizes=\"(max-width: 919px) 100vw, 919px\" \/><\/p>\n<p>During its short history, the price of the ETZ coin rose above $200 only once. On the release date, the ETZ price was around $40. On January 21, in just a couple of hours, its price rose sharply to $233, and lasted 12 hours at this level. Gradually, its price began to decline. Ethereum Zero’s rate reached its absolute minimum on June 14, when the value of one coin dropped to $1.91. After that, the price began to grow smoothly. On June 19, it was already at $2.40.<\/p>\n<p>The development team has ambitious plans for their project. They want to raise the market value of their coin to 10% higher than the price of the Ether. By the end of 2019, developers want to launch Star DAPP&#8217;s long-term developer reward program to encourage them to work and contribute to the development and prosperity of the developer community.<\/p>\n<p>Ether Zero’s mining algorithm is the same as Ethereum’s. It is called the Ethash. One of the main features of this algorithm is to find a nonce-input to reach an indicator below a certain limit.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2744\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm.png\" alt=\"EtherZero ethash algorithm\" width=\"690\" height=\"648\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm.png 690w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm-117x110.png 117w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm-350x329.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm-500x470.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm-600x563.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm-120x113.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/EtherZero-ethash-algorithm-300x282.png 300w\" sizes=\"(max-width: 690px) 100vw, 690px\" \/><\/p>\n<h3>Metropolis<\/h3>\n<p>This Ethereum fork was organized in order to transfer protocol functions to a new layer of abstraction. The update is divided into two parts, called Byzantium and Constantinople.<\/p>\n<p>The main change made during the implementation of Metropolis was the emergence of new cryptography tools called zk-SNARKs. These provide the opportunity for network users to implement transactions with a much greater level of anonymity than in the previous version. It is implemented by eliminating mandatory disclosure of all data to prove work done.<\/p>\n<p>The developers decided to simplify the work with the smart contract and make it more understandable. By implementing this update, an improved security system was implemented on the network. This Ethereum hard fork consists of nine protocols designed to improve the system. The update is fully implemented without errors. This has accelerated the operation of the Ethereum blockchain.<\/p>\n<p>The next part of this Ethereum hard fork is the main innovation: a sophisticated and scalable view of the EIP 86. Some users call this fork revolutionary, as it guarantees an increase in the quality of platform protection.<\/p>\n<p>The main goal of the Metropolis Ethereum hard fork release is to transfer a number of protocol functions to an abstract layer. Instead of setting a complex set of rules at the level of the main protocol governing the creation of contracts, confirmation of transactions, mining, and other aspects of system behavior, the Ethereum protocol logic will be transferred to ETM and become a set of contracts.<\/p>\n<h3>Byzantium<\/h3>\n<p>The Byzantium upgrade was the first stage of a larger fork called Metropolis. The <a href=\"https:\/\/www.investopedia.com\/news\/what-byzantium-hard-fork-ethereum\/\" target=\"_blank\" rel=\"noopener noreferrer\">Byzantium hard fork<\/a> was an update to Ethereum’s blockchain held at block 4,370,000. This new Ethereum hard fork date was set for October 2017. It contained nine Ethereum Improvement Protocols (EIPs) created to refine Ethereum’s privacy, scalability, and safety.<\/p>\n<p>The Byzantium protocol consists of the following features:<\/p>\n<ul>\n<li>simplification of protocol code and acceleration of synchronization for main clients; increased security; upgrades for light clients by developers<\/li>\n<li>compiled and embedded contracts for operations with elliptic curves and large-integer arithmetic; simplification of application development based upon ring signatures and RSA cryptography<\/li>\n<li>a series of small changes to increase transaction speed<\/li>\n<li>postponement, but not cancellation of, the “complexity bomb” impact<\/li>\n<\/ul>\n<p>The goal of the Byzantium hard fork was to make the <a href=\"https:\/\/applicature.com\/blog\/ethereum-smart-contract-storage\">use of Ethereum and its smart contracts<\/a> more extensive and popular.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2745\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/smart-contracts.jpg\" alt=\"smart contracts\" width=\"700\" height=\"469\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/smart-contracts.jpg 700w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/smart-contracts-132x88.jpg 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/smart-contracts-350x235.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/smart-contracts-500x335.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/smart-contracts-600x402.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/smart-contracts-120x80.jpg 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/smart-contracts-300x201.jpg 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" \/><\/p>\n<h3>Constantinople<\/h3>\n<p>The Constantinople protocol will have the following features:<\/p>\n<ul>\n<li>transfer of the entire logic of confirming signatures and one-time codes from the main protocol code into contracts<\/li>\n<li>permission for developers to experiment with new signature schemes, privacy technologies, and other modifications without requiring new hard forks or support at the level of basic protocol<\/li>\n<li>reduction of the miner&#8217;s reward to 3 ETH per block, which will lead to a decrease in the emission of new coins, from 14.75% to 8% per annum<\/li>\n<\/ul>\n<p>The update and the changes it will bring to the Ethereum ecosystem will be irreversible. Its main goal is to increase the efficiency of the network and restructure the commission system. In addition, the goal of the this Ethereum hard fork is to make the Ethereum blockchain more scalable. Speaking of scalability problems, Ethereum&#8217;s key figure, Vitalik Buterin, has assured the public that sooner or later, the largest network for decentralized applications will be able to perform up to a million transactions per second.<\/p>\n<p>This Ethereum hard fork was designed to change the economy of the entire blockchain, mainly by delaying the “complexity bomb” by about 12 months. Some experts have already called it the “Ethereum Ice Age.”<\/p>\n<h3>Frontier &#8211; Homestead<\/h3>\n<p>Ethereum started the development of the next Ethereum hard fork Frontier alpha version in July 2015. It was poorly protected, which led to the immediate implementation of a new version of the protocol, called Homestead. When Ethereum moved from one version to another, the price of the coin doubled from $12 to $30. The new version of the software was implemented in block number 1,150,000. The release of Homestead included the following updates:<\/p>\n<ul>\n<li>EIP-2 &#8211; a set of changes in the rules of consensus, including an increased price of gas, limiting the maximum value of the transaction signature s-value to better protect the network from spam attacks, modifications to the mining complexity calculation algorithm, and bug fixes<\/li>\n<li>EIP-7 &#8211; implementation of a new operation: DELEGATECALL<\/li>\n<li>EIP-8 — improvement of network compatibility for future protocol changes<\/li>\n<\/ul>\n<h3>Serenity<\/h3>\n<p>As Ethereum fork moves to the Serenity version, the consensus algorithm will change from Proof of Work (PoW) to Proof of Stake (PoS). At the same time, miners will also have to move from the PoW chain to PoS. With the PoW algorithm, computers compete with each other about who will solve a complex math problem more quickly. The device that manages to solve the problem adds a new block to the network and receives a reward: for the block itself and the transactions included in it. Due to the fact that the first computer that solves the problem gets the entire award, miners are constantly increasing the power of their devices in order to outstrip competitors and sign as many blocks as possible.<\/p>\n<p>However, because of this, miners are forced to spend big money on equipment and electricity, which farms need for the extraction of cryptocurrency. The more computing power a miner has, the more energy he or she needs.<\/p>\n<p>When using the PoS consensus algorithm, validator nodes can put money on blocks that are added to the blockchain. The higher the probability of receiving money as a result of PoS mining, the greater the proportion of cryptocurrency accumulated by miners relative to other users of the system.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2746\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake.png\" alt=\"proof of work versus proof of stake\" width=\"757\" height=\"643\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake.png 757w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake-130x110.png 130w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake-350x297.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake-500x425.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake-600x510.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake-120x102.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/proof-of-work-versus-proof-of-stake-300x255.png 300w\" sizes=\"(max-width: 757px) 100vw, 757px\" \/><\/p>\n<h3>Casper<\/h3>\n<p>The main task of the Casper protocol is to switch from PoW to share distribution (PoS), which will bring a threefold increase in productivity, make it possible to further develop the network, and significantly reduce the price of gas. This Ethereum fork protocol will be implemented in two stages: first the Casper PoS\/PoW hybrid protocol, then pure Casper PoS. With full PoS, the minimum deposit of a validator in the first stage will be at least 1,000 ETH.<\/p>\n<p>Holders of a smaller number of coins will have to be pooled. This is due to the fact that the system may not cope with a large number of messages. The minimum deposit of the validator specified in the Lilac Book of 32 ETH refers to the period when 100% PoS + sharding will be implemented. It also follows from the Book that for any deposit, the remuneration ratio is the same 3\/1000000000 per second, provided that the validator always does the right thing. Consequently, the maximum annual remuneration at PoS will be (3\/1000000000) * 31536000 = 0.0946 or 9.46%. Considering the fact that over time, the processing of smart contracts will bring the main profit, emission should slow down; later, it can stop altogether.<\/p>\n<p>After the launch of this Ethereum fork, the “complexity bomb,” conceived to make mining more difficult over time, will begin to accelerate. The time needed to mine a block will increase, and, as a result, miners will receive less and less income. In the end, the network will simply become unsuitable for the work of miners, but they should not be afraid of full PoS, since, in addition to the deposit, they will also need sufficient power for EVM to work. Some projects are already planning to attract both free coins and free capacities for combining validators into full nodes.<\/p>\n<h3>Raiden and Plasma<\/h3>\n<p>Both the Raiden and Plazma protocols could become forks to create a side chain.<\/p>\n<p>The Raiden network is a decentralized payment network built on top of the Ethereum blockchain. Raiden&#8217;s payment channels allow an unlimited number of transfers to be made via two-way transfer between network members. Such transactions are carried out instantly and without involvement in the blockchain. The only thing that is recorded in the blockchain is the initial opening and closing of the payment channel when payment is complete. In addition, this Ethereum hard fork provides the ability to use a simple API to develop scalable applications with decentralized management. <a href=\"https:\/\/raiden.network\/\" target=\"_blank\" rel=\"noopener noreferrer\">Raiden<\/a> technology can also be used to pay for purchases and to exchange tokens within a network.<\/p>\n<p>Lightning Network technology has been adapted to Ethereum in the form of the Raiden protocol. The main idea behind this Ethereum hard fork was to move from a model where all transactions fall into a single public blockchain (a bottleneck of the system) to a model of private messaging between users, who are also able to transfer value.<\/p>\n<p>Raiden uses a network of p2p-channels of payments and deposits in Ethereum to keep guarantees provided by the blockchain system. Raiden is an addition to the Ethereum network. The Raiden node works in conjunction with the Ethereum node and communicates with other Raiden nodes to make payments, as well as with the Ethereum blockchain to manage deposits.<\/p>\n<p>Even if you send millions of offline transactions to the network, the commission will remain low, because only a few entries in the main blockchain are required to confirm the calculations (for example, if you send transactions once a day).<\/p>\n<p>The processing performance of operations will increase significantly, since many small transactions will now be carried out outside the blockchain, then merge into larger transactions that fall into the blockchain through Raiden. But that is not all. Lightning can also be used to scale smart contracts and change their states. This is precisely the essence of <a href=\"https:\/\/plasma.io\/plasma.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Plasma<\/a>.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2747\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages.png\" alt=\"plasma sharding stages\" width=\"741\" height=\"362\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages.png 741w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages-132x64.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages-350x171.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages-500x244.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages-600x293.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages-120x59.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/plasma-sharding-stages-300x147.png 300w\" sizes=\"(max-width: 741px) 100vw, 741px\" \/><\/p>\n<h2>Should I Invest in Cryptocurrency Forks?<\/h2>\n<p>Every investment carries a certain level of risk. Cryptocurrency forks are just as risky as any other type of investment. However, experts have identified several obvious advantages of Ethereum soft fork and hard fork:<\/p>\n<ul>\n<li>new opportunities for earnings (extracting new coins associated with a popular network is much more profitable than mining old coins, which are already mined by a huge number of users)<\/li>\n<li>a greater choice of cryptocurrencies for investment, free accrual of the equivalent amount of promising coins (for example, those with 10BTC in their account automatically received 10 BCH, 10 BTG, and so on)<\/li>\n<li>the possibility of qualitative changes, plus fixing bugs and problems that reduce the popularity of the project<\/li>\n<li>stimulating development through the creation of high competition and diversification of offers<\/li>\n<\/ul>\n<p>With that said, however, it is possible to talk about all these advantages in only one context: if a fork was created to improve the network performance.<\/p>\n<p>In fact, there are currently not many projects with such a noble goal and real plans for development. According to experts from Bloomberg, Coinomi, and other companies related to the blockchain, the majority of forks are created solely for the purpose of making quick money. However, most experts are positive about the tendency to increase the number of forks. According to them, this indicates the rapid development of the market and encourages developers to create new versions of old networks.<\/p>\n<p>Investing in forks may bring good profits. To do this you have to keep track of Ethereum hard fork date. However, we recommend considering only forks that were created to improve existing blockchain networks, not those created for money laundering. If your interest in the topic of cryptocurrency continues and you monitor the emergence and development of new assets, you will definitely hear more about forks. Any of them could affect your personal cryptocurrency assets.<\/p>\n<p>To find out more about the cryptocurrency sphere, <a href=\"https:\/\/applicature.com\/contact-us\/\">contact the Applicature team<\/a>. We would be glad to help you!    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What Is a Cryptocurrency Fork? The world of cryptocurrency is quite young, and it is constantly evolving. A striking feature of cryptocurrencies is that all transactions are recorded in the blockchain. On the one hand, this makes it possible to track all transactions and remain confident of their security. On the other, it is impossible [&hellip;]<\/p>\n","protected":false},"author":13,"featured_media":173978,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,176,194,195,255],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Ethereum Price After Hard Fork and Ethereum Soft Fork Overview<\/title>\n<meta name=\"description\" content=\"The development of the Ethereum cryptocurrency continues. Meanwhile, Applicature takes a closer look at Ethereum hard forks and soft forks.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Ethereum Hard Forks Overview\" \/>\n<meta property=\"og:description\" content=\"The development of the Ethereum cryptocurrency continues. Meanwhile, Applicature takes a closer look at Ethereum hard forks and soft forks.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-11-15T08:04:34+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T20:36:10+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Ethereum-Soft-Forks-And-Hard-Forks.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Ethereum Hard Forks Overview\" \/>\n<meta name=\"twitter:description\" content=\"The development of the Ethereum cryptocurrency continues. Meanwhile, Applicature takes a closer look at Ethereum hard forks and soft forks.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Ethereum-Soft-Forks-And-Hard-Forks.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/41.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/\",\"name\":\"Ethereum Price After Hard Fork and Ethereum Soft Fork Overview\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/#primaryimage\"},\"datePublished\":\"2018-11-15T08:04:34+00:00\",\"dateModified\":\"2022-01-11T20:36:10+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\"},\"description\":\"The development of the Ethereum cryptocurrency continues. Meanwhile, Applicature takes a closer look at Ethereum hard forks and soft forks.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-fork\/\",\"name\":\"Ethereum Hard Forks Explained\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\",\"name\":\"Victoria Melnychuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/g12-scaled.jpg\",\"caption\":\"Victoria Melnychuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2735"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2735"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2735\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173978"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2735"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2735"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2735"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}