{"id":2759,"date":"2018-11-20T14:14:20","date_gmt":"2018-11-20T14:14:20","guid":{"rendered":"https:\/\/applicature.com\/?p=2759"},"modified":"2019-08-05T12:55:11","modified_gmt":"2019-08-05T12:55:11","slug":"is-your-bitcoin-a-scam","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam","title":{"rendered":"Is Your Bitcoin a Scam?"},"content":{"rendered":"<p>The history of the ’90s is repeating again. Silicon Valley venture capitalists and New York City investment bankers are encouraging people all over the world to invest in a new financial miracle. Small-time investors like our grandparents invested their black-day savings in companies like Pets.com, Webvan, and eToys. Then the bubble burst, and they lost everything. Main Street to Wall Street, VCs, unscrupulous CEOs, and bankers effectively enriched themselves at the expense of millions of ordinary investors, leaving them with nothing.<\/p>\n<p>Is Bitcoin going to do the same thing to us in 2018? Some people believe that Bitcoin is a gift from God, but others call it the devil&#8217;s curse. Some are happy with it for raising them millions of dollars, while others are crying about losing the last money they had in their pocket.<br \/>\nWhose opinion is right? Let’s reveal the truth together.<\/p>\n<p>Undoubtedly, the cryptocurrency market is speculative, complex, and involves significant risks. Moreover, it is highly volatile and sensitive to secondary activity. Everyday scam attempts, virus and malware downloads, Ponzi schemes, fake and imitation wallets and exchanges &#8211; all of this is commonly experienced by most users on the blockchain network.<\/p>\n<p>More freedom in the cryptocurrency market also gave more freedom to hackers and increased the rate of fraudulent activity as a result. Everything became more complicated.<\/p>\n<p>Even with its numerous advantages, the crypto market is one of the most vulnerable to criminal activity, as it usually takes advantage of people’s trust and unwitting negligence. It is not regulated enough to protect people from scams that make digital currencies an arena for fraud.<\/p>\n<p>Why is Bitcoin so interesting to scammers? We have several reasons for this:<\/p>\n<ol>\n<li>Not many people know about Bitcoin, and few are fully aware of its features and opportunities. That’s why it is quite easy to cheat people, as everything a scammer says or promises may look true.<\/li>\n<li>Everyone executes his\/her transactions anonymously, which makes tracing the owner or buyer of the transaction very difficult.<\/li>\n<li>The cryptocurrency market is unregulated, and there are still a lot of issues to consider. Scammers have a variety of ways to run their fraudulent schemes and steal someone’s Bitcoins without breaking the law.<\/li>\n<li>Fortunately, most of the same rules apply. A bit of common sense will keep you safe from most scams, and a bit of know-how can keep you safe from bad actors looking to scam you.<\/li>\n<\/ol>\n<p>Let’s discover the most commonly observed Bitcoin scams so you can avoid losing your Bitcoins. Find out how to protect your funds and how you should act if you find yourself trapped in the nets of scammers.<\/p>\n<h2>Blackmailing<\/h2>\n<p>Gentlemen, have you ever received intimidating emails or messages like this:<\/p>\n<blockquote><p>I know about your mistress and all other secrets you keep from your wife. If you don’t want your wife to find out about all that, send me a $10,000 confidentiality fee in Bitcoin.<\/p><\/blockquote>\n<p>Ladies, have you ever gotten awful emails with the following statement?<\/p>\n<blockquote><p>I have all your pictures and I am going to make pornographic videos and posters using your face. But you can stop me by paying $10,000 in Bitcoin.<\/p><\/blockquote>\n<p>In many cases, somebody may demand your Bitcoin in exchange for your life, private information, pornographic photos, or secret relations.<\/p>\n<p>The Bitcoin owner receives an email in which someone states that he or she has hacked into your computer and is operating it via remote desktop protocol (RDP). For example, he or she has installed a keylogger and recorded all your actions, perhaps illegal or secret in nature, via webcam. You are provided with two options:<\/p>\n<ol>\n<li>Send a predefined sum in Bitcoin to avoid spreading the information<\/li>\n<li>Fail to follow the hacker’s instructions and become a Youtube star<\/li>\n<\/ol>\n<p>People are threatened, intimidated, and pressured. Mostly, they are afraid, and do not realize that this is just a fraudulent scheme, so they do all that is written in the emails.<\/p>\n<p>How does this work?<br \/>\nIt is implemented not by a human being generating the messages, but by a computer. Like a robot, it sends out the same message to millions of computers. Mostly, such scams are run from abroad.<\/p>\n<p>Scammers mask their IP addresses to avoid identifying their computers. By the way, the FBI does not have the power to extradite these criminals, as their native countries do not allow it. In addition, if you do not lose any actual property, the law won’t be able to protect you.<\/p>\n<p>That’s why you should take care of yourself. To protect your funds, check out the validity of the email address from which you have received a strange email. If it is unfamiliar to you, do not open it before confirming its authenticity, because hackers can attack your computer as a result of you simply opening their email.<\/p>\n<p>As a rule, scammers offer to download a link or a program to your computer from an illegitimate website. By downloading these programs and links, you also download Trojan Horses and viruses through which criminals can access your computer.<\/p>\n<p>You should also check out the website address in your browser before performing operations with it or implementing transactions.<br \/>\nIf you get an email like this, report it immediately to your local police and the FBI. Scammers steal users’ personal data to run this type of scheme on thousands of people with the aim of separating them from their money.<\/p>\n<h2>Fake ICOs<\/h2>\n<p>One of the most effective ways scammers use to get at your cryptocoins is fake ICOs. Scam ICOs are one of today’s biggest problems for investors, as they lose a lot of money when they get trapped in the nets of scammers.<\/p>\n<p>Investors expect a return when making an investment in an ICO. This can be compared to a company’s Initial Public Offering (IPO). An ICO differs from an IPO in that the coin has no value until people start seeing value in it and believe it is worth investing in.<\/p>\n<p>Observe how many ICOs were launched every month in 2017-18:<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2761 aligncenter\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Monthly-ICO-number.png\" alt=\"Monthly ICO number\" width=\"600\" height=\"371\" \/>This number is spectaculative, but how can we find out whether an ICO is a scam or not? Read this <a href=\"https:\/\/applicature.com\/blog\/how-to-identify-scam-icos\">article<\/a> to become aware of all the hacks that directly indicate scam ICOs.<\/p>\n<p>Fake ICOs invite people to invest in their coin. The scammers promise them big rewards and a lot of opportunities, but they get nothing as a result. A lot of people buy into it, and then someone runs off with all the investors’ money.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-2762 aligncenter\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Listed-coins1.png\" alt=\"Listed coins\" width=\"730\" height=\"444\" \/>Another interesting fact that all investors should remember is that 90–95% of ICOs won’t have any value in 3 years, regardless of whether it is a scam or not.<\/p>\n<p>[table id=12 \/]<\/p>\n<p>At first, it might look as though the ICO is actually real. The numbers increase as promised, and someone might even come out to talk about “how it really works” and how it has changed their life.<\/p>\n<p>But when you actually try to get your money, you might face some problems with customer service. One day, the company just disappears&#8230;along with your money.<\/p>\n<p>Beware of too-good-to-be-true offers. Think about whether the promised returns are really sustainable, and what the numbers actually mean. If it seems too good to be true, it probably is. Analyze in detail all available information about a company in order to draw the right conclusion for further cooperation.<\/p>\n<p>If you need a professional consultation, contact the<span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/\"> Applicature team<\/a> <\/span>to be sure that you are investing only in real ICOs.<\/p>\n<h2>Fake Exchanges<\/h2>\n<p>Coin exchanges are special platforms where people can buy and sell their Bitcoin and other cryptocurrencies in exchange for fiat currencies or altcoins. The most popular exchanges are <strong>Bitstamp, Bitfinex,<\/strong> and <strong>Coinbase<\/strong>.  As the cryptocurrency field is constantly developing, all exchanges are relative newcomers. That’s why it is quite difficult to find one worth trusting.<\/p>\n<p>However, even the most reputable exchanges experience a lot of fraud cases. As a result, people have lost a lot of money.<br \/>\nBitcoin is becoming more popular every single day, so more and more people are buying it. Unfortunately, dishonest people take advantage of the constantly growing interest in Bitcoin and set up fake Bitcoin exchanges. They offer extremely competitive market prices and allegedly help people get quick and easy access to cheap Bitcoin. That’s why you should conduct your own research on the exchange where you are going to buy or sell your Bitcoin.<\/p>\n<h3>eBay<\/h3>\n<p>The Bitcoin price on eBay could be nearly 50% higher than the average market price. If the current Bitcoin price is around $600, on eBay, it will cost $800. On the one hand, this is a great opportunity to buy Bitcoin on an exchange and sell it on eBay, and make a profit of 40%. On the other, the practice shows that the only free cheese is in the mousetrap, and this is something we either do not see or do not want to see.<\/p>\n<p>The scheme runs as follows:<\/p>\n<ol>\n<li>The owner places his or her Bitcoin for sale.<\/li>\n<li>The scammer buys it.<\/li>\n<li>The owner sends the Bitcoin to the scammer.<\/li>\n<li>The scammer marks the transaction as authorized.<\/li>\n<li>PayPal asks the owner for the tracking number of the Bitcoin.<\/li>\n<li>The owner provides them with the Bitcoin TXID and the buyer’s confirmation of the transaction.<\/li>\n<li>PayPal ignores this evidence for the following reasons:<\/li>\n<\/ol>\n<ul>\n<li>The unauthorized transaction is not proven, so you keep the money and the transaction is successful.<\/li>\n<li>PayPal defines the transaction as an unauthorized one and returns money to the scammer, who now has his or her own money and the owner’s Bitcoin. Additionally, the owner gets a negative feedback rating.<\/li>\n<\/ul>\n<p>Do not worry. There is a solution for how to cheat the cheater:<\/p>\n<ol>\n<li>The owner posts his or her bitcoin for sale.<\/li>\n<li>The scammer buys it and sends money to the owner’s PayPal.<\/li>\n<li>The owner creates a backup of his or her Bitcoin wallet. Then, he or she sends Bitcoin to the scammer with zero fee on any business day.<\/li>\n<li>The zero-fee transaction is stuck in pools waiting for confirmation, which can take a couple of days.<\/li>\n<li>The scammer receives an unauthorized transaction dispute.<\/li>\n<li>If the transaction is still not confirmed, the PayPal transaction won’t be authorized, and the scammer won’t get the owner’s Bitcoin.<\/li>\n<li>The owner should check the wallet outputs used for the payment to the scammer and recover a backup of the transaction.<\/li>\n<li>Then, the owner can return the Bitcoin by sending it to his or her own wallet, or any other trusted wallet. Do not be greedy about the fees, as your Bitcoin is directly dependent upon the success of this transaction.<\/li>\n<li>The owner is happy, as he or she has implemented all steps to protect his or her funds, time, and nerves.<\/li>\n<\/ol>\n<p>Let’s check out a list of well-known and reliable exchanges that were hacked by scammers:<\/p>\n<ul>\n<li>Igot<strong> (now <\/strong>Bitlio<strong>)<\/strong> is widely known for its shady operations. Users complained that this exchange did not give withdrawals.<\/li>\n<li>The Japanese exchange <strong>Mt. Gox<\/strong> became the victim of a massive hack in 2014. It lost of around 650,000 Bitcoins, and filed for bankruptcy immediately after the announcement. More than 24,000 customers lost access to their Bitcoin, and, as a result, everything they had.<\/li>\n<li>Another Japanese exchange, <strong>Coincheck<\/strong>, got trapped in a hackers’ scheme. The company lost about 500 million NEM tokens.<\/li>\n<li><strong>EtherDelta<\/strong> was hacked, and its website was taken over by a fake version. There were at least 308 Ether tokens stolen.<\/li>\n<li>The loss at <strong>Bitfloor<\/strong> was 24,000 Bitcoins; <strong>Bitstamp<\/strong>, 19,000 Bitcoins; and <strong>Bitfinex<\/strong>, 120,000 Bitcoins.<\/li>\n<\/ul>\n<p>Exchanges like Bittrex and Yobit invited their users to join the so-called “pump and dump” schemes: for example, five coins in just two weeks. Bittrex announced that Telegram groups like Crypto4pumps and Bigcryptopumps used private Telegram apps to facilitate their scam schemes. Bittrex lists more than 300 different coins and tokens, so be careful, as some of them can be easily manipulated.<\/p>\n<p>Check whether the seller’s rating is good, whether he or she is really the owner of the account claiming to have this good rating, whether he or she has a history of selling items, and whether they have a feedback history related to selling.<\/p>\n<h2>Scam Mining Companies<\/h2>\n<p>Mining is the process of verification and release of new Bitcoin into the network. People who perform mining are <em><strong>miners<\/strong><\/em>. For their work, they receive newly-released Bitcoin as a reward.<\/p>\n<p>Today, mining requires a lot of computational power and energy resources; therefore, mining is a difficult task for the average person. It is better to invest in large mining companies or use cloud mining services in order to get better and faster results.<\/p>\n<p>One can find different companies in the mining industry, both reliable and fraudulent. Mining is a hot commodity for thieves to get their hands on. Understand that even companies with a great reputation might be involved in the scams. Remember that there are a lot of people who are willing to cash in on the basis of user trust.<\/p>\n<p>For example, the U.S. mining company Mining Max raised around $250 million from investors, while only around $70 million were actually spent on the mining operation.<\/p>\n<p>There is also a lot of malicious crypto-mining or “cryptojacking,” in which scammers use the user’s computational power for malware purposes. They can spread these programs by Trojan virus, for example.<\/p>\n<p>Digmine malware for mining Monero (a private alternative to Bitcoin) is spread through the desktop version of Facebook Messenger within the Chrome browser while being stored as a video file on a computer.<\/p>\n<p>WannaMine can injure a computer system through a clickable link or targeted remote access. It is quite difficult to detect this file on a computer since it’s fileless. Moreover, it takes only a few days to make the computer inoperable.<\/p>\n<h2>Free Giveaways<\/h2>\n<p>People are naive and still believe in a fairy tale with a happy ending. Unfortunately, scammers take advantage of people’s bling faith in manna from heaven and offer free giveaways of Bitcoin or other digital currencies in exchange for sending a small amount to a register, or by providing some personal information.<\/p>\n<p>However, such promises never turn into reality. In this way, scammers try to grab the user’s coins. Stop believing in miracles, as this business needs your objectivity.<\/p>\n<p>If someone asks you to transfer some Bitcoin to his or her wallet in exchange for a guaranteed return, <strong>DO NOT AGREE!<\/strong> This scheme is a well-known ploy to find easy money to pay previous investors. As a result, you could lose your own.<\/p>\n<p>If you are asked to supply your private information, like name, address, email, and phone number in order to claim a prize, <strong>DO NOT AGREE.<\/strong><\/p>\n<p>With this information, the hacker can access your accounts by impersonating you.<br \/>\nReport this email as fraudulent, so others don&#8217;t fall victim.<\/p>\n<h2>Impersonation<\/h2>\n<p>Unfortunately, con artists can easily impersonate people. They create fake accounts on social networks that are very similar to the original, publish scam content, and even put out calls to action like free giveaways. Everything seems very natural, so people do not suspect scam attempts.<\/p>\n<p>Scammers also trick people by writing messages on behalf of that person in an attempt to defraud or compromise them.<\/p>\n<p>Do not participate in free giveaways or answer messages from someone unfamiliar to you. You can double-check the authenticity of their account via multiple mediums of communication.<\/p>\n<h2>Malware Programs<\/h2>\n<p>The Internet era brought a lot of viruses, malware, and other fraudulent programs into society. When it comes to planning new tricks, hackers’ creativity is endless. For example, there are some malware programs that can change the address of a transaction you are willing to conduct. That’s why it’s important to remember to check the address you are going to transfer your Bitcoin to, because you could be sending it directly to hackers. If the network confirms the transaction, there is no way to change the data.<\/p>\n<p>The Cryptoshuffler is well known for invading computers and then sitting almost invisibly in the background until the right time.<br \/>\nWhen a user types some characters and digits that look like a cryptocurrency wallet address, this virus starts to act. It replaces that address with the Cryptoshuffler’s own wallet address. If a user does not see the wrong address while confirming the transaction, all Bitcoins are transferred directly to the hacker’s wallet instead of the true buyer. As of November 2017, about 23 Bitcoins (over $180,000) have been sent to the Cryptoshuffler wallet address.<\/p>\n<p>Do not forget to check whether some programs installed on your computer have administrative rights. In this situation, a reputable virus scanner can be very helpful.<\/p>\n<p>These tips can also give you the upper hand over malware:<\/p>\n<ul>\n<li>constantly use two-factor authentication<\/li>\n<li>have a “cold” offline wallet. A cold wallet is believed to be the most secure for storing Bitcoin, as it is detached from an internet connection. This means that it is impossible to hack it remotely. A “hot” wallet provides less protection, as it is internet-dependent. That means that this type of wallet is available to everyone with an internet connection.<\/li>\n<\/ul>\n<h2>Meeting in Person<\/h2>\n<p>Today, more and more hackers are asking to meet owners of Bitcoin in person to conduct exchanges. If you do not know this person, meeting him or her could be very risky because the scammer could rob or injure you. Also, the scammer could pay for the purchase with counterfeit fiat currency. Use a peer-to-peer platform to escrow money instead of meeting in person.<\/p>\n<h2>Phishing<\/h2>\n<p><strong>NEVER<\/strong> agree to provide your password or click to provide some sort of interaction with regard to your account. Also, do not reply to emails from strangers who ask you to help them by sending coins, even if they offer a portion of the funds for this service.<\/p>\n<p>It’s really very difficult to distinguish some emails from the real thing. Meanwhile, the hacker is trying to entice you to compromise your account. When in doubt, resend this email to your company in order to find out whether it is real or not.<\/p>\n<p>Do not install software or log into a website if you’re not totally sure it is real. Phishing websites can present themselves as sponsors of the company you use. It is highly recommended to verify that you are downloading a real app.<\/p>\n<h2>Pyramid Schemes<\/h2>\n<p>Most companies that have raised millions of dollars are built on the principle of the financial pyramid. A pyramid scheme promises that all participants will be granted a special reward, depending on the number of people they invite to join the company. The scam cryptocurrency market uses this, too. As a rule, it doesn&#8217;t work at all. The scammers are the only people who have the advantage in such a pyramid, not members or those who have joined.<\/p>\n<p>Do not invite your friends to suspicious businesses in order to get some kind of reward, and do not invest your own capital, as these projects are definitely scams.<\/p>\n<h2>How to Protect Your Bitcoin?<\/h2>\n<p>Having discovered the most common scams involving Bitcoin and other cryptocurrencies, we have to understand that they are not always run by beginners. Some of these scams are really well-thought-out and executed. This means that anyone is vulnerable and anyone can be scammed, even people who are professional and experienced in blockchain technology.<\/p>\n<p>Even Apple co-founder Steve Wozniak became the victim of a Bitcoin scam. He was willing to sell seven Bitcoins to a buyer who used a stolen credit card. The scammers got both the money and the Bitcoins.<\/p>\n<p>The verdict is as follows: scams can happen even to professionals. Moreover, this is just the beginning, and there will be new (and likely more advanced) scams soon. We have to be fully prepared for this and remain alert.<\/p>\n<p>It does not matter if you want to make an investment in Bitcoin or just hold onto some for now. Ensure the complete security of your wallet, and keep your funds safe and secure.<\/p>\n<p>Consider these tips to avoid being scammed and losing funds:<\/p>\n<ul>\n<li>Protect your private keys.<\/li>\n<\/ul>\n<p>Remember that if somebody has access to your private keys, he or she can control your Bitcoin. Protect your private keys with the utmost care. If you use third-party wallets, you are forced to provide them with your keys. That’s why you should choose only the most reliable companies.<\/p>\n<ul>\n<li>Conduct your own deep research before making a decision.<\/li>\n<\/ul>\n<p>Experience has shown that if you have been scammed, someone was cheated before you. Learn all reviews about any services you want to use, and stay aware of all possible risks and results. Remember that anything that has happened to someone else can happen to you, as well.<\/p>\n<p>Consider all reputable review sites and forums to see whether there is something strange about them.<\/p>\n<ul>\n<li>Pay attention to the common warning signs.<\/li>\n<\/ul>\n<p>Yes, scammers use the best marketing techniques in order to attract as much attention to their projects as possible. However, spelling and grammatical mistakes, too little information, and a fake social media presence are all red flags that should be taken into account.<\/p>\n<ul>\n<li>No one needs to know the number of Bitcoins you hold.<\/li>\n<\/ul>\n<p>This is especially essential if you have a large amount of Bitcoin. Do not present yourself as a big fish to be caught.<\/p>\n<ul>\n<li>Use a VPN.<\/li>\n<\/ul>\n<p>With a Virtual Private Network (VPN), you can use the Internet privately so nobody, not even your ISP, can trace your activity, find out which exchanges and types of wallets do you use, and where you store private information and private keys.<\/p>\n<p>Do not use public wifi networks to run your accounts, as they can be easily used to steal your info or co-opt your computer for mining. A VPN is one more essential tool to secure your wifi connection.<\/p>\n<ul>\n<li>Never stop learning more.<\/li>\n<\/ul>\n<p>It is no secret that only a few people read the instructions to the devices they buy. It is the same with Bitcoin. If you want to run cryptocurrencies, be always in the know, because one of the main reasons for the investor failure is lack of knowledge of the cryptocurrency market. Another reason is acting according to social media tips or reading price spikes as signs to get in. Never stop learning, observing, and listening unless you want to be one more person jumping in the cauldron of money loss and stress.<\/p>\n<ul>\n<li>Trust your gut instinct.<\/li>\n<\/ul>\n<p>If you feel that something is not true and could cause financial loss, do not participate in it.<\/p>\n<p>If something is too good to be true, it probably won’t work at all.<\/p>\n<p>If something sounds like a pyramid scheme, even a well-developed pyramid scheme, even if others are investing in it and are enriched, that does not mean it will happen for you, too.<\/p>\n<p>If something works for one person, that does not mean it will definitely work for you, too.<\/p>\n<h2>Conclusion<\/h2>\n<p>After a long journey around the scam cryptocurrency market, we have discovered which types of scams are the most popular today, and which could happen to you.<\/p>\n<p>You have to understand that all you have read on the Internet could turn into your reality, as well. The safety of your Bitcoin depends on your awareness and caution, so ensure your safety in order to sleep peacefully at night and be sure that your Bitcoin is secure.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The history of the ’90s is repeating again. Silicon Valley venture capitalists and New York City investment bankers are encouraging people all over the world to invest in a new financial miracle. Small-time investors like our grandparents invested their black-day savings in companies like Pets.com, Webvan, and eToys. Then the bubble burst, and they lost [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":4504,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[133],"tags":[154,173,176,215,280],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"Bitcoin fraud is one of the biggest problems in today’s cryptocurrency community. Let’s consider the Bitcoin scams list in order to be aware of what to expect from scammers.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"Bitcoin fraud is one of the biggest problems in today’s cryptocurrency community. Let’s consider the Bitcoin scams list in order to be aware of what to expect from scammers.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-11-20T14:14:20+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-05T12:55:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Is-Your-Bitcoin-a-Scam_.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"538\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Is-Your-Bitcoin-a-Scam_.jpg\",\"width\":1024,\"height\":538,\"caption\":\"bitcoin\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/#primaryimage\"},\"datePublished\":\"2018-11-20T14:14:20+00:00\",\"dateModified\":\"2019-08-05T12:55:11+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"Bitcoin fraud is one of the biggest problems in today\\u2019s cryptocurrency community. Let\\u2019s consider the Bitcoin scams list in order to be aware of what to expect from scammers.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/\",\"url\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/is-your-bitcoin-a-scam\/\",\"name\":\"Is Your Bitcoin a Scam?\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2759"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=2759"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/2759\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/4504"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=2759"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=2759"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=2759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}