{"id":3014,"date":"2018-11-23T15:04:56","date_gmt":"2018-11-23T15:04:56","guid":{"rendered":"https:\/\/applicature.com\/?p=3014"},"modified":"2022-01-11T20:33:09","modified_gmt":"2022-01-11T20:33:09","slug":"scaling-bitcoin-is-lightning-network-a-game-changer","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer","title":{"rendered":"Scaling Bitcoin: Is Lightning Network a Game Changer?"},"content":{"rendered":"<p>Blockchain was designed as a platform for secure, transparent money transfers. Over time, it has become a technology that offers much more than just transactions. It has become a framework for creating indispensable solutions for the market, such as decentralized applications for supply chains, banking services, etc.<\/p>\n<p>Even blockchain technology may not be able to reach perfection, but it can decelerate transactions through scalability.<\/p>\n<h2>The Scalability Issue<\/h2>\n<p>Cryptocurrency, successful from the moment of its creation, ended up booming in 2017. With the addition of the benefits that blockchain offers to businesses, more and more users began to join, and its disadvantages became more visible. In the two most popular networks, Bitcoin and Ethereum, users can store data in blocks that are limited to 1MB (on Bitcoin), while on Ethereum, the only limitation is the gas fee. One more significant difference is the frequency of block executions. <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/bitcoin-transactions\" target=\"_blank\" rel=\"noopener noreferrer\">Bitcoin<\/a><\/span> allows one block per ten minutes, but on Ethereum, the number averages between ten and thirty transactions per second.<\/p>\n<p>The low capacity level of both networks remains an unsolved issue in the crypto community.<\/p>\n<h3>Will Capacity Increase Work?<\/h3>\n<p>Increasing the capacity of a block is not an innovative idea, and three years have been dedicated to discussions on block increases of 2, 4, and even 8MB. This led to the appearance of soft and hard forks such as Bitcoin Cash, SegWit, and SegWit2x.<\/p>\n<h3>Soft Fork vs. Hard Fork<\/h3>\n<p>In order to obtain a fundamental understanding of the recent situation in the blockchain community, let’s sort out the algorithm of soft and hard forks.<\/p>\n<p>Nodes have software which they update from time to time. When a user uploads a block that opposes the platform’s characteristics or doesn’t refer to the existing consensus on the network (in case of hard forks), the nodes that updated to a new version automatically verify a new block. This means that there are new characteristics in the block — ones previous blocks didn’t have. However, the nodes that didn’t update or declined the new software version are separated from the new network (hard fork), and continue working on the previous version of the network.<\/p>\n<p>The most popular example of the hard fork is Bitcoin Cash, which separated from the Bitcoin network on August 1, 2017.<\/p>\n<p>Unlike hard forks, soft forks don’t cause network forks. When a soft fork occurs, it means that the characteristics that the previous blocks had do not appear in the next ones. On top of that, the transactions conducted before don’t contradict the new ones. To put it simply, users who accept the new block update the software, and those who don’t decline it. However, this doesn’t mean that a new network will appear.<\/p>\n<h3>Bitcoin Cash<\/h3>\n<p>In May 2017, the number of users who complained about transaction time peaked, which led to the unyielding need to speed up the network.<\/p>\n<p>One of the first and the most popular hard forks of Bitcoin was BitcoinCash, which aimed to increase the size of one block from one to eight megabytes. This solution meant elimination of the problems of transaction time and high fees for speeding up the network. The community of miners actively supported the solution due to the growth that became possible owing to the increase in total block commission, even in case of the drop in transaction fees. However, developers opposed the implementation of BitcoinCash, since 1MB deregulation leads to demand for more computational power. This has a killing impact on small businesses, and makes them exit the network.<\/p>\n<p><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.bitcoincash.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">BitcoinCash<\/a><\/span> is said to be faster than Bitcoin, but the issue of stability remains. Additionally, BitcoinCash opposites the main blockchain feature, decentralization, as small businesses cannot afford to use it.<\/p>\n<h3>Segregated Witness<\/h3>\n<p>The Bitcoin community has become concerned over the past few years by discussions about scalability issues and solutions.<\/p>\n<p>In 2017, <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.investopedia.com\/terms\/s\/segwit-segregated-witness.asp\" target=\"_blank\" rel=\"noopener noreferrer\">Segregated Witness<\/a><\/span> made headlines in much of the crypto media. It had two solutions up its sleeve:<\/p>\n<h4>SegWit<\/h4>\n<p>Segwit is a Segregated Witness soft fork aimed to reduce the size of transaction in a block by means of moving the signature to the end of the transaction code, which would significantly speed up the network.<\/p>\n<p>SegWit’s aim was to solve the <a href=\"https:\/\/en.bitcoin.it\/wiki\/Transaction_malleability\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">transaction malleability<\/span><\/a> issue, which allows a slight adjustment in transaction data and results in a unique ID change. Furthermore, the entities conducting the transactions couldn’t be sure if the ID of their transaction would remain the same after it passed the verification and mining process.<\/p>\n<p>The solution allowed expansion of the block size up to 2MB. With the SegWit solution, the Bitcoin network becomes secure enough to develop such tools as <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/lightning.network\/\" target=\"_blank\" rel=\"noopener noreferrer\">Lightning Bitcoin Network<\/a><\/span> in order to make transactions significantly cheaper and faster.<\/p>\n<h4>SegWit2x<\/h4>\n<p>Presented in November 2016, SegWit caused a flurry of criticism and discussions about which block size would most benefit the network.<\/p>\n<p>After the <a href=\"https:\/\/medium.com\/@DCGco\/bitcoin-scaling-agreement-at-consensus-2017-133521fe9a77\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">New York Agreement<\/span><\/a>, SegWit2x came out in May 2017 as an alternative to SegWit to resolve the disagreement between users and the core developers of the Bitcoin network.<\/p>\n<p>The main difference between SegWit2x and SegWit was that the block size was meant to be increased up to 4MB, along with potential additions in terms of the Lightning Network structure, online codes, anonymity, zk-SNARKs technology, and smart-contract use. However, in November 2017, several days before its release, there was an announcement of its cancellation.<\/p>\n<p>Fortunately for the Bitcoin network, there is a solution that offers not only a resolution to the scalability issue, but also cheaper transaction fees.<\/p>\n<h2>The Scalability Solution<\/h2>\n<p>Bitcoin Cash, Bitcoin Unlimited, SegWit, SegWit2x — all of these Bitcoin forks were created with the goal of solving scalability issue. However, not all of them have succeeded due to problems such as malleability and centralization.<\/p>\n<p>One of the most long-awaited solutions in the market is the Bitcoin Lightning Network, which <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/\">Applicature<\/a><\/span> is happy to explain below.<\/p>\n<p>Bitcoin Lightning is built on top of the network, allowing users to conduct <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/bitcoin-transaction\" target=\"_blank\" rel=\"noopener noreferrer\">Bitcoin transactions<\/a><\/span> much faster and more cheaply. Compared with the sky-high block transaction fee on Bitcoin in December of over $35 U.S.,(capture 1) and the current Bitcoin transaction fee of less than one U.S dollar (capture 2), Bitcoin Lightning still offers a cheaper solution.<\/p>\n<p>Let’s consider this table of Bitcoin transaction fees for the next block (second column), three blocks (the third column), and six blocks (the fourth column):<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2757 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1.png\" alt=\"Bitcoin transaction fee\" width=\"963\" height=\"186\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1.png 963w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1-132x25.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1-350x68.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1-500x97.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1-768x148.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1-600x116.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1-120x23.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-transaction-fee-1-1-300x58.png 300w\" sizes=\"(max-width: 963px) 100vw, 963px\" \/><\/p>\n<p>However, the current transaction fee on the Bitcoin network appears to be much cheaper:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2758 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1.png\" alt=\"current bitcoin transaction fee\" width=\"963\" height=\"148\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1.png 963w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1-132x20.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1-350x54.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1-500x77.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1-768x118.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1-600x92.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1-120x18.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/current-bitcoin-transaction-fee-1-300x46.png 300w\" sizes=\"(max-width: 963px) 100vw, 963px\" \/><\/p>\n<p>Even more important, however, is Bitcoin transaction time. Currently, one Bitcoin block confirmation takes users around ten minutes. Considering the number of transactions being conducted on the network each second, there are lines of blocks awaiting confirmation. This was the main reason for the user complaints that led to Bitcoin Cash and SegWit2x hard-fork formation.<\/p>\n<p>The Lightning Network for Bitcoin transactions is a system that opens the opportunity to conduct transactions in milliseconds, thanks to the payment channels that users build between themselves to transfer money.<\/p>\n<h2>Bitcoin Lightning Network<\/h2>\n<p>Elizabeth Stark, CEO of Lightning Labs, announced March 15, 2018, as the Bitcoin Lightning Network release date. The number of users adopting the network increased by 15 percent monthly between April and August.<\/p>\n<p>On the Lightning Network, it is not necessary to open a direct channel between nodes that have financial relations. The nodes build a network with nodes that have already created a channel, forming a net. Currently, you can view a visualization of the Lightning Network <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/1ml.com\/visual\/network\">here<\/a><\/span>.<\/p>\n<p>The statistics about Bitcoin Lightning show that the current capacity of the network is about 107 BTC, or $685 U.S.:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2724 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity.jpeg\" alt=\"Bitcoin Lightning Capacity\" width=\"1024\" height=\"400\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity.jpeg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity-132x52.jpeg 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity-350x137.jpeg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity-500x195.jpeg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity-768x300.jpeg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity-600x234.jpeg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity-120x47.jpeg 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Bitcoin-Lightning-Capacity-300x117.jpeg 300w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>With regard to Bitcoin Lightning’s status, at the moment of this writing, there were 3,951 nodes and 11,283 channels on the network.<\/p>\n<h2>How to Use Bitcoin Lightning Network<\/h2>\n<p>As Lightning is a network of channels, <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/\">Applicature<\/a><\/span> is providing a full guide on how to open, operate, and close a channel on Bitcoin Lightning. Before you learn how to use the network, it is essential to become acquainted with the details described in the following paragraphs.<\/p>\n<h3>Unconfirmed Transactions<\/h3>\n<p>Bitcoin consists of a set of transactions, each referring to the previous one, including its hash (unique ID) for the transaction data. Each transaction has the lines “from” and “to” that refer to the wallets of a sender and a recipient. The sender should meet the requirements by confirming that he\/she actually possesses the money he is sending. Otherwise, the system won’t recognize the transaction as valid. The recipient, which is the “to” line (and eventually the “from” line in the next transaction) will have to include new requirements.<\/p>\n<p>It is important to mention that transactions conducted in the Lightning Network are not uploaded on the blockchain; local nodes store them. However, nodes can decide to send the transactions to the network.<\/p>\n<p>&nbsp;<\/p>\n<p>According to the graphic above, the black transaction is already confirmed. The blue one can be sent to the network by the node A if the previous transaction has been confirmed. The red one can be sent to the network by node B under the same conditions. Node A can sign and send the unconfirmed transaction to the network having sent two BTC to node B, and only after this will node B be able to sign and send his\/her transaction to node C.<\/p>\n<h3>Double-Spending Prevention<\/h3>\n<p>The idea of double-spending is simple. Let’s consider a real-life example. When you buy a cup of coffee and pay five dollars for it, you cannot pay the same five dollars for other purchase, unless you steal it.<\/p>\n<p>A double-spending prevention approach is crucial to financial fraud elimination on the blockchain.<\/p>\n<p>It works as follows: if two senders refer to one recipient, only one of two transactions will be verified by the miners.<\/p>\n<p>&nbsp;<\/p>\n<p>Here, node A faces a choice between two transactions in order for them not to run into a conflict. Only one of the transactions marked in blue may be verified as valid.<\/p>\n<h3>Multi-Signature<\/h3>\n<p>Conducting a money transfer on Bitcoin Lightning usually requires two signatures. When two users open a channel between one other, the transaction will be verified by two nodes: the sender and the receiver.<\/p>\n<p>Let’s see how it works in practice:<\/p>\n<p>&nbsp;<\/p>\n<p>If node A wants to send two BTCs to node B, he\/she will only be able to do so after self-signature and the signature of node B. A cryptographic signature on the blockchain (a private key) is a unique set of numbers. As soon as the transaction is multi-signed, node B receives the money. It’s important to keep in mind that whenever a transaction is signed by both nodes, it is impossible to change or delete it.<\/p>\n<p>Multisig is an approach that makes any fraudulent action within the channel impossible, as node A cannot spend Bitcoin without node B being aware of the transaction.<\/p>\n<h3>Timelock<\/h3>\n<p>One more element on the Bitcoin Lightning network is the time lock, which allows blocking Bitcoins until a certain time. There are two types of timelocks:<\/p>\n<ul>\n<li>Check Lock Time Verify (CLTV)<\/li>\n<li>Check Sequence Verify (CSV)<\/li>\n<\/ul>\n<p>CLTV puts a lock on Bitcoin until a certain time in the future or until a certain block. In contrast, CSV locks Bitcoin until a certain number of blocks have been generated. Often, a time lock on the blockchain is used as a delay.<\/p>\n<p>&nbsp;<\/p>\n<h3>Hash and Secret<\/h3>\n<p>On the Bitcoin Lightning network, a “value” or “secret” is a unique line of numbers that is extremely difficult to predict, even by powerful computers. The peculiarity is that this unique line can be hashed by anyone who knows the “secret,” but a reverse action is not possible.<\/p>\n<p>This ploy can also be used on the Bitcoin platform in order to block Bitcoin. For example, you can include a hash in the line ‘to,’ with a requirement that anyone who wants to spend this money has to type in a value equal to the hash in the ‘from’ line.<\/p>\n<p>In the picture above, the hash is illustrated as a lock, and the secret value is a key.<\/p>\n<p>&nbsp;<\/p>\n<h2>Bi-Directional Payment Channels<\/h2>\n<p>The idea of payment channels was a point for discussion a long time before Bitcoin Lightning creation. It goes without saying that the ordinary payment channels are useful; however, they are monodirectional. The main difference of the Lightning Network is that the payment channels on top of it are bi-directional and trustless. At this point, it is essential to understand what “trustless” means in terms of blockchain and Bitcoin Lightning.<\/p>\n<p>Blockchain technology roots out the need for trust by distributing the ledger among users. The resulting “trustless channel” means that users don’t have to worry about potentially fraudulent intentions on the part of their partner, as these are simply impossible to pull off. Principles like multi-signature and double-spending prevention do not allow a node to transmit Bitcoin without the other channel participant putting his\/her signature under the transaction.<\/p>\n<h2>How to Open a Channel<\/h2>\n<p>In order to open a channel between nodes, users must conduct the opening transaction, which will define the deposits they put into their accounts.<\/p>\n<p><em style=\"font-size: 16px;\">Opening the channel on Bitcoin Lightning makes sense for the nodes that conduct payments quite often, for example, once a week or even every day. This statement is based on the fact that transactions on the Lightning network do not require the verification of a majority of nodes on the blockchain; thus, money transfer is much faster.<\/em><\/p>\n<h3>Step 1: Opening Transaction<\/h3>\n<p>The channel will be opened as soon as nodes A and B send their deposits (let’s say 5 BTC) to the address with multi-signature. This will be the opening transaction. Bitcoin may be sent from this address only if both nodes sign the agreement. That is why Bitcoin Lightning channels are trustless.<\/p>\n<p>In addition, nodes get a secret value and a corresponding hash in order to be able to sign transactions.<\/p>\n<h3>Step 2: Commitment Transaction<\/h3>\n<p>The next step for node A will be creating a “commitment transaction”. The node A leaves 4 BTC on his\/her wallet and sends the other 6 to an address with multi-signature. This address is quite unusual: it includes CSV-timelock, so node B will be able to unlock it when a certain number of blocks have been conducted (let’s consider one thousand).<\/p>\n<p>Node A can unlock this block if he\/she has a secret value, however, node A only has the hash of the secret value. Therefore, there is no way to unlock the block yet.<\/p>\n<p>As a result, node A has to sign the commitment transaction and send it to node B instead of uploading it to the network.<\/p>\n<p>Meanwhile, node B has to do the same actions, but with reverse parameters: create the commitment transaction, leaving 6 BTC to him\/herself and sending the other four to the new address with multi-signature. Node A will be able to unlock this address as soon as 1,000 blocks are conducted within the channel, or with B’s secret value.<\/p>\n<p>After the two nodes exchange commitment transactions and the hashes of their secret values, they upload the opening transaction to the blockchain. The channel is then considered open.<\/p>\n<p>Now, both nodes can send the commitment transaction they received from each other to the Bitcoin blockchain. However, if A does this, B will instantly receive 6 BTC. If B does it, A gets 4 BTC. In any case, if any one of the two nodes sends this transaction to the network, he\/she will have to wait until 1,000 blocks have been conducted to access the address with multi-signature with the rest of the Bitcoin.<\/p>\n<p>&nbsp;<\/p>\n<h3>Channel Update<\/h3>\n<p>A little while later, if node B wants to send one BTC back to node A, they have to update the channel state. To perform an update, they need to repeat the actions described in the previous chapter despite the opening transaction, which has already been recorded on the blockchain. This time, node A leaves 5 BTC, and the other five BTC go to the address with multi-signature and the new secret values. The nodes also send hashes of new secret values to each other, along with signed commitment transactions. The node that does this will receive its 5 Bitcoins after 1,000 blocks have been conducted, and the other will receive it— immediately.<\/p>\n<p>Why can’t node B send the previous commitment transaction to the network, instead? It seems that if he\/she does this, he\/she will receive 6 Bitcoins. As mentioned earlier, the nodes exchange their secret values for the previous commitment transactions. Signing and sending the old commitment to the network means that node A immediately gets 4 Bitcoin. However, node B will be able to get his\/her 6 Bitcoins only after 1,000 blocks have been conducted.<\/p>\n<p>Meanwhile, node A will get the opportunity to obtain B’s money, as he\/she knows the secret value. All of this works in reverse if node A sends the previous transaction to the network.<\/p>\n<p>According to Bitcoin Lightning’s network consensus as described in the previous paragraph, both nodes are interested in following it.<\/p>\n<p>&nbsp;<\/p>\n<p>Now, the scheme of bi-directional payment channel can be expanded for conducting payments within the network.<\/p>\n<h2>How to Create a Network<\/h2>\n<p>Let’s say node A wants to pay node C 1 Bitcoin. To conduct the money transfer, they could open their own payment channel, but this becomes unnecessary, as A and B have already created one. Thus, C may transfer money to B, who will send them directly to A through their channel.<\/p>\n<p>However, here we come to the point of trust in the network. Node A doesn’t have any reason to believe that B has sent the money to C, or that C hasn’t received the transfer. Trust within the Bitcoin Lightning network is predefined by cryptographic protocol.<\/p>\n<p>To send money securely, node C creates a secret value and sends its hash to the node A. Node C asks B to buy the secret value for 1 Bitcoin, while node A says he\/she will send B 1 Bitcoin for the secret value B received from C. Performing this sequence of actions, A compensates B for his\/her expenses and sends 1 Bitcoin securely.<\/p>\n<p>&nbsp;<\/p>\n<p>The trust within the network is also enabled by HTLC (<span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/en.bitcoin.it\/wiki\/Hashed_Timelock_Contracts\">hash time-locked contracts<\/a><\/span>)<\/p>\n<p>Bitcoin Lightning nodes can also make a profit by serving as intermediaries. This will come in the form of commission for transmitting money through their channels.<\/p>\n<h2>Channel Closure<\/h2>\n<p>The Bitcoin Lightning Network is an off-chain system, which means that any transaction will never get on the blockchain. However, that channel is protected by blockchain consensus.<\/p>\n<p>If two nodes have created a channel on the Lightning network mutually, they need to create a transaction that overrides the actions taken when they opened the channel. In other words, if node A wants to close the channel, he\/she creates a transaction, leaving 4 Bitcoins and sending 6 to the node B. If B signs this transaction, the channel can be considered closed.<\/p>\n<p>Therefore, the Bitcoin network will record only opening and closing transactions, even though the nodes have conducted numerous payments between them.<\/p>\n<p>One can only imagine how the Lightning network frees up blockchain.<\/p>\n<h2>Lightning Network Implementation<\/h2>\n<p>At the moment, there are three well-known implementations of the Lightning Network by the following companies:<\/p>\n<ul>\n<li><em><strong>ACINQ<\/strong> <\/em>— <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/github.com\/ACINQ\/eclair\" target=\"_blank\" rel=\"noopener noreferrer\">Eclair<\/a><\/span> (a scala implementation of the Lightning Network, which runs with or without a graphic user interface)<\/li>\n<li><em><strong>Blockstream<\/strong><\/em> — <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/github.com\/ElementsProject\/lightning\">C-lightning<\/a><\/span> (a specification-compliant implementation)<\/li>\n<li><em><strong>Lightning Labs<\/strong><\/em> — <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/github.com\/lightningnetwork\/lnd\/\">LND<\/a><\/span> (Lightning Network Daemon is a complete Lightning Network node implementation)<\/li>\n<\/ul>\n<p>Litecoin, Stellar, Zcash, Ether, Ripple, Bitcoin Gold, and Bitcoin Diamond are the cryptocurrencies adopting the Lightning network protocol.<\/p>\n<h2>Risks<\/h2>\n<p>A second-long transaction with no fee on the blockchain sounds catchy, but doesn’t it seem like a set-up?<\/p>\n<p>There are several risks users of the Lightning Network should be aware of:<\/p>\n<ul>\n<li><em><strong>Improper timelocks.<\/strong><\/em> If the timelock is defined incorrectly, there is the possibility that an invalid transaction will become valid, which itself enables the other party to achieve coin theft.<\/li>\n<li><em><strong>Forced expiration spam.<\/strong> <\/em>All time-locked transactions may become valid; if one fraudulent node expires all of his\/her channels at once, this will lead to broadcasting transactions on the blockchain. The blockchain would then be loaded with mass spam.<\/li>\n<li><em><strong>Coin theft.<\/strong><\/em> When conducting transactions, nodes should be online. If the device storing a private key is malfunctioning, coins could be stolen if the device is under attack.<\/li>\n<\/ul>\n<h2>Conclusions<\/h2>\n<p>Lightning Bitcoin came along in 2018 as a solution to the scalability issue on the Bitcoin network. It is a set of payment channels created between nodes who frequently conduct transactions with each other.<\/p>\n<p>What makes more and more nodes turn to the Lightning network each month is the speed of money transfers and transaction fees. Both aspects are significantly more profitable to nodes who perform financial operations on the Bitcoin network.<\/p>\n<p>One of the most valuable characteristics of the Lightning Network is financial fraud elimination. Due to the fact that both nodes open the channel and contribute inputs, no one can steal the contributed coins. In order to do this, they would have to close the channel, which is impossible without two sides signing the agreement.<\/p>\n<p><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/contact-us\/\">Applicature<\/a><\/span> is always ready to answer any questions regarding the relevance of the Bitcoin Lightning network to your business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Blockchain was designed as a platform for secure, transparent money transfers. Over time, it has become a technology that offers much more than just transactions. It has become a framework for creating indispensable solutions for the market, such as decentralized applications for supply chains, banking services, etc. Even blockchain technology may not be able to [&hellip;]<\/p>\n","protected":false},"author":15,"featured_media":173975,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[141,150,154,156,157],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Bitcoin Lightning Network - Applicature<\/title>\n<meta name=\"description\" content=\"Scalability that makes Bitcoin network nodes stand in line to verify transactions fades away with the Lightning Network\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Bitcoin Lightning Network - Applicature\" \/>\n<meta property=\"og:description\" content=\"Scalability that makes Bitcoin network nodes stand in line to verify transactions fades away with the Lightning Network\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-11-23T15:04:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T20:33:09+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/39.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"575\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/39.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/\",\"name\":\"Bitcoin Lightning Network - Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/#primaryimage\"},\"datePublished\":\"2018-11-23T15:04:56+00:00\",\"dateModified\":\"2022-01-11T20:33:09+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\"},\"description\":\"Scalability that makes Bitcoin network nodes stand in line to verify transactions fades away with the Lightning Network\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/scaling-bitcoin-is-lightning-network-a-game-changer\/\",\"name\":\"Scaling Bitcoin: Is Lightning Network a Game Changer?\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\",\"name\":\"Kateryna Hanko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Kateryna Hanko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3014"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/15"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3014"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3014\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173975"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3014"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3014"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3014"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}