{"id":3017,"date":"2018-11-28T13:00:05","date_gmt":"2018-11-28T13:00:05","guid":{"rendered":"https:\/\/applicature.com\/?p=2791"},"modified":"2020-03-18T16:53:58","modified_gmt":"2020-03-18T16:53:58","slug":"blockchain-scalability","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability","title":{"rendered":"Blockchain Scalability: Hard Forks, Lighting Network, and Plasma Cash"},"content":{"rendered":"<p>Nowadays, cryptocurrency serves as the optimal means of financial exchange: paying bills and purchasing products and services. It is a really convenient way to make payments, as it provides the ability to avoid bank fees and third parties processing your payments. However, with blockchain development, new problems regarding its utilization have appeared. They must be solved in order to provide a fast and convenient environment for processing payments and creating decentralized apps.<br \/>\nLet&#8217;s consider the most widespread problems in terms of the blockchain:<\/p>\n<ul>\n<li>vulnerabilities<\/li>\n<li>limited programming ecosystem<\/li>\n<li>usability<\/li>\n<li>hostile attitude of the government<\/li>\n<li>the blockchain scalability issue<\/li>\n<\/ul>\n<p>Although the Ethereum platform offers a comfortable programming environment, building applications is a very difficult process. The blockchain network is vulnerable to hacks. Let&#8217;s remember the Parity multi-sig wallet issue and the DAO attack. Also, one of the main blockchain problems is usability.<\/p>\n<p>The development of decentralized apps requires a wide range of additional tools for their implementation when threatened with hacks. This has a negative impact on system security. Another problem is negative government policies affecting the decentralized payment system and cryptocurrencies. The issue currently at its progress stage is the scalability problem.<br \/>\nThe BTC network is expanding every day. This diagram demonstrates the average number of transactions confirmed per day, which has increased astronomically since the appearance of the Bitcoin network. The more transactions that are processed in the network, the more scalability problems appear in the network.<\/p>\n<p>[visualizer id=&#8221;2800&#8243;]<\/p>\n<p>Which danger can these problems cause, and how can you avoid all of them? Let&#8217;s find out right now.<\/p>\n<h2>The Most Important Blockchain Scalability Issues<\/h2>\n<p>There are several serious problems affecting blockchain operation, including:<\/p>\n<ul>\n<li>limitations<\/li>\n<li>block size<\/li>\n<li>response time<\/li>\n<li>fees<\/li>\n<\/ul>\n<h3>Limitations<\/h3>\n<p>The first Bitcoin scalability problem involves limitations. When a new transaction is processed, every node adds information about it to the ledger. In this way, as payment history increases, there is a danger of buckling the overall system. All data should be registered with accuracy, otherwise, the level of trustworthiness can be diminished. There are several limitations on the hardware side. When two blockchains become this big, it’s not possible to run a node for both of them.<\/p>\n<p>Take a look at the Bitcoin nodes distribution all over the world.<\/p>\n<p>[visualizer id=&#8221;2848&#8243;]<\/p>\n<p>&nbsp;<\/p>\n<p>[visualizer id=&#8221;2847&#8243;]<\/p>\n<p>&nbsp;<\/p>\n<p>[visualizer id=&#8221;2865&#8243;]<\/p>\n<h3>Block Size<\/h3>\n<p>Another important <span style=\"font-weight: 400;\">bitcoin scalability problem <\/span>is block size. Initially, the capacity of every block in the Bitcoin blockchain was 1 Mb, and every block could contain around 2,020 transactions. However, the number of transactions has increased in the network, causing another blockchain scalability problem: the time-consuming process of transaction execution.<br \/>\nLet&#8217;s see how the average number of transactions per block has increased since the appearance of the Bitcoin network.<\/p>\n<p>[visualizer id=&#8221;2826&#8243;]<\/p>\n<p>Take a look at how the average block size has increased since the appearance of the Bitcoin network.<\/p>\n<p>[visualizer id=&#8221;2845&#8243;]<\/p>\n<h3>Response Time<\/h3>\n<p>In the network, every transaction must go through a validation process. In terms of the number of transactions standing in the queue, they usually have to wait a long time for their validation. For instance, in the BTC network, it takes around 10 minutes to build a new block. The more transactions standing in the queue, the more time it takes for their processing. This increases during peak times.<\/p>\n<p>[visualizer id=&#8221;2841&#8243;]<\/p>\n<p>Okay, let&#8217;s find out how the process of validation goes. A payment is considered to be validated if it&#8217;s added to a block in the chain. For this, miners create new blocks and insert the data into them. When one participant sends cryptocurrency to another, the information about the new payment is sent to the node, creating a new block and adding data to it. After this, the payment is considered to be processed, and the recipient receives money from the sender.<\/p>\n<h3>High Fees<\/h3>\n<p>As the popularity of cryptocurrency grows day by day, the process of confirming transactions becomes more complicated, because mining demands higher computational power. Every payment demands transaction fees. If you want your payment to be verified more quickly, you can pay a higher fee for it. As the network is expanding, a lot of new users want their transactions to be processed. That&#8217;s why a lot of unprocessed transactions stand in the queue waiting for their validation.<\/p>\n<h3>How Does Everything Occur in the Blockchain Network?<\/h3>\n<p>Blockchain was invented for building a network without a central authority where every node has equal rights. But is there any central government? How does everything happen in this network?<br \/>\nEach separate node validates the payment and adds information about it to its own distributed log. However, the general number of nodes increases, making the process of validation more complicated and slower.<br \/>\nA lot of people think blockchain scalability issues should be solved, because decentralized society is constantly developing and is now able to serve many fields through replacement of the fiat payment system. A blockchain-based payment system saves users&#8217; money and time, providing them with the comfort of security.<br \/>\nThis problem is not so easy to solve. Every decision should be supported by a lot of people from the crypto community, including developers, miners, stakeholders, and others. It will require a lot of time and effort to change the whole system. This is why a lot of alternative options appear to be solving this difficult problem.<\/p>\n<h2>How to Solve the Blockchain Scalability Problem?<\/h2>\n<p>A number of alternative solutions are appearing, and <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/\">Applicature<\/a><\/span> brings you the most popular:<\/p>\n<ul>\n<li>Hard forks (Bitcoin Cash)<\/li>\n<li>Soft forks (SegWit)<\/li>\n<li>Lighting Network<\/li>\n<li>Plasma Cash<\/li>\n<li>Hard Fork<\/li>\n<\/ul>\n<p>A hard fork is a split in the chain. The protocol is changed completely, making previously invalid transactions valid. To implement this option, all users should download the latest version of the protocol. After this point, there isn&#8217;t any connection between the two chains. The new version contains the entire history of previous transactions, but from the moment of the split, it has its own history which differs from the other chain.<\/p>\n<h3>Bitcoin Cash Scalability<\/h3>\n<p>One of the most popular hard forks in the history of the crypto world is Bitcoin Cash. In May 2018, the network successfully increased the size of a block to 32 MB. This innovation will hopefully provide the blockchain network with new opportunities.<\/p>\n<p>In addition, specialists say that this increases the value of full nodes, and also makes the network less decentralized. Fans of this cryptocurrency consider a hard fork of Bitcoin that occurred in August 2017 to have been more successful than its main competitor because of enhanced Bitcoin Cash scalability.<\/p>\n<h3>What Is SegWit?<\/h3>\n<p>SegWit is a feature of the Bitcoin sidechain that can solve Bitcoin scalability problems including the problem of block capacity as well as the transaction malleability issue. It has enhanced block capacity to 4 Mb, providing it with the opportunity to contain more than 8,000 transactions.<br \/>\nThis allows all data to be stored in the side chain. When the signature data moves from the main chain to the side chain, the block becomes free, and can provide a lot of empty space for other transactions. Let&#8217;s explore Segwit’s advantages and disadvantages.<br \/>\nAdvantages:<\/p>\n<ol>\n<li>Block capacity significantly increases. Therefore, every block can contain signature data about other transactions.<\/li>\n<li>With this innovation, participants don&#8217;t need to wait so long to confirm transactions, as the time of payment validation has been optimized.<\/li>\n<li>Segwit protects the network from transaction malleability.<\/li>\n<li>Since each block can contain more transactions, the total fees collected by the miner can be enhanced.<\/li>\n<li>Decreased fees<\/li>\n<li>Transaction volume is decreased. This allows the quadratic hashing problem caused by the block increase to be solved. The problem causes the overall number of transactions to double, and this doubles the overall amount of signature data stored inside each transaction. It makes the network vulnerable to hackers.<\/li>\n<\/ol>\n<p>SegWit can fix this issue by modifying the calculation of the signature hash and providing network participants with additional efficiency.<\/p>\n<h4>Disadvantages of SegWit<\/h4>\n<p>However, despite the fact that SegWit offers solutions to the Bitcoin scalability problem, it also has several disadvantages, which include the following:<\/p>\n<ol>\n<li>Its implementation is difficult. Thus, all wallets must implement this technology themselves. There is the risk that this process could cause several issues. A SegWit-compatible wallet (not to be confused with a SegWit2X fork) requires the support of a pay-to-script-hash (BIP16) and its address format (BIP13). Also for processing payments, this wallet transforms a given P2SH address into a scriptPubKey and forms a transaction. Also, it has to create a P2SH address based on a P2WPKH script and recognize payments to these addresses to receive assets.<\/li>\n<li>When the hard fork Bitcoin Cash happened, this demonstrated that a new chain can split up the cryptocurrency community.<\/li>\n<li>Decreased transaction fees for miners<\/li>\n<li>Considering all the specifications of the blockchain, including block capacity, overall number of transactions, and bandwidth growth, Segwit will increase resource consumption.<\/li>\n<li>Compared to the basic blockchain, the sidechain doesn&#8217;t provide miners with financial benefits and rewards for network maintenance. That&#8217;s why a bonus plan should be developed for miners.<\/li>\n<\/ol>\n<h3>Lightning Network<\/h3>\n<p>When it comes to Bitcoin scalability solutions, we should definitely mention the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/lightning-fast-bitcoin-transactions\">Lightning Network<\/a><\/span>. To understand better what it is, you can imagine how two participants of the network send money to each other several times, verifying transactions without recording them on the root blockchain. This is the main idea of this innovative technology.<\/p>\n<p>It allows confirming transactions without recording them in the main ledger. You’ll probably agree that it&#8217;s a very comfortable way to send and receive coins without littering the network. For this, the Lightning Network was invented.<br \/>\nThis is a network that allows adding another layer to the blockchain and providing its participants with the opportunity to build payment channels between two different parties. This makes transactions instant, and they can boast very low fees, or even be processed without cost.<\/p>\n<h4>Double-signed transactions<\/h4>\n<p>The Lightning Network allows solving the blockchain scalability problem using double-signed transactions. For this, both parties create a channel to send money to each other. That means that they create a multisig wallet that they can access with their private keys. After that, the two parties deposit a certain amount of cryptocurrency.<\/p>\n<p>After the first equal deposit, they can manage transactions between each other and send money an unlimited number of times. When one of the parties sends money to the other, she or he sends the ownership rights to these assets to the second party.<br \/>\nWhen the channel is closed, the distribution of assets is processed. Money is distributed using the latest signed balance in the ledger. And after completion of the channel work, the data from it is submitted to the main chain. This payment protocol allows the processing of micro-payments without miners and the building of new blocks on the main blockchain.<br \/>\nThere are quite a few advantages provided with this secondary layer:<\/p>\n<ol>\n<li>It allows solving the blockchain scalability problem by the processing of billions of transactions per second. Users can attach one payment per click without custodians.<\/li>\n<li>Off-chain transactions ensure low fees and instant micropayments.<\/li>\n<li>With this off-chain micropayment system, instant payments are available. With smart-contract technology, individual payments can go through a validation process without creating on-chain transactions. This reduces the speed of payments to milliseconds.<\/li>\n<li>Atomic Swap provides users with cross-chain transactions that don’t need to be checked by a third party.<\/li>\n<\/ol>\n<h3>Plasma Cash: An Innovative Solution to the Scalability Problem<\/h3>\n<p>The main blockchain scalability problem is the fact that all blocks are connected with each other, and in order to add a transaction to the block, you need to download all the previous transactions. You should agree that it&#8217;s not so comfortable for users. Ethereum, as the most popular network for ICO launches, has 400 Gb data, and this number is constantly increasing.<br \/>\nLet’s introduce Plasma Cash, which was presented this year in France. It&#8217;s not strange that this innovation resembles the Lighting Network, since it was created by Vitalik Buterin with the co-creator of the Lightning Network, Joseph Poon.<br \/>\nThis is a new layer for the most popular platform to build decentralized apps based on smart-contract execution. It enables solving the bockchain scalability problem by the processing of billions of state updates per second, allowing a huge amount of decentralized apps to run worldwide.<br \/>\nThis on-chain layer enables the processing of data without overloading the main network. You can imagine the main network as the root chain, and the on-chain layer as additional branches growing from it. These branches constantly send reports to the root chain. All the odd chains provide chain validators with the opportunity to issue their own tokens and avoid faults.<\/p>\n<h4>ERC-721 token<\/h4>\n<p>Each branch contains its own individual data, and when it&#8217;s time to send some data to the root chain, it can avoid sending all the content and submit the blog header hash to the main chain.<br \/>\nWhen a user wants to send some digital assets from the main network to the sidechain, he\/she just sends them to Plasma Cash. This creates an <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/ethereum-programming-tutorial\">ERC-721 token<\/a><\/span> equal to the amount of the sent assets. This number of tokens or Ethers is replaced with tokens in the sidechain. After the transaction has gone through a validation process, Plasma Cash updates the value of the ERC-721 token and releases a new grouping of digital assets. Users, however, can&#8217;t send more assets than the Plasma Cash smart contract contains.<br \/>\nThe essential benefit provided by the Plasma chain is that it allows enhancement of space in the main chain and exponentially faster speed of transaction confirmation.<\/p>\n<h2>Summary<\/h2>\n<p>There are four major blockchain scalability issues: limitations, block size, response time, and high fees. All of these problems should be solved, as the network grows every day and the number of users increases. <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/\">Applicature<\/a><\/span> offers several effective solutions to these issues, including Bitcoin Cash, SegWit, the Lightning Network, and Plasma Cash. All of these provide participants in the network with benefits and allow them to use cryptocurrencies with comfort and ease.   \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nowadays, cryptocurrency serves as the optimal means of financial exchange: paying bills and purchasing products and services. It is a really convenient way to make payments, as it provides the ability to avoid bank fees and third parties processing your payments. However, with blockchain development, new problems regarding its utilization have appeared. They must be [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":3024,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[152,154,160,235,246,253],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Blockchain Scalability: Main Problems and Solutions<\/title>\n<meta name=\"description\" content=\"The main problem of blockchain scalability lies in overloading the network with a huge amount of data. Every block arises after adding data to the history of blocks. This can cause a collapse of the overall system. In this article, you will be provided with an introduction to available blockchain scalability solutions.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Blockchain Scalability: Main Problems and Solutions\" \/>\n<meta property=\"og:description\" content=\"The main problem of blockchain scalability lies in overloading the network with a huge amount of data. Every block arises after adding data to the history of blocks. This can cause a collapse of the overall system. In this article, you will be provided with an introduction to available blockchain scalability solutions.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-11-28T13:00:05+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-03-18T16:53:58+00:00\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Scalability-Solutions.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Scalability-Solutions.jpg\",\"width\":1024,\"height\":535,\"caption\":\"Scalability Solutions\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/\",\"name\":\"Blockchain Scalability: Main Problems and Solutions\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/#primaryimage\"},\"datePublished\":\"2018-11-28T13:00:05+00:00\",\"dateModified\":\"2020-03-18T16:53:58+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/e752807d4f13a8d62e7131a96b2a8a8b\"},\"description\":\"The main problem of blockchain scalability lies in overloading the network with a huge amount of data. Every block arises after adding data to the history of blocks. This can cause a collapse of the overall system. In this article, you will be provided with an introduction to available blockchain scalability solutions.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\/\",\"name\":\"Blockchain Scalability: Hard Forks, Lighting Network, and Plasma Cash\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/e752807d4f13a8d62e7131a96b2a8a8b\",\"name\":\"iryna.pavlenko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"iryna.pavlenko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3017"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3017"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3017\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/3024"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3017"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3017"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3017"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}