{"id":3019,"date":"2018-11-29T13:14:10","date_gmt":"2018-11-29T13:14:10","guid":{"rendered":"https:\/\/applicature.com\/?p=2872"},"modified":"2019-08-01T12:31:35","modified_gmt":"2019-08-01T12:31:35","slug":"is-raiden-a-new-scaling-competitor","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor","title":{"rendered":"Raiden Scaling Solution For Ethereum"},"content":{"rendered":"<p>Blockchain offers a wide range of killer applications for payments that don’t support global adoption due to their limited capacity. Block size shortage, high fees, and time-consuming confirmation have caused the scalability issue that is currently slowing down the network.<\/p>\n<p>There is no shortage of materials covering this aspect of blockchain technology in terms of scalability and <a href=\"https:\/\/applicature.com\/blog\/lightning-fast-bitcoin-transactions\">solutions<\/a>. Therefore, we have engaged our experts to share their knowledge on that. Read and learn.<\/p>\n<h2>Scalability<\/h2>\n<p>In comparison with Ethereum, <a href=\"https:\/\/applicature.com\/blog\/use-case-blockchain-implementation\">the Bitcoin network<\/a> is able to conduct far fewer transactions: more precisely, one transaction per ten minutes, which causes huge lines of transactions waiting for users to confirm them. At the moment, the Ethereum network can conduct one block in twenty seconds. This seems like a negligible amount of time; however, it is still not enough for adoption as an everyday payment platform. In the case of wide adoption, the network will need to cope with hundreds of thousands of transactions per second. Moreover, to adopt everyday payments on the blockchain, there are several additional aspects that need to be fixed, such as transaction cost and confirmation time.<\/p>\n<h3>Transaction Cost<\/h3>\n<p>When a node sends a transaction to a pool, the system defines a minimum gas (a transaction cost) that the user has to pay for the transaction to be confirmed. Also, the node may increase gas in order to get faster confirmation. Transactions with a higher gas fee are at the top of the waiting list. So eventually, for nodes that can’t afford to pay more gas, it becomes a time issue.<\/p>\n<h3>Confirmation Time<\/h3>\n<p>The capacity of any blockchain network is currently limited because before nodes can confirm transactions in a block, they need to mine it by solving a mathematical problem. Only after one of the nodes has managed to solve the puzzle can the community confirm transactions in this block. As soon as it is validated, the transaction becomes a part of the distributed ledger. All of these actions take time, and sometimes, the route from transaction to confirmation can take several days. Of course, the confirmation time depends on gas. No miner will process a block if its gas is lower than average; gas is, literally, the miner’s profit.<\/p>\n<h2>Scalability Solution<\/h2>\n<p>There are numerous options for users to choose from, starting with soft forks like SegWit and hard forks like SegWit2z. These are followed by the Lightning Network, Plasma, Plasma Cash, and the Raiden Network. Here, <a href=\"https:\/\/applicature.com\/blog\/lightning-fast-bitcoin-transactions\">Applicature<\/a> can provide a full picture of what each solution offers to the market<\/p>\n<h3>SegWit and SegWit2x<\/h3>\n<p>The Segregated Witness solution on Bitcoin came along in 2016, when the crypto community was discussing the scalability issue and the opportunities that increased block size would bring. SegWit offered to move the signature to the end of the transaction code, which would significantly reduce the size of the transaction and reload the network. The block size with SegWit increases up to 2MB, while the hard fork SegWit2x suggested expanding a block up to 4MB.<\/p>\n<p>However, in the end, none of the solutions were adopted by the community.<\/p>\n<h3>Lightning Network<\/h3>\n<p>All scalability solutions are aimed at reloading the list of transactions waiting for confirmation, and this is the case with Bitcoin Lightning. This is an off-chain network that allows the creation of direct-payment channels between nodes for cheap, fast transactions.<\/p>\n<p>In order to open a payment channel between two nodes, they contribute an even amount of money to a wallet with a multi-signature. This sum will define the maximum sum allowed for transmission within this channel. The biggest advantages of the Lightning Network are:<\/p>\n<ul>\n<li>the absence of a transaction fee<\/li>\n<li>no need for the network to confirm transactions<\/li>\n<\/ul>\n<p>Therefore, transactions are free and immediate. Moreover, when the nodes decide to close their channel, they can get their money back.<\/p>\n<p>The only case requiring a fee would be building a network inside of Bitcoin Lightning. When there is a direct payment channel opened between A and B, and B also has a channel with C, if A wants to pay C, they don’t have to open a new channel. A can ask B to transmit money to C for a certain fee.<\/p>\n<p>Security on the network is ensured by the fact that there is no opportunity to exit the channel without mutual agreement. Therefore, no participant can exit and\/or steal a contribution without the other’s party confirmation.<\/p>\n<p>None of the transactions conducted between nodes on Lightning are shared to the blockchain except for the opening transactions that the nodes create when opening their channel.<\/p>\n<p><a href=\"https:\/\/applicature.com\/blog\/scaling-bitcoin-is-lightning-network-a-game-changer\">The Bitcoin Lightning Network<\/a> is the perfect solution for parties that have a financial relationship, need to pay each other often, and require cheap and on-time transactions. However, the Lightning Network operates only on the Bitcoin Blockchain.<\/p>\n<h3>Plasma<\/h3>\n<p>The Bitcoin network is not the only one trying to cope with the scalability issue. Ethereum can’t match payment systems as Visa, Mastercard, and Paypal, either. However, it is accompanied by an analogy of the Lightning Network: Plasma.<\/p>\n<p>Unlike Bitcoin, the scale of the Ethereum network can be improved by turning to Proof-of-Stake Casper and sharding (these are not the only variants), which had to be implemented about a year ago.<\/p>\n<p>On November 9, Vitalik Buterin and one of the key developers of the Lightning Network published the white paper for Plasma project, which, in fact, is a Lightning algorithm implementation on Ethereum.<\/p>\n<p>Ethereum is a network in which smart contracts are the “lawyers” regulating the financial relationships between nodes. Similar to the Lightning Network, where input is used to open the channel that determines the sum that can be transmitted within the channel, in Plasma, the transaction sum is controlled by a smart contract.<\/p>\n<p>In addition, in the Lightning Network, privacy is provided by the inability to leave the channel without the other side’s approval. Meanwhile, in Plasma, a node can exit the channel at any time without the need for approval, as everything is controlled by a smart contract.<\/p>\n<p>Plasma allows the sending of tokens quickly and securely without having to wait for transaction verification. The technology refers to off-chain channels regulated by Ethereum smart contracts (Balance blockchain model) not maintained by the Blockchain network. Instead, Bitcoin operates with a UTXO blockchain model (Unspent Transaction Output).<\/p>\n<h4>Blockchain Models: UTXO vs. Balance<\/h4>\n<p>Apart from the fact that UTXO and Balance are used on two different blockchains, they represent two different approaches to money transmission.<\/p>\n<p>The UTXO model principle is quite complicated. The number of Bitcoins that a wallet contains is considered a UTXO. In order to send one Bitcoin, the user will send his\/her UTXO, and the receiver will send the change back. To make everything clear, let’s look at an example of a UTXO transaction:<\/p>\n<ol>\n<li>Node A has three Bitcoins in their wallet, and wants to send one to node B.<\/li>\n<li>Node A unlocks the UTXO and inputs the whole thing into the transaction.<\/li>\n<li>When node B gets the transaction, his or her wallet is supplemented by one Bitcoin, and B sends two Bitcoins back as change.<\/li>\n<\/ol>\n<p>On the other hand, there is an account\/balance model on Ethereum that doesn’t require staking a balance in order to send a transaction. The balance model is designed to make sure that A’s balance is equal to or greater than the money he\/she wants to send to the node B.<\/p>\n<p>If node A has three Bitcoins and wants to send one to B, the system will subtract one BTC from A’s wallet and replenish B’s wallet with BTC.<\/p>\n<p>The UTXO and Balance blockchain models can be associated with paying in cash and by credit card. When you buy bread and give a five-dollar bill to the cashier for bread that costs three dollars, you get two dollars’ change. This is analogous to the UTXO model.<\/p>\n<p>If you pay for a taxi with your credit card, the system deducts the necessary sum of money from your wallet. The only requirement is to have an equal amount of money to the taxi price or more on your card: the Account\/Balance model.<\/p>\n<h3>Plasma Cash<\/h3>\n<p>Currently, Ethereum’s network size is over 400 GB, and it is constantly growing. This causes scalability issues due to the fact that the ledger is distributed.<\/p>\n<p>When creating a sidechain on Ethereum based on the Plasma Cash algorithm, you create a non-fungible token with its value in Ether or ERC20 tokens. The transactions within the sidechain shouldn’t overtake the value of your token. A smart contract controls whether everything goes according to the agreed-upon consensus.<\/p>\n<p>The main difference between Plasma and Plasma Cash is that in Plasma, users need to download each block, which causes huge scalability concerns. To fixing this, Vitalik Buterin and the co-founder of the Lightning Network, Joseph Poon, have presented Plasma Cash, which only requires keeping track of the blocks with the coins that the user is interested in.<\/p>\n<p>While Plasma is profitable when conducting frequent micro-payments, Plasma Cash is used for business that gets money from inside while the nodes need to send transactions within the sidechain. An analogy to the Plasma Cash principle of work is a casino: you buy chips (tokens) to play, you may win and get more chips, or you may lose. When you want to stop playing (exit the sidechain), you change your chips back into money (Ether).<\/p>\n<h3>Raiden<\/h3>\n<p>Each of the above describes a project that has somehow figured out the scalability issue of the Ethereum network. Plasma offers the opening of direct payment channels and conducts fast, cheap transactions; however, each node has to download every block. In Plasma Cash, participants in the sidechain don’t have to download each block. Instead, they track the blocks they are interested in. As a result, transactions are fast and cheap, and the ledger is not weighty.<\/p>\n<p>While Plasma Cash involves smart contracts to control token transactions within the network, the Raiden Network works on a smart contract that allows sidechains to process public smart contracts due to the overburdening of the Ethereum public blockchain. The sidechain has enough computational power to process a public smart contract, and sends the value back to the public blockchain.<\/p>\n<p>Through borrowing computational power from sidechains, the list of blocks waiting for confirmation on the public blockchain is shortened. This concept is called sharding. In other words, any subnetwork on Ethereum can borrow computational power from another subnetwork for a certain fee.<\/p>\n<h2>The Raiden Network Under the Hood<\/h2>\n<p>Because Raiden doesn’t have a white paper for reference yet, <a href=\"https:\/\/applicature.com\/contact-us\/\">Applicature<\/a> will share a complete guide on how Raiden works and the benefits it offers.<\/p>\n<p>Raiden’s goal is to bend blockchain consensus. This is possible due to leveraging the network of payment channels, which allows secure transfer of ERC20 tokens off-chain without the need to register each transaction on the public blockchain.<\/p>\n<h3>State Channel Technology<\/h3>\n<p>The Raiden network is an up-and-coming scalability solution based on state channel technology. To gain a deeper understanding of what Raiden really does, we’ll follow up with a state channel explanation.<\/p>\n<p>A state channel is a connection between two nodes that allows them to send transactions near-instantly and free of charge. The only input the nodes contribute is escrow, which opens the channel and is under a smart contract control. However, the most important peculiarity is that transactions occur off-chain, and nodes don’t have to report every action to the public blockchain (in our case, Ethereum).<\/p>\n<h3>How Does the Payment Channel Work?<\/h3>\n<p>The payment channel in Raiden is an agreement between two nodes in which the sender sets up a deposit of tokens on the blockchain for the receiver. Payments take place off-chain through privately-exchanged messages which digitally transfer the value. A smart contract validates and signs the transaction and settles the claims.<\/p>\n<p>Channels can also form a network which enables payments between two nodes that don’t have a direct payment channel. Several payments can happen concurrently without the need for global consensus on each transfer. Money transactions in Raiden are fast and do not cost any gas. This is possible due to the off-chain implementation.<\/p>\n<p>Nodes that open a payment channel between each other create escrow that defines the capacity of the channel. If the capacity is, for example, five BTC, node A can only send to B a maximum of five Bitcoins. However, if the channel is bi-directional, it can be rebalanced.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-2873 size-full\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/payment-channel.png\" alt=\"Payment Channel in Raiden Network\" width=\"611\" height=\"278\" \/><\/p>\n<h2>Raiden Network and Smart Contracts<\/h2>\n<p>Let’s imagine that there are two sidechains that want to become business partners, and share information or send transactions to each other. Obviously, they can build a partnership between two nodes on the public blockchain; however, each transaction will take time and fees. The way out is to build sidechains and take an advantage of instant payments. Moreover, with the help of Raiden, these sidechains can financially interact without the need to report to the public blockchain.<\/p>\n<p>One of the main advantages of the Raiden network is that sidechains can transact in both ETH and ERC20 tokens. No matter what the sidechains want to send, however, the receiving party won’t accept it without confirmation from a native smart contract. The sender calls the function “call” to get the confirmation, and when both sidechains support one smart contract to take the advantage of all the benefits of Raiden.<\/p>\n<h2>Raiden Roadmap<\/h2>\n<p>The Raiden Network doesn’t have a white paper yet, but there is a roadmap on its <a href=\"https:\/\/raiden.network\/roadmap.html\" target=\"_blank\" rel=\"noopener noreferrer\">website<\/a>.<\/p>\n<p>The Ethereum blockchain is unlikely to become a globally-adopted payment system for cryptocurrencies unless its transactions become faster, cheaper, and require less computational power. The Raiden network offers a solution to each issue mentioned above, and has even more potential in its perspective.<\/p>\n<p>So far, the net has adopted the µRaiden (micro Raiden) network for fast, many-to-one, cheap ERC20-token transactions. The developers of the project are also working on other technologies:<\/p>\n<ul>\n<li><strong>Channel opening, closing, and settlement.<\/strong> In Raiden, users are able to connect with other users even if they don’t have a direct payment channel through them. Transactions like these will remain near-instant, and will require a minimum fee.<\/li>\n<li><strong>REST API.<\/strong> Developers will also be able to build dApps on top of the Raiden Network.<\/li>\n<li><strong>Recoverability.<\/strong> In case a node fails, this feature protects the channel from data loss.<\/li>\n<li><strong>Raiden Red Eyes.<\/strong> The release of Red Eyes on the Mainnet will provide a bug-fixing system along with user feedback. Safety limits will also be implemented: 250ETH of the maximum value for escrow mentioned in the smart contract, and WETH, the maximum deposit for the node\/direction, stands on 0,5ETH.<\/li>\n<\/ul>\n<p>Here are some functions the Raiden development team is planning to implement in the future:<\/p>\n<ul>\n<li><strong>Channel withdraw.<\/strong> The users who created a payment channel will be able to withdraw funds without the need for closure.<\/li>\n<li><strong>Atomic token swaps.<\/strong> This function enables decentralized-exchange implementation based on state channels.<\/li>\n<\/ul>\n<p>You can find a full list of functions that are going to be added to the Raiden network\/system on its <a href=\"https:\/\/raiden.network\/roadmap.html\" target=\"_blank\" rel=\"noopener noreferrer\">official website<\/a>.<\/p>\n<h2>Raiden Network Token<\/h2>\n<p>Unlike Plasma (works with Eth) and the Lightning Network (works with BTC), the Raiden project has a native currency (RDN), even though it works with both ETH and ERC20 tokens.<\/p>\n<p>The RDN token is already available for use by Ethereum <span style=\"color: #000000;\">nodes<\/span> for micropayments on µRaiden. Initially, the total supply is 100,000,000,000 RDN tokens.<\/p>\n<p>The latest update on <a href=\"https:\/\/cryptolization.com\/raiden-network-token\" target=\"_blank\" rel=\"noopener noreferrer\">Cryptolization<\/a> shows that the total market for RDN token stands on <span style=\"color: #339966;\"><strong>$212,132,167,873 U.S.<\/strong><\/span><\/p>\n<p>According to <a href=\"https:\/\/www.binance.com\/trade.html?symbol=RDN_BTC\" target=\"_blank\" rel=\"noopener noreferrer\">Binance<\/a>, the current price of Raiden Network tokens is <span style=\"color: #339966;\"><strong>$0.484789 U.S.<\/strong><\/span><\/p>\n<h2>Raiden Network Advantages<\/h2>\n<p>Among other scaling solutions for blockchain, Raiden has a long list of features that businesses will find rather beneficial:<\/p>\n<ul>\n<li><strong>Transaction time.<\/strong> While on-chain transactions stay in line for validation and users sometimes wait for days until somebody decides to mine the block, in an off-chain network, no transactions need validation. This refers to a direct channel that two nodes open and within which they sign an agreement (smart contract) that ensures that all actions are trustworthy.<\/li>\n<li><strong>Transaction fees.<\/strong> Of course, a node can increase the gas he\/she defines for the transaction in order to secure the verification time; however, this makes money transfer costly on the blockchain. Fortunately, this is not a dead end for blockchain as a payment system, owing to Vitalik Buterin and Joseph Poon, who took care of the fees issue with scaling solutions like Plasma, Plasma Cash, and Raiden. Now, in off-chain networks, users only contribute when opening a payment channel when the transaction charges no fee.<\/li>\n<li><strong>Capacity.<\/strong> Taking the Ethereum and Bitcoin networks as an example, capacity is fixed. This differs from the Raiden Network, which grows in a linear fashion according to the number of users in the network.<\/li>\n<li><strong>Privacy.<\/strong> Blockchain is, by default, a distributed ledger in which each node records all transactions ever conducted on the public blockchain. For businesses that store confidential data on the distributed ledger, this may become an issue in terms of privacy. That is why creating sidechains becomes a proposed remedy.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2874\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/Raiden.png\" alt=\"Raiden Network Advantages\" width=\"1056\" height=\"816\" \/><\/p>\n<h2>What Difficulties Does Raiden Face?<\/h2>\n<p>The blockchain is a young technology, and it is constantly growing and improving. However, each technology that offers a solution to one issue faces two more issues on its path. Let’s review the difficulties facing the Raiden Network:<\/p>\n<ul>\n<li><strong>Locked-up tokens.<\/strong> Both participants in the payment channel should have a certain number of tokens in his\/her wallet to create the channel. The system will lock these tokens until channel closure; otherwise, the nodes will not be able to open a direct payment channel. Furthermore, it becomes costly to open several direct payment channels, as the node will have to lock up additional tokens. On the other hand, there is no need to open several channels due to the ability of node A to send tokens to node C through node B (of course, paying a certain fee).<\/li>\n<li><strong>Micropayments.<\/strong> Due to the deposit that nodes must contribute in order to open a channel, they limit themselves to have the maximum number of tokens to be transmitted within the channel. This leaves no choice but to conduct heavy transactions on the public blockchain.<\/li>\n<\/ul>\n<p>Let’s say that node A opened a channel with node B, and they contributed one ETH each. This means that the channel capacity is two ETH. If the channel is unidirectional, node A can send B even a hundred transactions, but the total amount shouldn’t overtake the two ETH contributed. However, if the channel is bi-directional, A and B can rebalance each other, and send an infinity of transactions as long as the total assets of the transaction are less than or equal to the escrow.<\/p>\n<h2>Conclusion<\/h2>\n<p>The Ethereum community has been waiting for Raiden adoption on the blockchain since its release. It should wait no longer, as the Raiden development team will soon finish testing the technology. Moreover, there is already an available prototype of Raiden Network: µRaiden.<\/p>\n<p>The confusing thing about Lightning, Plasma, Plasma Cash, and Raiden is how, exactly, they differ from each other. Let’s start with the fact that Lightning works on Bitcoin and allows the opening of direct payment channels while spending less time and money on transactions.<\/p>\n<p>Both Plasma and Raiden are very similar to Lightning; however, Plasma only works with ETH, unlike Raiden, in which users may use ETH and ERC20 tokens.<\/p>\n<p>Among other available scaling solutions, Raiden stands out with its sharding ability, which means that sidechains are able to send smart contracts for processing to another sidechain.<\/p>\n<p>One more technology that solves Ethereum scalability and helps unload the network is Plasma Cash, which also works with both ETH and ERC20 tokens. This technology allows users to transfer tokens from the public blockchain to the sidechain, and send them within the sidechain for a great profit in terms of extremely low fees.<\/p>\n<p>If your business needs to implement any of the above-mentioned technologies, please contact the <a href=\"https:\/\/applicature.com\/contact-us\/\">Applicature<\/a> team for additional information.    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Blockchain offers a wide range of killer applications for payments that don’t support global adoption due to their limited capacity. Block size shortage, high fees, and time-consuming confirmation have caused the scalability issue that is currently slowing down the network. There is no shortage of materials covering this aspect of blockchain technology in terms of [&hellip;]<\/p>\n","protected":false},"author":15,"featured_media":3020,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[150,154,156,160],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Raiden Scaling Solution For EthereumIs Raiden a New Scaling Competitor?<\/title>\n<meta name=\"description\" content=\"Since the crypto community started facing the scalability issue, dozens of solutions have appeared and offered their technologies. Here’s how to differentiate between them and implement the ones you can find out about in Applicature’s guide to the Raiden Network.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Raiden Network Review\" \/>\n<meta property=\"og:description\" content=\"Raiden appears to be one of the most complicated technologies of all available scaling solutions. Follow the Applicature blog to reveal the difference between Plasma and the Raiden Network.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-11-29T13:14:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:31:35+00:00\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Raiden Network Review\" \/>\n<meta name=\"twitter:description\" content=\"Raiden appears to be one of the most complicated technologies of all available scaling solutions. Follow the Applicature blog to reveal the difference between Plasma and the Raiden Network.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/RAIDEN-NETWORK-REVIEW.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/RAIDEN-NETWORK-REVIEW.jpg\",\"width\":1024,\"height\":535,\"caption\":\"RAIDEN NETWORK REVIEW\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/\",\"name\":\"Raiden Scaling Solution For EthereumIs Raiden a New Scaling Competitor?\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/#primaryimage\"},\"datePublished\":\"2018-11-29T13:14:10+00:00\",\"dateModified\":\"2019-08-01T12:31:35+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\"},\"description\":\"Since the crypto community started facing the scalability issue, dozens of solutions have appeared and offered their technologies. Here\\u2019s how to differentiate between them and implement the ones you can find out about in Applicature\\u2019s guide to the Raiden Network.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/is-raiden-a-new-scaling-competitor\/\",\"name\":\"Raiden Scaling Solution For Ethereum\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\",\"name\":\"Kateryna Hanko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Kateryna Hanko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3019"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/15"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3019"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3019\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/3020"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3019"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3019"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}