{"id":3046,"date":"2018-12-07T10:01:39","date_gmt":"2018-12-07T10:01:39","guid":{"rendered":"https:\/\/applicature.com\/?p=3046"},"modified":"2019-08-01T12:29:55","modified_gmt":"2019-08-01T12:29:55","slug":"dpos-delegate-and-conquer","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer","title":{"rendered":"DPoS: Delegate and Conquer"},"content":{"rendered":"<p>In the twenty-first century, we no longer need banks to verify our transactions. We also don’t need them as third parties, as computational powers are no longer a problem. How did this come to pass? It’s our pleasure to reveal all the necessary information on protocol consensus types and their differences.<\/p>\n<h2>Transactions on Blockchain<\/h2>\n<p>It is worth mentioning that transactions on blockchain contain not only valuable digital assets, but also messages (data). Each transaction has an input (the set of numbers that represents the wallet of the sender) and an output (the wallet of the receiver). Also, each block is encrypted by a hash, which is a unique figure generated by the system.<\/p>\n<p>No matter how long or short your message is, the hash will always contain 256 bits, according to SHA-256 (Secure Hashing Algorithm 256).<\/p>\n<p>To record a transaction on the blockchain, one must arrange it in blocks. On Bitcoin, for example, the maximum block size is 1MB; on Ethereum, it depends on gas, with a maximum point of around 8 million gas.<\/p>\n<p>Let’s see how the blockchain looks in practice:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-3047 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/chain.png\" alt=\"how blockchain looks in reality\" width=\"1056\" height=\"694\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain-132x87.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain-350x230.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain-500x329.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain-768x505.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain-600x394.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain-120x79.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/chain-300x197.png 300w\" sizes=\"(max-width: 1056px) 100vw, 1056px\" \/><\/p>\n<h2>The Magic of Mining<\/h2>\n<p>The majority of people working with blockchain technology now see the mining process as a profitable act, and consider it an important goal. However, mining is a tool that helps make sure that coins are generated from nothing, and are spent only once. This is the reason why accurate records are possible on the distributed ledger.<\/p>\n<p>Basically, mining a block means using a computer with sufficient computational power to solve an NP-class problem. This is, in fact, a mathematical problem that the computer solves automatically. Literally, the miner tries to hash the header of the block to get a set of numbers containing 256 bits, which should be less than or equal to the block hash. Otherwise, the miner tries changing the nonce until the computer generates the target hash value.<\/p>\n<p>The question becomes the time the device spends to figure out the puzzle, as the first node that mines the block gets a reward in cryptocurrency. The essential point is that only delegates may mine the blocks. These are defined in different ways depending upon the type of consensus the network uses.<\/p>\n<h3>The Process Of Mining<\/h3>\n<p>In Proof of work, a leader-based consensus, the leader is the node that is the first to prove its real identity and solve the puzzle. In Proof of stake, the leader is mostly defined by the stake they hold. “Mostly” means that the algorithm of choosing the leader varies according to the type of PoS.<\/p>\n<p>As soon as the leader finds the matching hash, the block is considered mined. Other nodes stop processing it and search for another unmined block. Having finished mining, the miner broadcasts to the network for verification. If more than 51 percent of the users “say” this block is valid, it is added to the distributed ledger.<\/p>\n<p>On each blockchain, whether it is Bitcoin or Ethereum, users have to agree on the common <a href=\"https:\/\/applicature.com\/blog\/consensus-protocol\">consensus type<\/a> they will use while mining blocks. Currently, both Bitcoin and Ethereum communities use the Proof of work (PoW) consensus type. However, in order to solve the scalability issue, the Ethereum blockchain is likely to turn to the Proof of stake consensus.<\/p>\n<h3>Proof-of-Work<\/h3>\n<p>As previously mentioned, to mine a block means to find the correct answer that matches the hash of the mined block. As this process is fully automated and based on mathematical laws, there is no chance of fraud or cheating. Only proof of the work can satisfy the system — that’s why the consensus type is called Proof of work.<\/p>\n<p>Additionally, PoW consensus allows the mining of blocks to nodes that figure out the NP problem.<\/p>\n<h3>Proof-of-Stake<\/h3>\n<p>Another consensus type, which is as popular as PoW, is Proof of stake. The main advantage of PoS over PoW is that there is no need for computational powers. Users will not spend the monthly norm of electricity expenditure on generating just one block. How is this possible? <a href=\"https:\/\/medium.com\/applicature\/the-pros-and-cons-of-icos-on-cardano-eos-and-other-proof-of-stake-based-platforms-44ba4e87ad00\" target=\"_blank\" rel=\"noopener noreferrer\">Applicature<\/a> explains further.<\/p>\n<p>In networks that agree to use Proof of stake consensus, the “who’s faster” principle doesn’t work. Instead, consensus is designed in such a way that the biggest stakeholders have the opportunity to mine the blocks first and get a reward.<\/p>\n<h4>How Does PoS Work In Reality?<\/h4>\n<p>Let’s review a simple example of how PoS works: if node A has a stake of thirty coins, node B has twenty coins, and node C has ten, then node A is most likely to be the first to mine the block and get the reward.<\/p>\n<p>The biggest advantage of PoS over PoW is that users are able to mine blocks even from their phones. Significant computational power is no longer needed. The analogy to computational power in PoS is the amount of the stake. The bigger the stake, the higher the probability to be first who validates the block.<\/p>\n<p>Basically, on blockchains that follow Proof of stake consensus, the rich become richer, and consequently gain more control in the network. On the other hand, if one user or entity buys out a majority of the coins in the network (more than 51% in Bitcoin or 66% in EOS and Cardano), it will impact the currency, resulting in a price drop. Consequently, it will require more resources than the profit it will bring.<\/p>\n<p>An upcoming consensus that the Ethereum blockchain plans to adopt is PoS Casper, which is a hybrid of PoW and PoS. To mine a block, you will have to solve the puzzle, which means you need computational power. However, the blocks will be referred to the nodes in random order, depending on which percentage of the stake you own (like in PoS). This solves two issues: scalability and trust.<\/p>\n<p>As Casper is under development, the Ethereum platform will adopt it as soon as the one comes out.<\/p>\n<h3>Stake Lock<\/h3>\n<p>Incidentally, any node that owns a certain amount of cryptocurrency has to make a deposit in order to gain the right to be a validator. In other words, a node has to lock a certain amount of his\/her money, which later will be considered as stake to compare with another node.<\/p>\n<p>If a node possesses 2% of the cryptocurrency, he\/she will have the option to mine 2% of the blocks on the blockchain.<\/p>\n<p>The system of PoS consensus gives the biggest stakeholders the right to create blocks in a random order.<\/p>\n<h3>PoW vs. PoS<\/h3>\n<p>Initially, there are three main differences between the PoW and PoS consensus types:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-3048 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3.png\" alt=\"the difference between Proof of work and Proof of stake\" width=\"794\" height=\"1123\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3.png 724w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3-78x110.png 78w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3-247x350.png 247w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3-354x500.png 354w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3-600x849.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3-85x120.png 85w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Proof-of-Work-3-212x300.png 212w\" sizes=\"(max-width: 794px) 100vw, 794px\" \/><\/p>\n<p>The fact that the two biggest decentralized platforms — Bitcoin and Ethereum — are following the PoW consensus type makes it more costly for entities to mine and generate new tokens. Nodes on platforms like EOS use their stake size as an equivalent to computational power on PoS.<\/p>\n<p>Moreover, in both PoW and PoS, the rewards process is very similar: a miner gets a coinbase reward plus a transaction fee set by the node that generated it — or the reward could consist of only fees. As we know, to expedite a transaction validation, users increase the fee, which consequently becomes a reward for mining.<\/p>\n<p>Let’s consider the substantial differences between these two technologies. One-block mining time on Bitcoin is around ten minutes, while on Ethereum, it varies from ten to nineteen seconds. The block time (the time you spend mining one block) is less than a minute. Yes! It is indeed. Also, experienced blockchain researchers would say that super-fast transactions are also possible on Bitcoin and Ethereum with their scaling solutions: <a href=\"https:\/\/applicature.com\/blog\/lightning-fast-bitcoin-transactions\">Lightning<\/a> and <a href=\"https:\/\/applicature.com\/blog\/is-raiden-a-new-scaling-competitor\">Raiden Network<\/a>.<\/p>\n<p>Each technology needs improvement; otherwise, newcomers will overtake it. This happened to the Proof of stake protocol: some blockchain platforms turned Delegated Proof of stake in order to meet the requirements of the community.<\/p>\n<h2>Delegated Proof-of-Stake Consensus Type<\/h2>\n<p>Thinking of consensus protocol as a policy, DPoS would equal a representative democracy. How? Find out in the description below.<\/p>\n<p>Because Bitcoin transactions take a lot of time and form huge validation pools, there has arisen the need to create a new technology that will overtake the speed of Visa\/Mastercard transactions.<\/p>\n<p>Daniel Larimer, creator of the DPoS algorithm, predicted the future centralization of the Bitcoin platform due to the limited number of tokens available for generating, and designed an algorithm that:<\/p>\n<ul>\n<li>promises an extremely fast validation time<\/li>\n<li>doesn’t require computational powers for mining<\/li>\n<\/ul>\n<p>On the Bitcoin platform, a transaction is considered valid only after more than 51% of the nodes have confirmed it, which takes time due to the huge number of nodes in the community. Daniel Larimer prevented this by limiting the number of witnesses that have the right of transaction validation. This allows considerable shortening of the verification line. Consequently, transactions become valid much more quickly than with the Proof of work protocol.<\/p>\n<h3>How Does DPoS Work?<\/h3>\n<p>Let’s imagine that there is a blockchain platform with a community of one hundred nodes. DPoS is associated with democracy in this way: nodes have to vote in order to choose twenty witnesses who will run the network. Only these twenty nodes have the right to validate transactions.<\/p>\n<p>Computational power doesn’t solve any problems here; the only driving force that the node needs is a stake he\/she owns. The bigger the stake, the stronger the voting power. It means that Bob, who has ten coins, will influence the witnesses’ choice more than Alice, who has only one coin.<\/p>\n<p>The witnesses, 20 nodes who have the right to validate transactions, earn a salary for the work they do on the network. And validating transactions is not the only duty to perform. Witnesses are also chosen to keep the network secured.<\/p>\n<p>As more people join the network, the competition gets tougher and the positions of the witnesses become more highly paid, so almost every node in the network wants to become one. Consequently, when a witness starts doing a faulty job, users may take their votes back, which will bring a certain witness to a sack and will create a vacant position. The real-time voting process never stops.<\/p>\n<p>The next president in the witness position will become a node with a perfect reputation and voting experience.<br \/>\nTo empower DPoS and ensure that no fraud is allowed, in EOS, all nodes are bound by the EOS constitution: a legal agreement in which all delegates respect consensus.<\/p>\n<h2>Is DPoS Perfect?<\/h2>\n<p>As we all know, nothing is perfect, especially technology. There is always somebody who will design something better, faster, more efficiently or more profitably. The same is true for consensus protocols on blockchain — each solves a certain issue, which potentially creates another one for future protocols to fix.<\/p>\n<p>There are two factors that give DPoS consensus higher priority on the market:<\/p>\n<ul>\n<li>it solves the problem of the need for computational power<\/li>\n<li>it promotes decentralization<\/li>\n<\/ul>\n<p>However, while the number of delegates is shortened to a certain number, cutting transaction processing time, it prevents the platform from reaching full decentralization. According to the fact that increasing the number of witnesses causes scalability issues and constant growth of the network, it should balance between the number of generated blocks and scalability on the platform. This situation, however, has an extremely low chance of occurring.<\/p>\n<p>This is not the only possible threat to the network, as choosing a certain number of delegates causes the probability of collision, which impacts trusting relationships in the community. It’s true that delegates are frequently reelected by the community if they perform badly, but not in the moment of the attack. The issue remains a weak point in DPoS consensus protocol.<\/p>\n<h3>EOS Precedent<\/h3>\n<p>As an example, let’s recall an incident that occurred on the EOS platform. A node claimed that his private key was stolen, and someone had transferred his money to an unknown wallet. According to the constitution of EOS, there should have been an arbiter who verified the transaction and supervise the 21 delegates to make sure the arbiter made the correct choice. The transaction, claimed as fraudulent, was in fact confirmed by both. The node gave a command to change the state of the transaction. The nodes approved this, leading to blockchain state overwriting.<\/p>\n<p>If one node can do it, that puts the whole DPoS consensus idea under threat of being considered unreliable.<\/p>\n<h2>PoS vs. DPoS<\/h2>\n<p>Although PoS and DPoS have the same basic algorithms of a stake defining the power of a certain node, they also have differences.<\/p>\n<p>The validation time of one DPoS transaction is much faster than the one PoS transaction. This refers to the number of nodes required to verify each transaction. If transactions on the platforms that follow PoS need 51% of thousands of nodes to validate a transaction, DPoS consensus platforms require the same 51%, but of only twenty nodes.<\/p>\n<p>Additionally, the witnesses (DPoS algorithm) have some duties to conduct and rules to follow so they can stay in the witness position longer in order to get paid. From the other side, there is PoS protocol, which has nothing to do with the reputation of the node. It’s more about who gets the opportunity to mine the block first.<\/p>\n<p>Look up the image below to find out more about PoS and DPoS characteristics:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-3049 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/PoS-2.png\" alt=\"the difference between Proof of stake and Delegated Proof of stake\" width=\"735\" height=\"1102\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/PoS-2.png 683w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/PoS-2-73x110.png 73w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/PoS-2-233x350.png 233w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/PoS-2-333x500.png 333w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/PoS-2-600x900.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/PoS-2-80x120.png 80w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/PoS-2-200x300.png 200w\" sizes=\"(max-width: 735px) 100vw, 735px\" \/><\/p>\n<h2>DPoS Implementations<\/h2>\n<p>The delegated Proof of stake consensus type has found hundreds of implementations on the blockchain. Currently, more and more platforms based on blockchain technology are choosing to use DPoS, as it helps conquer the scalability issue and build businesses more efficiently.<\/p>\n<p>Basically, the advantages DApps get from being built according to DPoS consensus are scalability and low transaction fees.<\/p>\n<p><a href=\"http:\/\/applicature.com\">Applicature<\/a> would like to provide a list of the most popular and useful blockchain platforms that use DPoS consensus protocol.<\/p>\n<h3>Graphene Technology<\/h3>\n<p>Obviously, technology doesn’t start over, and as a result of this, the crypto community got Graphene technology — a software platform for creating and executing blockchains of the third generation.<\/p>\n<p>Graphene gives its adopters a higher performance rate than the one provided by Bitcoin 2.0.<\/p>\n<p>The first blockchain that implemented Graphene was BitShares, a financial opportunity platform.<\/p>\n<h3>BitShares<\/h3>\n<p><a href=\"https:\/\/github.com\/bitshares-foundation\/bitshares.foundation\/blob\/master\/download\/articles\/BitSharesBlockchain.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">The documentation on BitShares<\/a> claims it to be the first decentralized autonomous network in which users can decide the direction their BTS tokens will take in the future. What differentiates the Bitshares platform from other networks using smart contracts is the fact that on BitShares, smart contracts are used as operations.<\/p>\n<p>While most other blockchain platforms follow the Proof of work consensus, BitShares implemented a delegated Proof of stake algorithm in order to avoid the scalability issue that slows the Bitcoin network down so much.<\/p>\n<p>With DPoS, the BitShares platform replaces a wasteful mining procedure, processes many more transactions per second, and requires fewer fees. Due to the fact that computational power is not needed when working with DPoS, the mining process requires dramatically less electricity, which is a winning point in terms of environmental protection.<\/p>\n<p>Another platform similar to the BitShares blockchain is Steem: same technology, but with a different idea behind it.<\/p>\n<h3>Steem<\/h3>\n<p>Steem is a blockchain using the third-generation decentralized ledger of Graphene technology.<\/p>\n<p>BitShares and Steem are often associated with each other because of the similarity of the technology under the hood; however, BitShares concentrates on financial DAapps, while Steem is media-oriented.<\/p>\n<p>Moreover, publishers have the opportunity to earn money for the content they post and the hype they make around it. When you post a certain bit of information to the network, users vote for the post, which gives you Steem power and potential rewards in crypto.<\/p>\n<p>The transactions on Steem are near-instant and the fees are free. That is why you can’t find a better platform for developing DApps connected to media.<\/p>\n<p>One more DPoS implementation is “Ethereum on dope” — EOS!<\/p>\n<h3>EOS<\/h3>\n<p>The idea of EOS, which is an enhancement of Graphene, is to form a valid, reliable base for building decentralized applications. EOS is the perfect environment for financial applications, as it takes less time to validate transactions by only <em><strong>twenty-one witnesses<\/strong><\/em>. In addition, the twenty-first witness frequently changes, which means that the other twenty vote for its change.<\/p>\n<p>The distribution of EOS tokens is closed by a market cap of $3,509,780,111 USD. The price of EOS tokens is not set; instead, demand on the crypto market predetermines it.<\/p>\n<p>Similar to Ethereum, the EOS network allows the building of DApps on the top of it. <a href=\"https:\/\/applicature.com\/\">Applicature<\/a> will provide a range of fields that <a href=\"https:\/\/applicature.com\/blog\/eos-blockchain\" target=\"_blank\" rel=\"noopener noreferrer\">EOS<\/a> DApps cover:<\/p>\n<ul>\n<li>media<\/li>\n<li>data services<\/li>\n<li>social networking<\/li>\n<li>wallets<\/li>\n<li>money exchange<\/li>\n<li>gaming<\/li>\n<li>development<\/li>\n<li>education<\/li>\n<li>Fintech<\/li>\n<li>recruitment<\/li>\n<li>healthcare<\/li>\n<li>education<\/li>\n<\/ul>\n<p>This is even not a complete list, which shows how developed the network is as a base for creating decentralized applications.<br \/>\nBy the way, there are only high-performing, C++ written DApps on the EOS platform. Unfortunately, EOS doesn’t provide PowerShell commands yet; thus, users are not able to develop DApps with Windows software. However, development is available with MacOS, Ubuntu, Debian, and Fedora.<\/p>\n<h3>Lisk<\/h3>\n<p>The reasons each blockchain network uses DPoS protocol are similar; however, the business implementation is quite different because of the possibilities each provides. Let’s take an extended look at the advantages <a href=\"https:\/\/lisk.io\/\" target=\"_blank\" rel=\"noopener noreferrer\">Lisk<\/a> has over its competitors.<\/p>\n<p>First of all, developers can write code for DApps on JavaScript. Additionally, Lisk offers tools for customizing your sidechain. Oh, right, we didn’t mention? Creating a DApp on Lisk, users basically, form sidechains with an easy and comprehensive means of communication with the mainnet.<\/p>\n<p>The Lisk mainnet is the host of all sidechains that hold their DApps. It also has its own coin, the LSK, with a market cap of $174,180,275 USD. The users of Lisk can build ICOs on it.<\/p>\n<p>In terms of consensus, Lisk follows the DPoS protocol, with 101 delegates users can vote for. However, the power of the votes is predefined by the amount of LSK coins a user holds. In the whole ecosystem, only these 101 delegates have the right to create blocks.<\/p>\n<p>There is another platform very similar to Lisk that opens sidechains for DApps: Ark. Discover what the difference is.<\/p>\n<h3>Ark<\/h3>\n<p>The <a href=\"https:\/\/ark.io\/\" target=\"_blank\" rel=\"noopener noreferrer\">Ark<\/a> ecosystem maximizes the simplicity of building DApps and increases developer productivity with its sophisticated design and expendable software. The documentation claims that users (those who build DApps) will be able to create their own blockchains, which is true: <strong><em>sidechains<\/em><\/strong> are created for each DApp.<\/p>\n<p>The algorithm that the Ark network uses is, as you may have already figured out, delegated Proof of stake, which makes transaction processing time near-instant. In comparison to Lisk, which has 101 delegates, Ark allows 51 witnesses to validate transactions and generate blocks.<\/p>\n<p>One more essential difference between Ark and Lisk is that the nodes on Lisk vote for 101 delegates, while on Ark, you may vote only for one of 51.<\/p>\n<h2>Conclusion<\/h2>\n<p>Blockchain has become a remedy for an unreliable financial system, and a promising heir to the throne in terms of a globally-adopted financial relationship provider. Transparency and security became possible and easy to implement with user consensus within the blockchain network.<\/p>\n<p>The first ever developed blockchain — Bitcoin — functions according to a Proof of work consensus: nodes solve NP-class problems, which requires much computational power. This makes the mining process and maintaining the node quite a money-consuming process in comparison with Proof of stake protocol.<\/p>\n<p>Working on a blockchain that follows Proof of stake consensus, nodes don’t need to be powerful enough for mining. Instead, the stake plays a defining role. The bigger the stake the user owns, the higher the possibility of mining the block first.<\/p>\n<p>If the Bitcoin network solves its scalability issue with the <a href=\"https:\/\/applicature.com\/blog\/lightning-fast-bitcoin-transactions\">Lightning Network<\/a>, Vitalik Buterin is currently working on delegated Proof of stake consensus for the Ethereum Blockchain.<\/p>\n<p>What differentiates PoS from DPos is that in PoS, nodes with a bigger stake get transactions for verification in random order, but DPoS expects the community to vote for a certain number of delegates.<\/p>\n<p>Nodes who become delegates as a result of a real-time voting should obey the rules of the network and keep it secure. Only these nodes have the right to validate transactions and generate blocks, thereby receiving rewards in crypto.<\/p>\n<p>In case this article left you with any questions we didn’t clarify, please contact the <a href=\"http:\/\/applicature.com\">Applicature<\/a> consulting team.    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the twenty-first century, we no longer need banks to verify our transactions. We also don’t need them as third parties, as computational powers are no longer a problem. How did this come to pass? It’s our pleasure to reveal all the necessary information on protocol consensus types and their differences. Transactions on Blockchain It [&hellip;]<\/p>\n","protected":false},"author":15,"featured_media":3052,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,155,168,195,280],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What Is DPoS, and How Does It Work? - Applicature<\/title>\n<meta name=\"description\" content=\"There is no need to create a direct payment channel and lock a deposit to beat the annoying scalability issue. Turning to DPoS will leave this issue behind.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"DPoS: Delegate and Conquer\" \/>\n<meta property=\"og:description\" content=\"There is no need to create a direct payment channel and lock a deposit to beat the annoying scalability issue. Turning to DPoS will leave this issue behind.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-12-07T10:01:39+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:29:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/DPoS-Delegate-and-Conquer.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"DPoS: Delegate and Conquer\" \/>\n<meta name=\"twitter:description\" content=\"There is no need to create a direct payment channel and lock a deposit to beat the annoying scalability issue. Turning to DPoS will leave this issue behind.\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/DPoS-Delegate-and-Conquer.png\",\"width\":1024,\"height\":535,\"caption\":\"DPoS Delegate and Conquer\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/\",\"name\":\"What Is DPoS, and How Does It Work? - Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/#primaryimage\"},\"datePublished\":\"2018-12-07T10:01:39+00:00\",\"dateModified\":\"2019-08-01T12:29:55+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\"},\"description\":\"There is no need to create a direct payment channel and lock a deposit to beat the annoying scalability issue. Turning to DPoS will leave this issue behind.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/dpos-delegate-and-conquer\/\",\"name\":\"DPoS: Delegate and Conquer\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\",\"name\":\"Kateryna Hanko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Kateryna Hanko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3046"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/15"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3046"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3046\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/3052"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3046"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3046"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3046"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}