{"id":3054,"date":"2018-12-18T13:34:05","date_gmt":"2018-12-18T13:34:05","guid":{"rendered":"https:\/\/applicature.com\/?p=3054"},"modified":"2019-08-01T12:28:16","modified_gmt":"2019-08-01T12:28:16","slug":"can-zk-snarks-and-zk-starks-solve-privacy-issues","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues","title":{"rendered":"zk-SNARKS and zk-STARKS: Zero-knowledge Proofs Description and How Do zk-SNARKS Work"},"content":{"rendered":"<p>Along with the numerous advantages of the Internet from which we can benefit, privacy is at risk when using it for social media or business purposes.<\/p>\n<p>Around 90 million Facebook clients suffered damage from the data of Cambridge Analytica. <em>The Wall Street Journal<\/em> stated that this is just the beginning, and the results are expected to grow.<\/p>\n<p>The Equifax data breach revealed private user information on social media channels. Thus, dates of birth for the majority of the population were exposed. The data of more than 55 million customers was also shared because of the Uber hack.<\/p>\n<p>The security issues are obvious.<\/p>\n<h2>Confidentiality on Blockchain<\/h2>\n<p>Cryptocurrencies are primarily focused on the financial market, and offer execution of monetary and value transactions in the <a href=\"https:\/\/applicature.com\/blog\/how-to-become-a-blockchain-developer\">network<\/a>. Blockchain technology enables money-exchange procedures and does not require a trusted third party.<\/p>\n<p>This type of approach can also lead us to the loss or theft of our digital property. It can reveal our personal data or expose us to hacking, which can cause awful results for all parties.<\/p>\n<p>Bitcoin, as a peer-to-peer network, provides access to all available ledger data. As blockchain is characterized by an open and transparent nature, every node has direct access to all records of all transactions that have ever been conducted on the network. In general, each node has the ability to trace any of the records and find out the total amount of Bitcoins in a particular blockchain wallet.<\/p>\n<p>However, conducting a crypto transaction makes pseudonymity impossible. It reveals some of the data of the wallet owner, which can lead to a loss of financial security.<\/p>\n<p>Blockchain technology lacks confidentiality, which has caused some difficulties with cryptocurrency acceptance. Privacy is a decisive factor that interferes with the implementation of its full potential.<\/p>\n<h2>The New Game-Changers: zk-SNARKS and zk-STARKS<\/h2>\n<p>Today, two leading technologies are offering their cryptocurrencies — <em>Monero<\/em> and <em>ZCash<\/em> — and are striving to solve protection issues. Monero uses the Ring Confidential signature technology. In contrast, Z-Cash takes advantage of zk-SNARK (Zero-knowledge scalable transparent argument of knowledge), a technology that provides the ability to conduct anonymous transactions.<\/p>\n<p>zk-STARKs aim to provide fast, scalable solutions to ensure financial security. In this way, transaction encryption is possible. zk-STARKs were listed as one of the 10 Breakthrough Technologies of 2018. The fact that such widely-known organizations as R3 and Ethereum have already started to implement zk-STARKs in their use cases is proof of the high potential of zk-SNARKS.<\/p>\n<p>Shafi Goldwasser, Silvio Micali, and Charles Rackoff created ZKPs in the 1980s. They’re exploring systems with which users can prove data by stating that they have knowledge of certain data without exposing it.<\/p>\n<p>zk-SNARKs are built on Black2b cryptography that provides the ability to verify knowledge through one of the parties with ring-signature verification. As of today, only Zcash uses this technology.<\/p>\n<p>The features of a Zero-knowledge proof:<\/p>\n<ul>\n<li>Completeness: a verifier can be convinced in the true data by an honest prover.<\/li>\n<li>Soundness: if the prover lies, the verifier will know it.<\/li>\n<li>Zero-Knowledge: if the statement is true, the verifier won’t find out what the statement actually is.<\/li>\n<\/ul>\n<p>zk-SNARK (zero-knowledge Succinct Non-Interactive ARgument of Knowledge) needs to be:<\/p>\n<ul>\n<li>Zero-knowledge: if the statement is true, a verifier does not learn anything beyond the fact that the statement is true.<\/li>\n<li>Succinct: The size of the proof needs to be small enough to be verified in a few milliseconds.<\/li>\n<li>Non-Interactive: Only one set of information is sent to the verifier for verification, therefore there is no back and forth communication between the prover and verifier.<\/li>\n<li>Argument: A computationally soundproof: soundness holds against a prover that leverages polynomial-time, i.e. bounded computation.<\/li>\n<li>Knowledge: The proof cannot be constructed without access to the witness (the private input needed to prove the statement).<\/li>\n<\/ul>\n<p>Smart contracts have a self-executing nature. To conduct a transaction, a sender has to transfer money to a receiver. After this, a smart contract can implement the transfer. However, some data is better to keep encrypted, to allow only the sender and receiver to trace it. ZKP helps to conduct a transaction and avoid revealing the participants, currency and sent amount.<\/p>\n<p>It is worth saying that some groups can track the transactions of the largest wallet owners. However, they can only minimize the list of wallet owners for several individuals. There is no possibility of identifying the real wallet owner.<\/p>\n<h2>Zero-Knowledge Proofs<\/h2>\n<p>Before the appearance of ZKPs, a prover could be malicious and could cheat a verifier. Shafi Goldwasser, Silvio Micali, and Charles Rackoff questioned the true intentions of the verifier. They thought about how to reveal whether or not a verifier is telling the truth, and whether a prover can trust him\/her.<\/p>\n<p>To protect ourselves, we must first set a strong password and send it to the server. Then, the server hashes the password and checks to see whether it is correct. If someone tries to log in, the website will ask for a password. In case of attack, the password is compromised, and the results can be dire.<\/p>\n<p>Zero-knowledge proofs provide a tool to help avoid such a scenario.<\/p>\n<p>ZKP consists of two players: <em><strong>a prover<\/strong> <\/em>and<em><strong> a verifier<\/strong><\/em>. The verifier has to convince the prover that he\/she knows certain data of a secret item, but he\/she doesn’t need to say any information about it.<\/p>\n<p>Let’s imagine that program C possesses two parameters: x and w. The first one is public, and the other contains secret data. The result can be either true or false. The first player has to prove that he\/she knows secret witness w, so C(x,w) is true.<\/p>\n<p>If someone just wants to prove that he or she knows a secret piece of information without telling it to anyone, zk-SNARK is the best solution.<br \/>\nzk-SNARK has three inputs: G, P, and V.<\/p>\n<p>G has a secret parameter, and the program creates two public keys: a proving key and a verification key. These inputs are open, and can be created only once.<\/p>\n<h3>Proof vs. Proof of Statement<\/h3>\n<p>With ZKP, we can prove two types of data: <em>proof of the fact<\/em> and <em>proof of knowledge<\/em>.<\/p>\n<p>Proofs of fact are the well-known truths that a user wants to prove with ZKP: for example, whether data B belongs to group C.<\/p>\n<p>Proof of knowledge is a way of stating that you have knowledge of a particular item without exposing any detail on it.<\/p>\n<p>Remember that proving facts and proving knowledge are different, so the solutions to them can be completely different, too. The cryptocurrency world is based on “proof of knowledge,” as it gives no proofs to its users, so they must work on the basis of trust.<\/p>\n<p>There is only the possibility to transform a particular fact into the correct parameter, and to prove it only after this step. The commonly-accepted form is “quadratic arithmetic program” (QAP), which is set to transform the code of a function.<\/p>\n<p>Along with this function, users are provided with the ability to convert a fact into a QAP with input to the code and generate a solution, which is also called a “witness”.<\/p>\n<h2>The Difference Between zk-STARKs and zk-SNARKs<\/h2>\n<p>The more developed version of zk-SNARKS is called zk-STARKs (Zero-Knowledge Succinct Transparent Argument of Knowledge). It was created by Eli-Ben Sasson, a professor at the Technion-Israel Institute of Technology. He issued a special document that describes a faster solution in comparison to zk-SNARKS.<\/p>\n<p>zk-SNARKs use public-key cryptography for safety, which means that they demand a leaner symmetric cryptography and collision-resistant hash functions. It also excludes some procedures of zk-SNARKs that need more money investments and are more vulnerable to attacks. zk-STARKs offer a set of solutions to surpass zk-SNARKs.<\/p>\n<p>For zk-STARKs, we do not need a trusted setup that decreases money and time resources spent. The main differences between zk-SNARKS and zk-STARKs are:<\/p>\n<ul>\n<li>The complexity of the arithmetic circuit. In zk-SNARK and zk-STARK technologies, the code is generated in such a form as to be broken down into circuits and computed.<\/li>\n<li>The complexity of communication. With the increased complexity of the computation, the communication complexity of the zk-SNARK increases linearly, as well. zk-STARKs develop in the opposite way, and increase slowly as the computation size grows, which is the great advantage zk-STARKs in comparison to zk-SNARKs.<\/li>\n<li>the complexity of the prover. zk-STARK is 10 times faster than zk-SNARK.<\/li>\n<li>the complexity of the verifier. With the growth in computation size, zk-STARK enlarges slightly. On the other hand, SNARK needs less time<\/li>\n<li>for proof of confirmation than STARK. For example, STARK takes up to 100 ms to confirm, and SNARK only needs up to 10 ms.<\/li>\n<\/ul>\n<p>One more thing to consider is that zk-SNARK is difficult to apply at the complexity of the proofs scale.<\/p>\n<p>The Trusted Execution Environment(TEE) allows the offloading of secret computations in blockchain-based networks. TEE technologies — for example, Intel’s Software Guard Extensions (SGX) — isolate code execution, remote attestation, secure provisioning, and safe storage of data. Moreover, applications that use TEE are highly protected from hackers.<\/p>\n<h3>Voting<\/h3>\n<p>One more case that is definitely taking an advantage of ZKPs is <em><strong>voting<\/strong><\/em>. The voting procedure is well-known to every citizen of any country that has ever participated in a presidential election. A person endowed with voting rights chooses, in his or her opinion, the most suitable candidate from the others.<\/p>\n<p>However, this requires personal verification, so many people are afraid of being judged for their choice. ZKP provides the option to vote faster, cheaper, and anonymously.<\/p>\n<h2>ZKP in Cryptocurrency<\/h2>\n<p>The Zcash cryptocurrency was developed by Zerocoin Electric Coin Company in September 2016. Zcash is the first cryptocurrency that applied ZKP to blockchain technology. This cryptocurrency provides fast, totally secure transactions without sharing data (for example, addresses or location) with anyone.<\/p>\n<p>Zcash integration in Ethereum is an advantageous way of entering the Metropolis phase for Ethereum. Zooko Wilcox, Chief Developer at Z-Cash, presented at DevCon2 in Shanghai, where he described three methods of zk-SNARK application to Ethereum:<\/p>\n<ol>\n<li>Baby Zoe (Zoe = Zcash on Ethereum). This is about adding a zk-SNARK pre-compiler on Ethereum and creating a Zcash smart contract on the platform. It helps to determine whether Ethereum will allow the creation of a zk-SNARK on top of its network.<\/li>\n<li>Integration of Ethereum computability within Zcash.<\/li>\n<li>The Alchemy project was designed to establish cooperation between two blockchains. It can be implemented by cloning BTC Relay, an Ethereum script that provides a Bitcoin light client.<\/li>\n<li>Zero-knowledge proof offers an open and advantageous space for transaction implementation. The verification algorithm consists of building blocks that are included in Ethereum as precompiled contracts.<\/li>\n<\/ol>\n<p>The generator runs out of the network to generate a proving key and a verification key. The prover establishes a proof with the proving key. This can also be implemented off-chain.<\/p>\n<p>The verification algorithm is run along with the proof, the verification key, and the public parameters, which are added as the input data.<\/p>\n<p>Let’s find out how zk-SNARKs can solve privacy issues on the network. A token contract has a mapping from addresses to balances:<\/p>\n<pre lang=\"“Java\" script=\"\" line=\"“1&quot;\" class=\"\">mapping (address =&gt; uint256) balances<\/pre>\n<p>Now, let’s keep the same code, replacing the balance with the hash of the balance:<\/p>\n<pre lang=\"“Java\" script=\"\" line=\"“1&quot;\" class=\"\">mapping (address =&gt; bytes32) balance Hashes<\/pre>\n<p>In this way, we cannot hide the addresses of users sending or receiving a transaction; only the balance and amount. This is also called a confidential transaction.<\/p>\n<p>zk-SNARKs are used to transfer tokens from one address to another when one is generated by the sender and the other by the receiver.<\/p>\n<p>As a rule, proving the size value of a transaction requires parameter verification:<\/p>\n<pre class=\"lang:js decode:true\">balances[fromAddress] &gt;= value\r\nRemember that the hashes have to match the balances. Here is the program with x and w - the public and private inputs:\r\nfunction senderFunction(x, w) {\r\nreturn (\r\nw.senderBalanceBefore &gt; w.value &amp;&amp;\r\nsha256(w.value) == x.hashValue &amp;&amp;\r\nsha256(w.senderBalanceBefore) == x.hashSenderBalanceBefore &amp;&amp;\r\nsha256(w.senderBalanceBefore - w.value) == x.hashSenderBalanceAfter\r\n)\r\n}<\/pre>\n<p>The program below is the receiver’s:<\/p>\n<pre lang=\"“Java\" script=\"\" line=\"“1&quot;\">function receiverFunction(x, w) {\r\nreturn (\r\nsha256(w.value) == x.hashValue &amp;&amp;\r\nsha256(w.receiverBalanceBefore) == x.hashReceiverBalanceBefore &amp;&amp;\r\nsha256(w.receiverBalanceBefore + w.value) == x.hashReceiverBalanceAfter\r\n)\r\n}<\/pre>\n<p>The program checks the match between the balance, the value, and all hashes:<\/p>\n<pre lang=\"“Java\" script=\"\" line=\"“1&quot;\" class=\"\">function transfer(address _to, bytes32 hashValue, bytes32 hashSenderBalanceAfter, bytes32 hashReceiverBalanceAfter, bytes zkProofSender, bytes zkProofReceiver) {\r\nbytes32 hashSenderBalanceBefore = balanceHashes[msg.sender];\r\nbytes32 hashReceiverBalanceBefore = balanceHashes[_to];\r\n\r\nbool senderProofIsCorrect = zksnarkverify(confTxSenderVk, [hashSenderBalanceBefore, hashSenderBalanceAfter, hashValue], zkProofSender);\r\n\r\nbool receiverProofIsCorrect = zksnarkverify(confTxReceiverVk, [hashReceiverBalanceBefore, hashReceiverBalanceAfter, hashValue], zkProofReceiver);\r\n\r\nif(senderProofIsCorrect &amp;&amp; receiverProofIsCorrect) {\r\nbalanceHashes[msg.sender] = hashSenderBalanceAfter;\r\nbalanceHashes[_to] = hashReceiverBalanceAfter;\r\n}\r\n}<\/pre>\n<p>For appropriate transaction implementation from the confidential side, one has to address a number of issues:<\/p>\n<ul>\n<li>Users have to track their balances client-side since they lose the balance the tokens can be returned. The balances could be stored encrypted on-chain with a key got from the signing key.<\/li>\n<li>Balances need to use 32 bytes of data and encode entropy in part of the balance to avoid reversing hashes to reveal balances.<\/li>\n<li>Always remember to double-check the address with which you are conducting the transaction.<\/li>\n<li>Communication is necessary in order to carry out the transaction. Remember that some parties may have a system to implement the transaction, so it can be accomplished as a “pending incoming transaction.”<\/li>\n<\/ul>\n<p>Actually, the biggest challenge facing zk-SNARK technology trust conditions in the setup phase. Users can’t find out whether the setup phase has been ever compromised. So the main appeal is to be fair and build honest relations within the network.<\/p>\n<h2>Conclusion<\/h2>\n<p>Privacy is not a problem of blockchain anymore with Zero-Knowledge Proof technology. ZKPs allow nodes to prove data without exposing it. The following companies have already applied ZKP into their technologies:<\/p>\n<ul>\n<li><strong>QED-it<\/strong> — an Israeli company that performs transactions to prove particular data without sharing it. Zero-knowledge proof allows auditing of financial institutions.<\/li>\n<li><strong>NuCypher<\/strong> — an ICO project that specializes in proxy re-encryption. With ZKP, NuCypher offers the use of are-encrypted key instead of a public key. This makes it possible to share data safely with the re-encrypted key.<\/li>\n<li>Nugget<strong>s<\/strong> provides the ability to secure the data of online shops by encrypting information through ZKP technology.<\/li>\n<\/ul>\n<p>Do you want to benefit from ZKP technology, too? Contact <a href=\"http:\/\/applicature.com\">Applicature<\/a> for information specific to your case!    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Along with the numerous advantages of the Internet from which we can benefit, privacy is at risk when using it for social media or business purposes. Around 90 million Facebook clients suffered damage from the data of Cambridge Analytica. The Wall Street Journal stated that this is just the beginning, and the results are expected [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":3129,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,156,168,258],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"Do you still have privacy issues on blockchain? zk-SNARKS and zk-STARKS provide the ability to encrypt transactions while still remaining valid when added to the blockchain.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"Do you still have privacy issues on blockchain? zk-SNARKS and zk-STARKS provide the ability to encrypt transactions while still remaining valid when added to the blockchain.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-12-18T13:34:05+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:28:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/ZK-SNARKS-and-ZK-STARKS.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/ZK-SNARKS-and-ZK-STARKS.png\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/ZK-SNARKS-and-ZK-STARKS.png\",\"width\":1024,\"height\":535,\"caption\":\"ZK-SNARKS and ZK-STARKS\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/#primaryimage\"},\"datePublished\":\"2018-12-18T13:34:05+00:00\",\"dateModified\":\"2019-08-01T12:28:16+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"Do you still have privacy issues on blockchain? zk-SNARKS and zk-STARKS provide the ability to encrypt transactions while still remaining valid when added to the blockchain.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/can-zk-snarks-and-zk-starks-solve-privacy-issues\/\",\"name\":\"zk-SNARKS and zk-STARKS: Zero-knowledge Proofs Description and How Do zk-SNARKS Work\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3054"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3054"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3054\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/3129"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3054"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3054"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3054"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}