{"id":3078,"date":"2018-12-12T11:12:02","date_gmt":"2018-12-12T11:12:02","guid":{"rendered":"https:\/\/applicature.com\/?p=3078"},"modified":"2019-08-01T12:28:36","modified_gmt":"2019-08-01T12:28:36","slug":"new-era-on-ethereum-starts-with-casper","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper","title":{"rendered":"A New Era on Ethereum Starts With Casper"},"content":{"rendered":"<p>On May 8, 2018, the first version of PoS Casper came out on <a href=\"https:\/\/github.com\/ethereum\/casper\/releases\/tag\/v0.1.0\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub<\/a>, making the first step toward the so-called switch from Proof of Work consensus protocol to Proof of Stake Casper. However, as stated by Vitalik Buterin and Virgil Griffith in Casper FFB (the Friendly Finality Gadget) <a href=\"https:\/\/arxiv.org\/pdf\/1710.09437.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">white paper<\/a>, it’s a hybrid consensus. PoW is not going to vanish — it’s just layered over by a mix of PoS and Benzitile fault-tolerant philosophy to enhance security. So, what is Casper PoS, and what does it bring to the Ethereum network? Let’s find out together.<\/p>\n<h2>Why Casper?<\/h2>\n<p>With the goal of becoming a worldwide adopted decentralized platform for DApps creation, the Ethereum team is getting rid of the pitfalls standing in its way:<\/p>\n<ul>\n<li>scalability<\/li>\n<li>centralization<\/li>\n<li>costs<\/li>\n<li>security<\/li>\n<li>potential<\/li>\n<\/ul>\n<h3>Scalability<\/h3>\n<p>The blockchain is a distributed ledger by nature, which means all participants hold a copy of all blocks on their computers. As the number of blocks is constantly growing, this slows down the work of the platform. Miners get their rewards, but not immediately, developers wait for the smart contracts to be deployed, and ordinary users don’t get ETHs in their wallets as fast as they should.<\/p>\n<p>In terms of the processing time, Proof of Stake is more effective: on the EOS blockchain, for example, 100,000 transactions are processed per second.<\/p>\n<p>To speed up the platform, Vlad Zamfir suggested using sharding. The principle of <a href=\"https:\/\/applicature.com\/blog\/is-raiden-a-new-scaling-competitor\">sharding<\/a> allows the processing of transactions concurrently, having shared them among the shard chains beforehand. Vlad points out that sharding can only be implemented on Proof-of-Stake protocol.<\/p>\n<p>Several technologies have been designed to fix this: Plasma, Plasma Cash, and the Raiden Network. How, exactly, will the implementation of these three technologies manage <a href=\"https:\/\/applicature.com\/blog\/blockchain-scalability\">scalability<\/a>? You can find out in the <a href=\"https:\/\/applicature.com\/blog\/is-raiden-a-new-scaling-competitor\">Applicature blog<\/a>.<\/p>\n<h3>Centralization<\/h3>\n<p>It is no secret that Bitcoin isn’t as decentralized as it seems to be. The hashrate is divided between three pools. Ethereum has faced the same issue:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-3089 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04.png\" alt=\"hashrate distribution of mining pools\" width=\"1100\" height=\"575\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04-132x69.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04-350x183.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04-500x261.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04-768x401.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04-600x313.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04-120x63.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-04-300x157.png 300w\" sizes=\"(max-width: 1100px) 100vw, 1100px\" \/>In PoW, the pools with higher hashrates get an additional advantage: the mining gets cheaper. This problem will be fixed by implementing Casper on Ethereum.<\/p>\n<p>This has certain implications on blockchain user comfort, as the consolidated mining pool has the ability to fend off a coordinated attack (51% attack). There is a really small probability that the pool will succeed, as the final decision is always on every single miner; but even the possibility that someone has to coordinate miners makes some users feel uncomfortable with its continued usage in more valuable spheres.<\/p>\n<h3>Costs<\/h3>\n<p>What inspires people to turn to PoS consensus the most is the fact that electrical expenses will no longer be a thing. From now on, a minimum stake of 32 ETH will include you in a validator queueing pool and allow validating blocks, depending on your stake percentage.<\/p>\n<h3>Security<\/h3>\n<p>One more concern hindering Ethereum-based governance programs is security. This is why Vitalik Buterin came up with the Casper protocol, which will ensure security on Ethereum with the help of each node.<\/p>\n<p>Protection of the system from malicious users is ensured by the <a href=\"https:\/\/etherworld.co\/2017\/04\/20\/minimal-slashing-condition-in-ethereum\/\" target=\"_blank\" rel=\"noopener noreferrer\">slashing<\/a> instrument, which doesn’t allow double-spending. Validators are interested in keeping the network alive, as empty stakes and double-spending will cause them to lose their stakes irreversibly.<\/p>\n<h3>Potential<\/h3>\n<p>The final reason for turning to Casper is full implementation of Proof of Stake with empty-stake and double-spending prevention, high-level responsibility of validators, and fast transaction processing. All of these factors will make Ethereum a super-computer for DApps creation and for launching massive projects in the future.<\/p>\n<h2>PoW vs. PoS<\/h2>\n<p>The Ethereum blockchain, like the Bitcoin network, is supported by its users: miners. Both platforms use PoW as a consensus algorithm, so let’s review PoW, which Ethereum is going to change to PoS, and the differences between the two.<\/p>\n<h3>PoW:<\/h3>\n<ul>\n<li>In order to validate transactions and pack them in a block that will be added to the ledger, miners solve mathematical puzzles. However, they are only able to do this with GPU and ASIC processors.<\/li>\n<li>As network complexity and the number of transactions is constantly growing, the need for electricity grows, as well, which is quite costly. In 2017, for example, Ethereum miners consumed the same amount of electricity as Cyprus and Cambodge.<\/li>\n<li>After a packed block gets into the network, thousands of miners verify it. Later, it is added to the distributed ledger as part of the blockchain.<\/li>\n<\/ul>\n<p>The obvious disadvantage of PoW is its drastic electricity consumption. Research performed by <a href=\"https:\/\/digiconomist.net\/bitcoin-electricity-consumption\" target=\"_blank\" rel=\"noopener noreferrer\">Digiconomist<\/a> has shown that by 2020, miners on PoW-based platforms will consume as much electricity as the whole planet does now.<\/p>\n<p>The need to gain more computational power is leading to the centralization of the blockchain, which itself is decentralized. A group of miners who together own more than 50% of the computational power operating on the blockchain can cause a 51 attack. As of 2018, 50% of the hash rate was split up between three pools. If they choose to collude, they could perform a 51% attack and destabilize the network.<\/p>\n<h3>PoS:<\/h3>\n<ul>\n<li>Instead of using computational power to mine the block, users deposit their stake (lock their coins). The bigger stake, the higher the possibility of mining the next block. Basically, this is the same costly approach as in PoW (the rich become richer); however, users do not use electricity.<\/li>\n<li>The more stake you possess, the weightier your vote.<\/li>\n<li>Miners get rewards if the block is verified by other users.<\/li>\n<li>The network is protected from a 51% attack, as the nodes that colluded will suffer from it more than the network.<\/li>\n<\/ul>\n<p>One of the main disadvantages of PoS is the situation of “nothing at stake,” which means that a node without coins finds an empty block in a sidechain without spending any computational power, but gets a reward for it. This could potentially lead to double-spending.<\/p>\n<h2>PoS vs. Casper<\/h2>\n<p>There are two projects that together enable a smooth transit from PoW to PoS consensus:<\/p>\n<ul>\n<li>FFG (a finality-friendly gadget), also called Vitalik’s Casper. This is a hybrid consensus containing both PoW and PoS. The network will keep functioning by means of mining, but every fiftieth block will be a checkpoint with PoS implementation — a finalized block that is impossible to rewrite or change.<\/li>\n<li>CBC (correct by construction), or “Ghost;” also called Vlad’s Casper. This version offers complete PoS use without miners. In CBC, validators choose the security level by themselves; for example, validator A may set four votes to validate the block, node B may set six nodes, and so on. With CBC, the finalization of the blockchain occurs gradually, unlike in FFG, where it occurs at a certain block.<\/li>\n<\/ul>\n<p>An ordinary PoS consensus has structural and economic differences from Casper. In contrary to PoS, Casper has a protection from the “nothing at stake” problem, as validators deposit (block) their stake. If it turns out that a validator has verified an empty fork chain, he\/she loses the deposit, plus an equal sum for enabling double-spending on the network.<\/p>\n<p>Casper requires active participation from the validator. If a validator goes offline, he\/she consequently loses a portion of their ETHs.<\/p>\n<p>In FFG, there is the notion of “supermajority.” A block is only valid if two-thirds of the whole network has verified it. If a forked chain occurs, one-third of the validators will be sacked; but as a bonus, the validator who detected it gets 4% of the sum.<\/p>\n<h2>PoS Casper As Hybrid Protocol<\/h2>\n<p><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/OaUOZxxbIz8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"><\/iframe><br \/>\nIn an interview with Vitalik Buterin by the <a href=\"https:\/\/www.cigionline.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Center for Intellectual Governance Innovation<\/a>, he said that 70% of mining is done in China, and 70% of mining is done with hardware produced by a single manufacturer — which is, basically, run by several people who eventually own a major stake. For this and a bunch of other reasons, Vitalik claims PoS to be more efficient for network security.<\/p>\n<p>One more thing: colluding on an attack is impossible when the network follows PoW. This is why detecting malicious nodes becomes incredibly hard. In the case of a PoS network, the system will track the nodes that verify suspicious transactions and will blame them for messing with the protocol. In such case, those nodes will lose their deposited stakes.<\/p>\n<p>Let’s take a closer look at what Casper consists of and what if offers.<\/p>\n<h2>Ethereum Casper Protocol<\/h2>\n<p>Casper’s version 2.0 consists of three chains:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-3088 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05.png\" alt=\"Casper Protocol Ethereum Chains\" width=\"1100\" height=\"575\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05-132x69.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05-350x183.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05-500x261.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05-768x401.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05-600x313.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05-120x63.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-05-300x157.png 300w\" sizes=\"(max-width: 1100px) 100vw, 1100px\" \/>Currently, Ethereum users mine blocks by solving an NP-class puzzle with the help of their computational power.<\/p>\n<p>In order to become a validator in a new Beacon (PoS) chain, anyone in the network can deposit 32 ETH and start contributing to the security of the network.<\/p>\n<p>The Beacon chain will play two basic roles in the updated Ethereum network: it will be the main chain on Ethereum following PoS consensus, and it will link up all shard chains. The decision of which blocks must be added to the main chain will be also made on the Beacon chain.<\/p>\n<p>Shard chains will store and share transactions, and will play a role in the scaling solution on Ethereum.<\/p>\n<h3>Shard Chains<\/h3>\n<p>Theoretically, sharding implementation makes transaction processing faster. However, in reality, this tool is extremely difficult to apply due to a number of issues:<\/p>\n<ul>\n<li>There is no mechanism for tracking which node processes a certain transaction.<\/li>\n<li>An algorithm of trust between nodes hasn’t been developed, which contradicts the rules of the blockchain: the nodes have to come to a certain consensus in order to trust each other.<\/li>\n<li>Sharding can find its implementation only on PoS-based blockchains.<\/li>\n<\/ul>\n<p>Discussions on the sharding mechanism became popular when it was mentioned as one of the methods of beating the scalability issue. However, the Ethereum blockchain is the only one that is ready to implement this technology, even though it has become so difficult.<\/p>\n<p>Exactly how sharding will become part of the Ethereum platform has not been revealed yet. However, you can find more precise details on how it works in this article about the <a href=\"https:\/\/applicature.com\/blog\/is-raiden-a-new-scaling-competitor\">Raiden Network<\/a>.<\/p>\n<h3>Validators and Their Responsibilities<\/h3>\n<p>A future consensus protocol of Ethereum is a smart contract that implements and monitors a Proof of stake consensus protocol.<\/p>\n<p>Who are validators, what is their commitment, and how does mining work with Casper? Let’s figure out the info one bit at a time.<\/p>\n<p>Users who have made their deposits of 32 ETH and become validators have two voting responsibilities: propose and attest. The weight of each vote will be defined by the amount of stake the validator owns. The bigger stake, the higher the voting priority.<\/p>\n<h4>The Proposer Validator<\/h4>\n<p>In Casper 2.0, proposer validators play a crucial role: basically, their responsibility is to pack and suggest a block that contains cross-links to shard chains. This block will pass two rounds of voting by attester validators, and then will be included in the Beacon chain.<\/p>\n<p>Finally, the proposer validator connects to a Beacon chain node and proposes a block by calling an RPC function.<\/p>\n<h4>The Attester Validator<\/h4>\n<p>Attesters are users who have the right to sign off on proposed blocks, or, in other words, vote for them. After the attester signs off on a block, he\/she needs to validate it so the block is included in the ledger and heads the chain (becomes a valid block on the public blockchain).<\/p>\n<p>A validated block means that the attester has already processed all transactions or events; he\/she should also call for a fork-choice rule.<\/p>\n<p>Implementing two rounds of voting, and penalizing maleficent validators will be a responsibility of Casper.<\/p>\n<p>These two rounds of voting will build consensus on the Ethereum blockchain. Let’s take a look at exactly how this validation works:<\/p>\n<h4>An Ideal Validation<\/h4>\n<p>A proposer validator chooses a block to be verified, or chooses an attester validator to choose the block that should be verified. As soon as the chosen block gets its two-thirds of the votes, it is a prepared block which will be voted upon again in a commitment round (second round of voting). When the prepared block passes the second round of voting, it is finalized to the blockchain. This validation process will continue on any appending block on the Ethereum blockchain.<\/p>\n<p>When voting, validators pay their two-thirds stake to submit their vote; however, if verified, the money is paid back. This incentivizes validators to choose the blocks that are most likely to be added to the blockchain.<\/p>\n<p>Moreover, when validators vote, they reference their last prepared commitment block — these are the links of the blockchain.<\/p>\n<h2>Implementation<\/h2>\n<p>The first mention of Casper implementation on Ethereum goes back to 2017, which followed with a testing period in 2018. The most frequently-asked question is how the Casper team is going to transfer the whole network to another consensus.<\/p>\n<p>Vitalik Buterin mentioned that the implementation process becomes possible with the help of decreased rewards for mining. This will cause a mining freeze and make users concentrate on staking in further work on Ethereum.<\/p>\n<h2>Possible Risks<\/h2>\n<p>When Casper implementation reaches its final point, it will kill the era of mining on Ethereum, the market for ASIC-processor users, and will drastically change the economy of the platform.<br \/>\nDespite slashing, which will protect the network from messing with the system, there is still the threat of Ethereum becoming centralized. After Casper implementation, only 200-300 nodes will enforce the network, which can form a “supermajority” and start dictating their own rules to the network.<\/p>\n<p>POS is more effective than PoW in terms of resource usage, and is more stable against a 51% attack;, however, it doesn’t promise full decentralization.<\/p>\n<p>On Bitcoin, the biggest pools call the tune; on Ethereum after Casper implementation, the power will be in the hands of those with the biggest stake. However, the necessary stake decreases to 32 ETH, which will increase the number of validators and prevent centralization.<\/p>\n<h2>Conclusion<\/h2>\n<p>Users of the Ethereum platform faced serious scalability issues when the CryptoKitties game gained popularity and the network had to process a huge number of transactions fast. This brought Ethereum’s creators to the point where the network needed to solve the issue, which ended at the idea of turning away from the current PoW consensus protocol and toward PoS. Vitalik Buterin and Vlad Zanfir started developing their own version of PoS, to implement it on Ethereum as the biggest platform for DApp creation.<\/p>\n<p>As it was said before, Casper is a smart contract on Ethereum that monitors Proof of Stake consensus.<\/p>\n<p>In order to transition the whole network from PoW to PoS, each fiftieth block will be a checkpoint with PoS implementation. Moreover, the reward for mining will be lower, so users of the network will concentrate on staking instead of mining.<\/p>\n<p>All of the changes that Casper implementation brings will follow the ideology of Ethereum. As Vitalik Buterin says, Ethereum isn’t just a project for mining cryptocurrency (Ether); it is a platform for creating decentralized applications.<\/p>\n<p>There is not much information revealed on Casper, even though the testing period has passed. Nevertheless, the <a href=\"https:\/\/applicature.com\/\">Applicature<\/a> consulting team is always ready to answer all of your questions on Casper and its advantages and disadvantages.    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>On May 8, 2018, the first version of PoS Casper came out on GitHub, making the first step toward the so-called switch from Proof of Work consensus protocol to Proof of Stake Casper. However, as stated by Vitalik Buterin and Virgil Griffith in Casper FFB (the Friendly Finality Gadget) white paper, it’s a hybrid consensus. [&hellip;]<\/p>\n","protected":false},"author":15,"featured_media":3087,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,156,168,195,255],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Casper Consensus Protocol on Ethereum Applicature -<\/title>\n<meta name=\"description\" content=\"How is Ethereum going to fix its growing scalability problem? Is Casper sensible, or is this just the next shadowy scaling solution?\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Casper Consensus Protocol on Ethereum\" \/>\n<meta property=\"og:description\" content=\"How is Ethereum going to fix its growing scalability problem? Is Casper sensible, or is this just the next shadowy scaling solution?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-12-12T11:12:02+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:28:36+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-01.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Casper Consensus Protocol on Ethereum\" \/>\n<meta name=\"twitter:description\" content=\"How is Ethereum going to fix its growing scalability problem? Is Casper sensible, or is this just the next shadowy scaling solution?\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Casper-Consensus-Protocol-on-Ethereum-01.png\",\"width\":1024,\"height\":535,\"caption\":\"Casper Consensus Protocol on Ethereum\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/\",\"name\":\"Casper Consensus Protocol on Ethereum Applicature -\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/#primaryimage\"},\"datePublished\":\"2018-12-12T11:12:02+00:00\",\"dateModified\":\"2019-08-01T12:28:36+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\"},\"description\":\"How is Ethereum going to fix its growing scalability problem? Is Casper sensible, or is this just the next shadowy scaling solution?\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/new-era-on-ethereum-starts-with-casper\/\",\"name\":\"A New Era on Ethereum Starts With Casper\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\",\"name\":\"Kateryna Hanko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Kateryna Hanko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3078"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/15"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3078"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3078\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/3087"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3078"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3078"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3078"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}