{"id":3139,"date":"2018-12-24T10:10:49","date_gmt":"2018-12-24T10:10:49","guid":{"rendered":"https:\/\/applicature.com\/?p=3139"},"modified":"2020-09-15T12:34:59","modified_gmt":"2020-09-15T12:34:59","slug":"biggest-hacks-in-history-of-crypto-exchanges","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges","title":{"rendered":"The Biggest Hacks in the History of Crypto Exchanges"},"content":{"rendered":"<p>Despite the fact that the crypto market is now facing not the best times, the Bitcoin <span style=\"font-weight: 400;\">blockchain development company <\/span>still hopes to hit its peak, just like in 2017. Nevertheless, it is gaining more and more new investors, whose first action would be purchasing coins from the stock. There are also new <span style=\"font-weight: 400;\">coin launch platform <\/span>projects coming up to create their wallets and issue new tokens. The thing that unites the entire market and helps it to develop and grow is the cryptocurrency exchange service. However, an exchange being hacked affects all its users and their wallets.<\/p>\n<p>What are the biggest crypto-exchange hacks, and how could they have been prevented?<\/p>\n<h2>Exchange-Hack Statistics<\/h2>\n<p>Surprisingly, it is quite easy to commit cybercrime and get away with billions of dollars worth of cryptocurrency. On 8th July 2018, investors and crypto brokers were startled by tons of headlines claiming that exchanges have a lot of soft spots. <a href=\"https:\/\/www.carbonblack.com\/2018\/06\/08\/june-8-2018-morning-cyber-coffee-headlines-nhl-edition\/\" rel=\"noopener\">Many in the crypto-oriented media<\/a>, including <a href=\"https:\/\/cointelegraph.com\/news\/report-1-1-bln-in-crypto-has-been-stolen-this-year\" rel=\"noopener\">Cointelegraph<\/a>, published the news that <span style=\"color: #ff0000;\"><strong>$1.1 billion<\/strong> <\/span>in crypto had been stolen in the first half if 2018.<\/p>\n<p>In July of this year, Carbon Black published a list of the crypto-hacked spheres that fall prey most often:<\/p>\n<p>[visualizer id=&#8221;3137&#8243;]<\/p>\n<p>According to the biggest crypto portals, the number of attacks has grown rapidly. <a href=\"https:\/\/applicature.com\/\">Applicature<\/a>, a blockchain and DeFi development company, will reveal the reasons, along with the ways hackers have managed to accomplish this.<\/p>\n<h2>Exchange-Hack History<\/h2>\n<p>Since cryptocurrency and blockchain were created, they have experienced a huge number of hacks that have caused enormous losses in funds. Let’s take a look at the exchanges that have faced major hacks, and examine the reasons for these.<\/p>\n<h2>2012: Mt.Gox<\/h2>\n<p>Mt. Gox was the biggest and most popular Bitcoin exchange — which, by the way, came on the market as one of the earliest crypto exchanges. It faced several hacker attacks that ended up losing <strong><span style=\"color: #ff0000;\">1.35 million BTC<\/span><\/strong> for its customers.<\/p>\n<p>Blockchain developer Jed McCaleb, who is also co-founder of Ripple and Stellar, started Mt.Gox as a website for the trading cards “Magic: The Gathering Online”. It later became the Magic the Gathering Online eXchange. It was based in Japan, and was then bought by the Frenchman Mark Karpeles, who, at that time, became the most hated villain in the world of crypto.<\/p>\n<p>From 2013 to 2014, the exchange held 70 percent of all Bitcoins, and was believed to have been the most popular website for selling and buying BTC. However, in 2014, the company went broke and claimed to have lost <strong><span style=\"color: #ff0000;\">850,000 BTC<\/span><\/strong>. At a news conference in Tokyo, Karpeles said that these Bitcoins had disappeared due to a weakness in the system. As a result, there were 25,000 Mt. Gox users who wanted their money back.<\/p>\n<h3>Consequences<\/h3>\n<p>At that time, it was the worst disaster that the Bitcoin <span style=\"font-weight: 400;\">blockchain development company <\/span>had ever faced: the price of Bitcoin crashed dramatically, and some even thought it would be the end of Bitcoin.<\/p>\n<p>In the summer of 2015, Mark Karpeles was arrested and charged with embezzlement and manipulating electronic data. He spent almost a year in jail. However, in 2017, the U.S authorities arrested a Russian suspect, Alexander Vinnik, with the evidence that around 90 percent of the money stolen from Mt.Gox had gone directly to a wallet controlled by Alexander.<\/p>\n<p>A strange thing happened a few days after Mt. Gox collapsed: Mark Karpeles was checking through all the digital wallets he owned, and came across his old wallet, which held 200,000 BTC. What a fortune! At that time, the price of Bitcoin had gone up over $2,000 U.S, which made Mark’s old wallet a gold mine that covered all the money he owed the angry Mt. Gox users.<\/p>\n<h3>What Caused the Biggest Exchange Fail Ever?<\/h3>\n<p>A lot of famous and successful <span style=\"font-weight: 400;\">blockchain development <\/span>companies experience problems. Some manage to fix them, but others fail and go broke. However, in the case of Mt. Gox, it all fully depended on management and the miscalculation of risk. Below are some of the problems that put Mt. Gox under threat of being hacked.<\/p>\n<h4>Lack of VCS<\/h4>\n<p>Version Control Software (VCS) is like a warm coat in winter — a must-have! It monitors all changes made in the database, and determines fraudulent actions, if there are any. With VCS, an IT company can see who made the changes and when he\/she did it, and fix everything in time. Of course, for a <span style=\"font-weight: 400;\">blockchain development <\/span>company whose profit fully depends upon electronic data, lack of VCS can be fatal.<\/p>\n<h4>Lack of a testing policy<\/h4>\n<p>Thinking of the fact that Mt. Gox didn’t have a testing policy for a while, even though it was already the biggest exchange service for crypto, is extremely alarming. The company was literally providing an unsecured service for its customers.<\/p>\n<h4>A bottleneck issue<\/h4>\n<p>Oh, wait! They actually tested the code — with the help of their CEO, Mark Karpeles. He tested all codes coming from the Mt. Gox developers, which stalled the workflow.<\/p>\n<h2>Two Biggest Strikes on Mt. Gox<\/h2>\n<p>With all of the previously-mentioned issues as soft spots, the collapse for Mt. Gox was inevitable. It was only a question of time.<\/p>\n<p>On July 19, 2011, an attacker hacked one of the company’s computers and transferred a huge amount of Bitcoin to the company itself. This caused the biggest dropdown in Bitcoin value ever seen in the system. In a very short time, the Bitcoin price had dropped to one cent in the exchange. See for yourself!<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-3141 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_.png\" alt=\"Bitcoin dropdown on Mt.Gox\" width=\"800\" height=\"510\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_.png 800w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_-132x84.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_-350x223.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_-500x319.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_-768x490.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_-600x383.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_-120x77.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Bitcoin-dropdown-on-Mt.Gox_-300x191.png 300w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>In 2014, users of the exchange service started complaining about the amount of time it took them to conduct a transaction, and the Mt. Gox team decided to conduct a technical check that lasted a few days. When the hack occurred, they became the victims of a malleability attack that caused a loss of <strong><span style=\"color: #ff0000;\">$473 million<\/span><\/strong>. This became the final resting place of the Mt. Gox story, which ended in a bankruptcy announcement.<\/p>\n<h2>2012: BitFloor<\/h2>\n<p>The U.S.-based exchange website and trading platform Bitfloor wasn’t the first, and it won’t be the last that had to shut down because of a hacker attack.<\/p>\n<p>In 2012, when Bitcoin was just gaining in popularity, the servers of BitFloor were compromised, ending in a loss of <strong><span style=\"color: #ff0000;\">24 000 BTC<\/span><\/strong>. At the time of the hack, this was worth <strong><span style=\"color: #ff0000;\">$250,000 U.S<\/span><\/strong>. What luck it didn’t happen in January 2017.<\/p>\n<p>Any crypto exchange hacking attack results in loss of funds. However, every <span style=\"font-weight: 400;\">blockchain development company<\/span> manages it in a different way. But not BitFloor — they closed down in 2013, leaving their customers with nothing.<\/p>\n<h3>What the Hack?<\/h3>\n<p>The attacker compromised servers of the crypto exchange and gained access to backup keys that weren’t encrypted. The actual keys that control wallets were encrypted; however, this didn’t keep BitFloor safe. The hacker signed the transaction, moving funds from BifFloor’s wallet to his\/her own.<\/p>\n<p>Even though Roman Shtylman, founder of BitFloor, made an official statement apologizing for the delays and promising to return all lost funds to their owners, it never happened.<\/p>\n<p>BitFloor made two mistakes, the avoidance of which could have prevent the hack:<\/p>\n<ol>\n<li>Holding data in an encrypted area. Roman Shtylman has admitted this in his official statement to the public.<\/li>\n<li>Keeping a big amount of money in a hot wallet. If BitFloor had used only cold storage, the hack wouldn’t have affected the funds.<\/li>\n<\/ol>\n<h2>2015: Bitfinex<\/h2>\n<p>One of the first crypto exchanges, Bitfinex, was founded in 2012 at a time of worldwide hype for investing in cryptocurrency. Now, Bitfinex is the world’s leading cryptocurrency trading platform. However, it has passed through some rough obstacles on its way to success.<\/p>\n<p>On the 2nd of August, the Bitfinex website went offline, claiming that it had been hacked and was losing approximately <strong><span style=\"color: #ff0000;\">120,000 BTC<\/span><\/strong>, which was worth <strong><span style=\"color: #ff0000;\">$72 million U.S.<\/span> <\/strong>at the time. The hack caused Bitcoin to fall in price by nearly 20 percent.<\/p>\n<p>An ironic thing about the Bitfinex hack was that the security measures taken by the company were the actual reason for the hack. To provide its users with higher security and liquidity, Bitfinex decided to adopt multi-signatures in users’ wallets on the platform.<\/p>\n<h3>How Do Multi-signatures Work?<\/h3>\n<p>Let’s imagine there is a wallet holding <strong><span style=\"color: #008000;\">100 BTC<\/span><\/strong> — that’s a lot of money, isn’t it? You wouldn’t like to lose that much. So, in order to protect your funds, there is a multi-signature technology that enables security for <span style=\"font-weight: 400;\">blockchain development company <\/span>users&#8217; wallets.<\/p>\n<p>The idea is very simple: instead of having one crypto key for a wallet, the user will get three keys. To protect the money, users should create a multisig address that has three crypto keys, and set a rule to get access to the money. It is recommended to have at least two of three keys. Of course, keeping them together would just be the same as having one key. So, the user leaves one of them to him\/herself and puts the second one to a safety deposit box as a backup key. The third key goes to the multisig provider.<\/p>\n<p>Let’s suppose that Alice has a wallet encrypted by multi-signature and wants to buy some coffee, paying for it with money in her wallet. What does she do? She uses her private key, which she always keeps with her, on her phone. But she needs one more key to spend the money in her wallet. A message of the attempt to spend money goes to her multisig provider, which has to verify the transaction. Only after that Alice will get her coffee.<\/p>\n<p>If the phone seems to be stolen, or if there is some suspicious activity detected by the provider, the transaction won’t be verified, and the fraudster will not get his\/her coffee for Alice’s money.<\/p>\n<h3>How Could Multisig Lead to a Hack?<\/h3>\n<p>In 2015, Bitfinex started a partnership with BitGo, and implemented a multisig technology with the condition that Bitshares would keep two of the keys and BitGo would hold one.<\/p>\n<p>With BitGo as additional security, Bitfinex decided not to use cold storage wallets, and instead continued to hold money in hot wallets protected by multisig.<\/p>\n<p>However, the hackers that committed the attack managed not only to conduct invalid <a href=\"https:\/\/applicature.com\/blog\/bitcoin-transaction\" rel=\"noopener\">Bitcoin transactions<\/a> with Bitfinex signatures on them, they also got the signatures of BitGo.<\/p>\n<p>There is no official answer to how, exactly, the hackers did it. However, there are a lot of versions, and one of the most sensible is that the system of cooperation between Bitfinex and BitGo was faulty, so BitGo would sign off any transaction coming from Bitfinex. The only soft point to be considered was Bitfinex’s servers.<\/p>\n<h3>Bitfinex Overcomes the Hack<\/h3>\n<p>The way Bitfinex managed this hacker attack only justifies the saying: What doesn’t kill us makes us stronger.<\/p>\n<p>In an attempt to return all lost funds to customers, Bitfinex issued BFX tokens as an IOU (“I owe you”). This seemed quite fake at the time, and looked as if they were trying to win some extra time. However, on September 1, Bitfinex bought out the first 1.1% of the BFX tokens from the customers in order to pay back the money stolen by the hackers.<\/p>\n<h2>2015: Bitstamp<\/h2>\n<p>Bitstamp is an excellent example of the human factor and curiosity that ends up losing huge amounts of funds for people whose only fault was their trust in the exchange service.<\/p>\n<p>The hackers that attacked Bitstamp sent personal emails and messages via Skype to the users of the platform. This is called a phishing attack. Luka Kodrich, a system administrator at Bitstamp, got the same email, opened it, and downloaded the file it contained. After he did this, it didn’t take hackers a lot of time to steal <strong><span style=\"color: #ff0000;\">19,000 BTC<\/span><\/strong>, worth <strong><span style=\"color: #ff0000;\">$5 million U.S<\/span><\/strong> at that time.<\/p>\n<p>Surprisingly, but the company hasn’t paid the stolen funds back to its users. However, it has strengthened its security system with multisig technology and its partnership with BitGo. It also started keeping funds in cold storage.<\/p>\n<h2>2017: Poloniex<\/h2>\n<p>The cryptocurrency exchange service Poloniex, run by Tristan D’Agosta, who founded it in 2014, is now a worldwide trading platform whose parent company, Circle, has issued USD Coin, a U.S. dollar stable coin.<\/p>\n<p>Poloniex provides an opportunity to trade with BTC, ETH, and USDC pairs, and promises more to come. Things are going fine; however, Poloniex is listed by <a href=\"https:\/\/cointelegraph.com\/news\/crypto-exchange-hacks-in-review-proactive-steps-and-expert-advice\" rel=\"noopener\">Cointelegragh<\/a> as one of the biggest crypto exchange hacks in the history.<\/p>\n<p>So, what happened, and how did the company recover? In May 2017, a hacker found a vulnerability in the code, which meant that if several withdrawals took place at about the same time, they would be processed at the same time. This would cause the balances to go negative, but the transactions in the database would be considered valid.<\/p>\n<p>The security system encountered unusual activity and froze the BTC, which was the right decision.<br \/>\nTristan D’Agosta didn’t state the exact amount of money they had lost, only that the company’s funds were down 12.3 percent down.<\/p>\n<h3>Poloniex Hack Management<\/h3>\n<p>All balances of existing users on Poloniex at the time were reduced by 12.3% in order not to stop activity on the website. Mr. D’Agota promised to recover the customers’ funds as soon as possible and in order to do this, he increased fees for transactions by 1.5%.<\/p>\n<p>All lost funds were soon paid back with the help of fees increase, Poloniex had stayed on the track and saved its reputation.<\/p>\n<h3>The Mistake Leading to the Hack<\/h3>\n<p>In his post on BitcoinTalk, Tristan D’Agosta uncovered the crucial point that became the cause for the vulnerability in the Poloniex system.<\/p>\n<p>If the withdrawals were processed in the line, but not concurrently, the hack wouldn’t have occurred. After Poloniex experienced the attack, the company worked on making the system process withdrawals sequentially.<\/p>\n<h2>2018: Binance<\/h2>\n<p>Among other cryptocurrency exchange projects, <a href=\"https:\/\/www.binance.com\/?ref=37044532\" target=\"_blank\" rel=\"noopener noreferrer\">Binance has earned the status of a reliable crypto exchange and trading platform<\/a>. So, when users found out about the hack that happened in June 2018, they were astonished.<\/p>\n<p>On June 10th, a Binance user approached the support department at Reddit. He claimed that <strong><span style=\"color: #ff0000;\">2 BTC<\/span> <\/strong>had been stolen from his account. At the time, the account held <strong><span style=\"color: #339966;\">$50,000 U.S<\/span><\/strong>, so what had kept the hackers from taking all the money?<\/p>\n<h3>How Could It Happen?<\/h3>\n<p>Binance set up the rule of only two Bitcoins for withdrawal per day, which is considered to be a restriction by many investors. Nevertheless, this restriction has saved users from being hacked for <strong><span style=\"color: #ff0000;\">$50K<\/span><\/strong>.<\/p>\n<p>The hacker used the ‘SIM swap’ method, which helped him\/her get all of the necessary information sent to their phone while they pretended that they had become the victim of the hack.<\/p>\n<p>Once the hacker got the information, it gave him\/her access to the user’s Google Authenticator account, which is another security layer used by Binance.<\/p>\n<p>The support department reacted to <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/8pyha5\/my_binance_account_with_50k_has_been_hacked\/?st=ji9q000n&amp;sh=04d7d4b7\" rel=\"noopener\">the threatening post on Reddit<\/a> quite quickly, and in several minutes, the account was frozen.<\/p>\n<h2>Security Measures to Prevent Hacker Attacks<\/h2>\n<p>All of the above-listed hacker attacks occurred because of the gaps in the security systems of the crypto exchanges. However, all of these can be fixed to protect users and their funds. Here are some of the preventions for crypto exchanges:<\/p>\n<ol>\n<li>All funds should be stored in cold wallets. Otherwise, there is a big probability that a hacker will gain access to customers’ wallets.<\/li>\n<li>There shouldn’t be any intermediary between cold-storage addresses and wallets with deposits.<\/li>\n<li>Manual transfers will help prevent the system from missing a hack.<\/li>\n<li>The system should notify of any suspicious activity on the platform.<\/li>\n<li>If a user makes a request for more funds that are available in a hot wallet, the transaction shouldn’t be processed in less than 24 hours.<\/li>\n<li>Users and exchanges should keep a copy of the database in an encrypted area, so no hacker can change or delete a piece of it.<\/li>\n<li>Exchanges should frequently send account statements signed by a key that is not online-accessible or stored on a public server.<\/li>\n<\/ol>\n<p>It is worth adding that as Decentralized Finance applications and DeFi development companies are becoming more and more popular, they are now considered to be crypto exchanges for hackers. While crypto exchanges were massively attacked in 2019, this year the focus will be on the DeFi blockchain solutions market. And all because the niche’s solutions are too vulnerable and smart contracts are technically flawed security mechanisms.<\/p>\n<p>Previously, a vulnerability in the smart contract code resulted in an attack on the DeFi project, during which $ 25 million was stolen. The developers of the DeFi development company created add-ons based on the ERC-777 protocol, which made smart contracts vulnerable to re-entry attacks. This kind of attack allows hackers to repeatedly retract funds until the initial transaction is confirmed or discarded.<\/p>\n<h2>Conclusions<\/h2>\n<p>Crypto exchanges and trading platforms seem to concentrate the biggest crypto funds on the blockchain. That is why hackers are drooling at the sight of vulnerable exchanges.<\/p>\n<p>Judging from the history of the most reliable and reputable exchanges, like Binance, they are still vulnerable to hacker attacks. This is why every security measure should be taken to protect user funds.<\/p>\n<p>As we can see from the history of hacks, one of the biggest issues faced by exchanges is hot wallets, which hackers find quite easy to get access to.<\/p>\n<p>For more information on the crypto market, check out the <a href=\"https:\/\/applicature.com\/blog\/\">Applicature blog<\/a> and <a href=\"https:\/\/applicature.com\/blockchain-development-consulting\/\">our consulting team<\/a>. Applicature is a Smart Contract creator, blockchain advisor, and <span style=\"font-weight: 400;\">DeFi development company that will help you go public with your novel solution!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Despite the fact that the crypto market is now facing not the best times, the Bitcoin blockchain development company still hopes to hit its peak, just like in 2017. Nevertheless, it is gaining more and more new investors, whose first action would be purchasing coins from the stock. There are also new coin launch platform [&hellip;]<\/p>\n","protected":false},"author":15,"featured_media":3148,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[133],"tags":[150,154,174,176,206],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Biggest Crypto-Exchange Hacks in History- Applicature<\/title>\n<meta name=\"description\" content=\"Crypto exchanges are the most frequent victims of hacker attacks. This is enabled by a lack of enforced security measures. In this article, Applicature teaches you strategies to prevent exchanges from being hacked in the first place.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Biggest Crypto-Exchange Hacks in History\" \/>\n<meta property=\"og:description\" content=\"Crypto exchanges are the most frequent victims of hacker attacks. This is enabled by a lack of enforced security measures. In this article, Applicature teaches you strategies to prevent exchanges from being hacked in the first place.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-12-24T10:10:49+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-15T12:34:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Crypto-Exchange-Hacks-01.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"The Biggest Crypto-Exchange Hacks in History\" \/>\n<meta name=\"twitter:description\" content=\"Crypto exchanges are the most frequent victims of hacker attacks. This is enabled by a lack of enforced security measures. In this article, Applicature teaches you strategies to prevent exchanges from being hacked in the first place.\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Crypto-Exchange-Hacks-01.jpg\",\"width\":1024,\"height\":535,\"caption\":\"Crypto Exchange Hacks\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/\",\"name\":\"The Biggest Crypto-Exchange Hacks in History- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/#primaryimage\"},\"datePublished\":\"2018-12-24T10:10:49+00:00\",\"dateModified\":\"2020-09-15T12:34:59+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\"},\"description\":\"Crypto exchanges are the most frequent victims of hacker attacks. This is enabled by a lack of enforced security measures. In this article, Applicature teaches you strategies to prevent exchanges from being hacked in the first place.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/\",\"url\":\"https:\/\/applicature.com\/blog\/crypto-enthusiasts\/biggest-hacks-in-history-of-crypto-exchanges\/\",\"name\":\"The Biggest Hacks in the History of Crypto Exchanges\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/fe71c0aa976904b06b85ba74d7a54c14\",\"name\":\"Kateryna Hanko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Kateryna Hanko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3139"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/15"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3139"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3139\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/3148"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3139"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3139"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3139"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}