{"id":3154,"date":"2018-12-29T09:03:26","date_gmt":"2018-12-29T09:03:26","guid":{"rendered":"https:\/\/applicature.com\/?p=3154"},"modified":"2022-01-11T20:48:14","modified_gmt":"2022-01-11T20:48:14","slug":"what-is-token-economics","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics","title":{"rendered":"What Is Token Economics?"},"content":{"rendered":"<p>Cryptocurrency does more than just replace fiat currency. It also tokenizes assets via a <span style=\"font-weight: 400;\">tokenization platform<\/span>, provides dApps <span style=\"font-weight: 400;\">development services<\/span>, proves ownership, and motivates holders to participate more actively in decentralized networks.<\/p>\n<p>The twenty-first century has brought many innovations in our usual lives, and blockchain technology is certainly one of them. We can see thousands of blockchain-related projects that claim to be the most effective game-changers of tomorrow.<\/p>\n<p>As token economics is a relatively a new phenomenon in the global economy, it can be difficult to understand properly and to avoid making mistakes during implementation. At the same time, token economics can help you determine the real potential of each blockchain or DeFi development company, and choose the one that is the most solid and has the highest potential for investment.<\/p>\n<p>Token economics can either improve or break your crypto project, so let’s consider its most essential features.<\/p>\n<h2>Crypto Economics vs. Token Economics<\/h2>\n<p>Logically, both concepts are related to the blockchain-based economy and aim to create economic incentives for stakeholders to participate in a particular process as it is needed. However, there are also differences between them that are worth considering and remembering.<\/p>\n<p>In crypto-economics, incentive structures create a transaction and ensure validation of the cryptocurrency via randomly selected nodes. In the Bitcoin <span style=\"font-weight: 400;\">blockchain development company<\/span>, the main purpose is to provide motivation for miners to validate transactions under consensus protocol and mine new Bitcoin. As a result, more and more miners started to participate in mining to get a reward. this, in turn, made the network more secure, allowing faster and cheaper transactions.<\/p>\n<p>For this, they get a reward from transaction initiators, who pay a fee to process their transactions.<\/p>\n<p>Crypto economics represents the structure of a whole cryptocurrency supply process; for example, Bitcoin. Since crypto-economics can evaluate and predict user adoption, asset price, transaction volume, and services, it can help buyers, sellers, service providers, and other parties achieve better investment results by choosing the best c<span style=\"font-weight: 400;\">coin launch platform<\/span> in which to participate.<\/p>\n<p>Crypto economics is tightly related to game theory, as it must incentivize nodes by achieving Nash equilibrium. In order to avoid fraud and ensure an efficient number of coins produced during mining, the voting mechanism of consensus and incentives also must be synchronized to ensure voting under the Arrow theorem. It is quite complicated stuff, with advanced math under the hood.<\/p>\n<p>Token economics, in contrast, is much broader, and despite these aspects, provides the possibility of working with other kinds of tokens beyond just currency. This means that token economics exists to ensure tokens in whatever form their usage in the ecosystem is intended.<\/p>\n<p>Despite the broader definition of token economics, it is ruled with simpler and less mathematically-based economic theories.<\/p>\n<p>Token economics mostly focuses on token application, token supply, and token validation. Token economics explains token usage and its behavior, not only while conducting a transaction but after its accomplishment.<\/p>\n<p>We can divide token economics into two branches:<\/p>\n<ol>\n<li><strong>Microtoken economics<\/strong> focuses on the parameters and the individual.<\/li>\n<li>Macrotoken<strong> economics<\/strong> represents the whole ecosystem of the DLT network and its functioning and depends upon third parties like an exchange or a regulator.<\/li>\n<\/ol>\n<h2><img loading=\"lazy\" class=\"size-full wp-image-3156 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics.png\" alt=\"Micro and macrotokeneconomics\" width=\"1186\" height=\"658\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics-132x73.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics-350x194.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics-500x277.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics-768x426.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics-600x333.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics-120x67.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Micro-and-macrotokeneconomics-300x166.png 300w\" sizes=\"(max-width: 1186px) 100vw, 1186px\" \/>Basic Knowledge of Token Economics<\/h2>\n<p>Cryptocurrency is not only an effective method for fundraising, but also creates the construction of the entirely new business and governance models for a <span style=\"font-weight: 400;\">blockchain development company <\/span>— for example, <em><strong>token <\/strong><\/em>economics.<\/p>\n<p>Token economics is a new branch of the economy that explains the structure of a particular ecosystem in the blockchain sphere. It describes the study, design, and implementation of economic systems built on blockchain technology. Each platform and blockchain application is developed under its own token-economics model.<\/p>\n<p>The main features of a well-developed token are:<\/p>\n<ul>\n<li>utility within the ecosystem<\/li>\n<li>resistance to inflation<\/li>\n<li>scalability of usage<\/li>\n<li>high value<\/li>\n<li>presence on exchanges<\/li>\n<li>potential to increase in usage<\/li>\n<\/ul>\n<p>A utility token is an asset that provides access to products and services on a particular platform.<\/p>\n<p>A security token is a type of token that gets its value from an external, tangible asset and provides a variety of rights — for example, entitlement to a share of profits, ownership, or equity in a legal entity. The difference between them is very small.<\/p>\n<p>Also, users are provided with the ability to create a token that will meet legal and technical expectations, depending upon returns from token holders and the duration of the token sale.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-3157 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Token-value.jpg\" alt=\"Token value\" width=\"1135\" height=\"673\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Token-value.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Token-value-350x207.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Token-value-500x296.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Token-value-768x455.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Token-value-600x356.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Token-value-132x78.jpg 132w\" sizes=\"(max-width: 1135px) 100vw, 1135px\" \/>A token can be fungible or non-fungible in scale. Fungible tokens are interchangeable and can be divided into small units. Non-fungible tokens are non-interchangeable and cannot be divided, as each token is unique.<\/p>\n<h3>Token Supply and Demand<\/h3>\n<p>Any new product entering the market focuses on token supply and demand. If a company decides to design too many products, this will put off purchases, as supply will be over demand. And what will happen to them? Their value will decrease. However, many ICOs still do not pay enough attention to this essential point of token economics.<\/p>\n<p>An appropriate approach for supply-and-demand estimation is described in the Vernon Smith experiments. This was the first initial token offering without blockchain behind it. His approach allows estimation of how tokens should be launched, the direction of their consolidation, and potential levels of demand. As a result, token supply and potential price fluctuations can be easily assessed.<\/p>\n<h3>Token Distribution<\/h3>\n<p>Token distribution is one of the key elements of token economics, as it has a great impact on the achievement of the objectives of your project. A huge mistake would be to make token distribution fixed, as it is issued at a single moment in time. Think forward about the following:<\/p>\n<ul>\n<li>when to put the token into circulation and leave it<\/li>\n<li>the amount to release in the first instance<\/li>\n<li>the interaction between current and projected distribution, utilization, and value<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"size-full wp-image-3158 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Utilization-of-funds.jpg\" alt=\"Utilization of funds\" width=\"867\" height=\"364\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Utilization-of-funds.jpg 867w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Utilization-of-funds-350x147.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Utilization-of-funds-500x210.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Utilization-of-funds-768x322.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Utilization-of-funds-600x252.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Utilization-of-funds-132x55.jpg 132w\" sizes=\"(max-width: 867px) 100vw, 867px\" \/>Token distribution is critical, as with tokens price fluctuations, a project that earns only on its utility tokens always has limitations on its operations due to cash-flow gaps.<\/p>\n<h3>Token Value<\/h3>\n<p>Token value, like any other product value, is unpredictable and may change in the future. The market will determine the value of your asset by itself, so do not be surprised if it differs from your predictions.<\/p>\n<p>Also, consider the moment when users want to exchange the token for a certain service. That means if the market price for your token falls, you will have to set a new, adjusted price.<\/p>\n<p>One more detail about listing on exchanges: if a token is listed on several reputable exchanges, this will serve as a sign that this token is generally recognized, and has a high value on the market.<\/p>\n<h3>Token Purpose<\/h3>\n<p>A token should not just be a profitable addition to your project, whether it is a <span style=\"font-weight: 400;\">blockchain solution for DeFi, a tokenization platform, or dApp<\/span>. It should also have a global purpose. Most ICOs offer tokens that have no value. They are just trying to benefit from blockchain technology offerings and speed up fundraising for their business. If this is true in your case but you really want to attract investors to participate in your coin launch platform, not just buy it, you need to create a token with a purpose greater than just financing.<\/p>\n<p>When reading about your token, people have to understand what the token value is. In the end, you’d like investors to actually want to use your token, not just buy into it for purely speculative reasons.<\/p>\n<h2>The Architecture of the Token Ecosystem<\/h2>\n<p>Creating<a href=\"https:\/\/applicature.com\/blog\/create-your-erc20-tokens\"> a token ecosyste<\/a>m means planning for the future and designing drivers that will motivate users to come, stay, and interact with the platform. Many blockchain-based projects have badly-designed ecosystems. Tokens are allocated disproportionately. With a hard cap of issued tokens, this can cause failure of the ecosystem, as there won’t be enough available tokens.<\/p>\n<p>There are two types of token ecosystem architecture: dual and simple. The choice depends on several factors:<\/p>\n<ul>\n<li>the alignment of interest between users and investors<\/li>\n<li>key stakeholders of token evaluation, estimation of demand, the pace of token flow, and price fluctuation assessment<br \/>\nvolatility-prevention mechanisms<\/li>\n<li>reserve estimation and rules of reserve release<\/li>\n<li>cost of development (for example, listing tokens on exchanges)<\/li>\n<li>the real goal of the project and token<\/li>\n<\/ul>\n<p>Build your coin launch platform&#8217;s ecosystem to meet all of these criteria. For some projects, a simple token structure will be the most suitable; for others, it is better to design a dual token structure.<\/p>\n<p>It is vital to provide stabilization mechanisms in order to cope with threats and link them to a crowdsale bonus, as this can have a negative impact on token economics. The bonus system can be different. However, some projects offer high bonuses (up to 80%) to early-bird investors. But be careful with setting such high bonuses to investors, as this can create a decisive single-investor impact on coin-price stability. If one investor has the majority of project income, this will likely give him or her the wheel of the ‘car.’<\/p>\n<h2>Monetary Policy<\/h2>\n<p>Token economics is dependent on a predetermined monetary policy that includes special measures that provide stability for a certain currency. There are three commonly-accepted instruments to ensure the stability of the monetary policy:<\/p>\n<p>change the credit policy according to other banks<br \/>\nbuy or sell government bonds and foreign currencies to influence money supply<br \/>\nchange the reserve ratio for banks<\/p>\n<p>Adoption of the right monetary policy is a must-have point of every token ecosystem. If there is going to be stability in a non-profitable ecosystem, this will make a deflationary system more effective for a profitable ecosystem.<\/p>\n<h2>Models for the Token Economics<\/h2>\n<p>Models for token economics are built for launching new cryptocurrencies. To develop the most suitable model for the token economics of your project, define the role of its native token. This requires your detailed analysis, as any weakness will sooner or later influence the work of the entire network. That’s why the economic model must be really good.<\/p>\n<p>First, choose a consensus model. There is also the option to create a cryptocurrency through several consensus algorithms. For example, the <span style=\"font-weight: 400;\">solidity smart contract development &#8211; <\/span>Ethereum &#8211; uses <strong>proof of work<\/strong>, which means miners protect the network and are responsible for verifying transactions.<\/p>\n<p>Cryptocurrencies like Dash and NAV use the <strong>proof-of-stake<\/strong> algorithm, which means the holders of the cryptocurrency stake their holdings in a wallet to solve blocks. Solving blocks and gaining rewards depend directly on the number of your holdings.<\/p>\n<p>In these consensus models, the motor without which any token ecosystem cannot exist, the central focus is the incentive &#8211; something that calls people to action.<\/p>\n<p>Incentive theory and human behavioral theory state that incentives determine people’s behavior, and will therefore motivate them to contribute to the network and improve the blockchain ecosystem.<\/p>\n<p>In token economics, tokens serve as incentives and encourage users to behave for the benefit of the platform. The network sets the rules to prompt people to contribute to the platform with personal incentives. Because tokens have financial value, incentives are mostly finance-oriented. People invest their money in the cryptocurrency, and the token value depends on their number of investments. All people want more, and when you pay them more, they will do more for you.<\/p>\n<p>However, an increase in currency causes inflation. The supply increases, so token value decreases as a result, while the demand remains constant. Every consensus model sets its own rules for inflation. For example, for each Bitcoin block solved, the miner gets 12.5 Bitcoin.<\/p>\n<p>According to predictions, the reward is expected to be 6.25 until all 21 million Bitcoins are mined in 2012.<\/p>\n<p>To avoid the consequences of inflation, most cryptocurrencies set a finite supply. As a result, the supply of coins is limited, and there is no way to create more coins. This will help to control the token price. It also is advantageous in comparison to the current economy, in which supply of fiat currency is endless. This makes individual currencies worth less and less. The cryptocurrency market protects people from such a scenario.<\/p>\n<h3>Carrot and Stick<\/h3>\n<p>There is a great chance for users to get a reward from developers for their activity in any given project’s improvement process. On the other hand, if a participant breaks the platform’s rules, or his or her actions are not accepted by curators, they can be banned.<\/p>\n<p>Fortunately, there are more carrots than sticks on the blockchain. Logically, token holders are more motivated to develop the project if they have their own tokens of the platform — in other words, if there is a personal financial stake. The greater the value of the platform, the greater the value of the token holder’s share. The network distributes tokens to the most influential contributors to increase their personal financial stake and encourage them to improve the platform.<\/p>\n<p>Token holders have a lot of opportunities to share in the profits made by the platform. For example, they have the right to vote on the direction of the platform. They can suggest alterations to the network’s programming and upgrades. In this way, token holders are the part of the network’s governance process.<\/p>\n<p>The PoS and Delegated PoS-based models allow token holders to stake their shares. When we say staking, we mean storing cryptocurrency in a private wallet related to the blockchain. With the process of staking, the network is more secure, and the price of the cryptocurrency is stabilized if token holders trade less than these tokens. Staking also has a reward system for token holders.<\/p>\n<p>Users who participate in staking can validate their transactions based upon the amount of the token.<\/p>\n<h3>Nothing Is Free<\/h3>\n<p>Users have to pay a transaction fee to conclude a transaction. As a rule, this fee goes to the miners of the blockchain who proceed with the transaction, but the network can also get it. For example, if you want to send some cryptocurrency to another wallet, you will have to pay a percentage of this transaction to the network for the supply of assets.<\/p>\n<h2>Token Economics: the ICO Side<\/h2>\n<p>Many ICOs make the mistake of analyzing a project, thinking that the ICO will be the only one source of funding for it from end to end. Relying only on your hands is suitable only for small and medium-sized projects, but not for a long-period prospective business with broader purposes.<\/p>\n<p>For this goal, blockchain technology is the best solution. Nowadays, crowdfunding is a very popular means of fundraising within the crypto community. One of its most common and profitable means of crowdfunding is an ICO launch, which is designed to engage capital to a project.<\/p>\n<p>The number of crowdfunding projects is growing every day on the world market. Here is a comparison of the number of ICOs launched between June 2017 and June 2018:<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-3159 aligncenter\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number.png\" alt=\"Monthly ICO number\" width=\"1200\" height=\"742\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number-132x82.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number-350x216.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number-500x309.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number-768x475.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number-600x371.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number-120x74.png 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/Monthly-ICO-number-300x185.png 300w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>Are you aware of the percentage of ICOs that are successful? And how many of them fail, as a result?<\/p>\n<p>Leading ICO countries in 2017 (based on funding volume)<\/p>\n<p>Experience shows that more than 90 percent of ICOs collapse, and experts think this is absolutely normal. Also, both investors and project developers should remember that 90–95% of ICOs won’t have any value in 3 years, even if they seem to be promising right now.<\/p>\n<h3>Token Supply<\/h3>\n<p>If you set your max token supply too low, be ready to face the Bitcoin problem of always working in fractional transaction amounts.<br \/>\nIf you have a professional, experienced team, and your ICO enters the list of the top 20 coins in terms of market cap (today, the cap is at least $1.5 billion), divide that sum by your proposed max token supply in circulation. This will give your token a higher price in USD. For example, if your max supply is 300 million tokens, allocate 50% to circulation.<\/p>\n<p>However, practice shows that some ICO investors avoid participating in projects with a high total supply of tokens. Others believe this is unwise. Because of the way token economics works, the total supply of tokens doesn’t matter. The truth is that 7 out of the top 20 coins have caps larger than 1 billion.<\/p>\n<h3>Token Pricing<\/h3>\n<p>Token pricing can be easily calculated as a mathematical example.<br \/>\nYou have to:<\/p>\n<ul>\n<li>determine a theoretical hard cap in ETH (if ETH is the currency your project is working on) based on current market prices<\/li>\n<li>create your bonus system<\/li>\n<li>plan the token allocation for your pre-sale and main sale<\/li>\n<\/ul>\n<p>Now, a bit of math:<\/p>\n<p>Imagine you are running Project S, which releases its own token, M. Developers determine a hard cap of $50 million USD, while the max token supply is 2 billion.<\/p>\n<p>The token sale allocation is 1 billion (50% of the max token supply).<\/p>\n<p><em><strong>Step 1:<\/strong> <\/em>Let’s determine the theoretical ETH cap.<\/p>\n<p>$50 million today is about 474,721 ETH (1 ETH is around $105,325 USD as of November 27, 2018). (Consider that the cryptocurrency rate is always changing).<\/p>\n<p><em><strong>Step 2:<\/strong><\/em> Bonus system for early contributors.<\/p>\n<p>It is recommended to allocate 15% during the pre-sale period only.<\/p>\n<p><em><strong>Step 3:<\/strong> <\/em>Pre-sale<\/p>\n<p>As a rule, project developers allocate 20% of sale tokens to the pre-sale. That is 200,000,000 of M tokens.<\/p>\n<p>The balance of 800 million tokens is achievable during the main token sale.<\/p>\n<p><em><strong>Step 4:<\/strong> <\/em>Base token price<\/p>\n<p>x = TS\/EC<\/p>\n<p>x = Base Token Price; TS = Token Sale Allocation; EC = ETH Cap.<\/p>\n<p>This gives us a base token price of M tokens. That’s a pretty clean number to use, but if yours is not as pretty, just round it to the nearest number that is visually appealing. The next part of the calculation depends on you.<\/p>\n<p>It is worth remembering that these statistics are more related to the era of the “wild ICO market” in which everyone proposes utility tokens without any assessment of token economics and its influence on the business model. Currently, the situation is shifting toward the separation of utility tokens, which are critically required for products and should be distributed as a service, as well as tokenized securities that aim to collect funds for further development. Tokenized securities have nothing to do with token economics, as they are just a blockchain-based representation of common securities. Those tokens are highly dependent on project financial projection, P&amp;L estimations, DCF models, and if someone is experienced enough to address all features, multiple-based valuation.<\/p>\n<h2><strong>DeFi Token Economics<\/strong><\/h2>\n<p>Blockchain solution for DeFi has been announced as the new crypto revolution. However, numerous hacker attacks are evidence of its immaturity and inability to completely substitute conventional financial tools.<\/p>\n<p>That is why blockchain development for DeFi needs a solid and safe economics model. Being intricate and complicated, DeFi tools can provide greater benefits for the blockchain development company and its user base. But their complicacy opens up a lot of opportunities for the playful actions of self-serving subjects.<\/p>\n<p>In a DeFi development company, levels of certain algorithmic criteria that must be fulfilled in exact order to create, transfer, close, or destroy financial instruments can be either a hallmark or a source of financial vulnerabilities. DeFi development companies and creators are responsible and obligated to build platforms that are economically and technically safe. For blockchain solution for DeFi, accurate economic audits are critical so that users don&#8217;t lose money.<\/p>\n<h2>Conclusion<\/h2>\n<p>Token economics provides insights on how a token will be used on a platform. If a cryptocurrency is only used as a method for involving more money in project development, the demand for the cryptocurrency will decrease.<\/p>\n<p>A deep analysis of the token economics behind a cryptocurrency can help define the potential of that cryptocurrency. The more spectacular use cases a project has, the higher the chances that the demand for it will increase.<\/p>\n<p>If you have any doubts about your token economics, the <a href=\"https:\/\/applicature.com\/\">Applicature<\/a> team is at your service! We are a blockchain and DeFi development company with qualified blockchain advisors and smart contract developers on board. Applicature will bring your ideas to the public and handle everything and the top-notch level!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cryptocurrency does more than just replace fiat currency. It also tokenizes assets via a tokenization platform, provides dApps development services, proves ownership, and motivates holders to participate more actively in decentralized networks. The twenty-first century has brought many innovations in our usual lives, and blockchain technology is certainly one of them. We can see thousands [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":173987,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[131],"tags":[154,176,194,267,268],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"In this article, the token economy is explained.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"In this article, the token economy is explained.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-12-29T09:03:26+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T20:48:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/what-is-token-economics.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/12\/47.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/#primaryimage\"},\"datePublished\":\"2018-12-29T09:03:26+00:00\",\"dateModified\":\"2022-01-11T20:48:14+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"In this article, the token economy is explained.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/what-is-token-economics\/\",\"name\":\"What Is Token Economics?\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3154"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3154"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3154\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173987"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}