{"id":3653,"date":"2019-04-07T10:34:25","date_gmt":"2019-04-07T10:34:25","guid":{"rendered":"https:\/\/applicature.com\/?p=3653"},"modified":"2019-08-01T12:17:20","modified_gmt":"2019-08-01T12:17:20","slug":"hyperledger-vs-ethereum-which-platform-to-choose","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose","title":{"rendered":"Hyperledger vs. Ethereum: Which Platform to Choose?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Currently, there are two large-scale blockchain platforms, Hyperledger Fabric and <\/span><a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/ethereum-programming-tutorial\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Ethereum<\/span><\/a><span style=\"font-weight: 400;\">, that provide users with different opportunities for <a href=\"https:\/\/applicature.com\" target=\"_blank\" rel=\"noopener noreferrer\">building their own blockchains<\/a>. Ethereum is a public blockchain best-suited for building public networks where everyone can access and track changes in the data on the chain. Hyperledger Fabric is a permissioned blockchain suitable for building close networks with permissioned access and member identification. We had the chance to interview Andrew Zubko, Applicature CTO, in order to gain an overview of the differences in usability, purposes, and tools on the Ethereum and Hyperledger platforms.<\/span><\/p>\n<p><strong>Andrew, what’s the difference between public and<\/strong> <strong>permissioned blockchains?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">The main difference between public and permissioned blockchains is that the public blockchain can be accessed by anyone, and permissioned blockchain can be accessed only by a linked number of people. Additionally, public blockchain opens different varieties of public resources for building. For instance, you can build an escrow system trusted by every participant of the network. In a network based on the permissioned blockchain, all peers are trusted and go through an identification process. <\/span><\/p>\n<p><strong>For users, what are the benefits of Hyperledger compared to the Ethereum platform? What advantages does it offer?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">The most popular <a href=\"https:\/\/www.hyperledger.org\" target=\"_blank\" rel=\"noopener noreferrer\">Hyperledger<\/a> blockchain is Fabric. <\/span><i><span style=\"font-weight: 400;\">Hyperledger Fabric<\/span><\/i><span style=\"font-weight: 400;\"> is a completely permissioned blockchain in terms of all its attributes. As for Ethereum, on the one hand, it&#8217;s a public blockchain; and on the other, it&#8217;s a permissioned blockchain. Briefly, to compare these two types of blockchain and their suitability for the building public nets, I would always choose <\/span><a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/getting-started-with-solidity-ethereum-development-why-and-how\"><span style=\"font-weight: 400;\">Ethereum<\/span><\/a><span style=\"font-weight: 400;\">. It has all the tools and consensus algorithms suitable for the building of public networks. Hyperledger Fabric can&#8217;t be used to build public chains. And when we are talking about the permissioned blockchain, Hyperledger Fabric is choice number one. It allows participants to manage who can access their smart contracts, who can access their blockchain validators, and so on. There are other blockchains that are in my preferred list for permission, and I would say that Ethereum is number four or five. It&#8217;s not well-suited to permissioned chains, but it can also be used for that. <\/span><\/p>\n<p><strong>Ok, what about <a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-scalability\" target=\"_blank\" rel=\"noopener noreferrer\">scalability issues<\/a> then?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">In terms of scalability, we can look at several items. The first is <\/span><i><span style=\"font-weight: 400;\">how<\/span><\/i><span style=\"font-weight: 400;\"> the blockchain network is scalable: how many nodes can participate in it. And, in this case, Ethereum is highly scalable. It can contain thousands of nodes compared to Hyperledger Fabric, which can have up to 50-60 nodes because of its consensus algorithm. When it comes to scalability issues, speed, performance, and transaction throughput, scalability plays a very important role. Ethereum supports two consensus algorithms, including proof-of-work and proof-of-authority. Proof-of-work provides slow confirmation of transactions. It can be super fast on low complexity, which then makes the network very vulnerable to hacking. Right now, on the Ethereum platform, around 8 transactions are processed per second, which is very slow. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The second consensus algorithm, proof-of-authority, provides 200-300 transactions per second. It can be cheap because it doesn&#8217;t require a lot of mathematical computation. It just signs the block with a private key and publishes it on the network. Similarly, Hyperledger Fabric also has a delegated proof-of-stake algorithm that provides similar throughput comparable to Ethereum&#8217;s proof-of-authority. Ethereum and Hyperledger Fabric are comparable in terms of throughput using proof-of-Authority of Ethereum and the native consensus algorithm of Hyperledger Fabric. However, in terms of node scalability, Ethereum wins the game. <\/span><\/p>\n<p><strong>Which companies manage Hyperledger? Why have they decided to create this platform?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Hyperledger is managed by non-profit company called the Linux Foundation. Hyperledger Fabric was launched by several enterprises, including <\/span><span style=\"font-weight: 400;\">Digital Asset and <a href=\"https:\/\/www.ibm.com\" target=\"_blank\" rel=\"noopener noreferrer\">IBM<\/a>.<\/span><span style=\"font-weight: 400;\"> They launched this platform for building enterprise blockchains because of the huge number of possibilities provided by blockchain for incorporation purposes.  Blockchain provides immutability of data and automation of some business processes in an extremely secure way. Every participant in the network can be confident that all business processes are executed correctly. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I can provide you with a bright use case: open data. This trend means that governments and companies are publishing data publicly so everyone can easily access the data. As you know, this data cannot be modified by middlemen in any way. By employing blockchain for use cases, the storage of data will be unchangeable and will stay the same from the beginning. New means of automation enable very fast payments in which all parties can trust each other. Blockchain helps the real world in a lot of different ways. <\/span><\/p>\n<p><strong>Could you tell me about popular Hyperledger projects? Maybe you know Iroha, Indy, Quilt, Grid, Fabric, and others. How do they differ? <\/strong><\/p>\n<p><span style=\"font-weight: 400;\">So, Hyperledger has a quite big list of projects, and the first one that made the Hyperledger foundation well-known in the crowd was Hyperledger Fabric. This is a permissioned blockchain. Another Hyperledger project is <\/span><i><span style=\"font-weight: 400;\">Iroha<\/span><\/i><span style=\"font-weight: 400;\">. This is similar to the Ethereum blockchain. This is the Ethereum Virtual Machine placed from scratch in a secure environment. It can also be used for permissioned use cases and the execution of smart contracts. Another one is <\/span><i><span style=\"font-weight: 400;\">Hyperledger Indy<\/span><\/i><span style=\"font-weight: 400;\">. Its main goal is to provide a decentralized identity. It has different tools and libraries. Other Hyperledger tools, including Iroha, are useful for blockchain building with consensus algorithms, and so on. When we are talking about Hyperledger, this is the foundation. It has a lot of blockchains, but one of the most popular is Hyperledger Fabric. Then you can name Iroha and others. They have specific use cases.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You also mentioned Hyperledger <\/span><i><span style=\"font-weight: 400;\">Quilt<\/span><\/i><span style=\"font-weight: 400;\">. This is a tool for blockchain interoperability that allows the sending transactions of in a secure manner on different blockchains. I can also mention Hyperledger Explorer, which allows you to view which transactions are processed on other blockchains. Hyperledger Explorer was initially contributed by IBM, Intel, and DTCC. Day by day, the Hyperledger Foundation is growing, and it has great potential to launch new projects to help different industries and enterprises implement blockchain in their businesses. Also, I could mention one more good project: Hyperledger Composer, which drastically simplifies the development of chain codes for Hyperledger Fabric.  <\/span><\/p>\n<p><b>Why does Hyperledger have problems with scalability, and are there any ways of solving this? <\/b><\/p>\n<p><span style=\"font-weight: 400;\">Hyperledger Fabric has problems with scaling horizontally. It has the temptation of efficiently sinking transactions between nodes, and as mentioned earlier, it has a limit of 50-60 nodes. Unfortunately, there is no way to improve this scalability.<\/span><\/p>\n<p><b>What is “Membership Service Providers”? What possibilities does it provide participants in a network?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">That is a very broad question. Could you clarify a little bit more, please?<\/span><\/p>\n<p><strong>Actually, this is a special tool that allows participants in a network to be identified. I&#8217;ve read it on BlockGeeks. <\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Exactly. This is how other nodes can connect to your network. It has abstractions like organizations and divisions you can find in the structure. It&#8217;s responsible for authentication through certificates.<\/span><\/p>\n<p><b>Why is that important?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">So, this is how we can identify which nodes should be able to access our network. Permissioned Ethereum provides participants in the network with access to the blockchain through the use of IP addresses. In Hyperledger Fabric, you can even issue certificates that will allow identification of each member of the network. Only valid members can connect to your network. <\/span><\/p>\n<p><b>Could you please explain the concept of the network built on Hyperledger Fabric? I mean, how do participants in the network interact with each other?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">One of the most important parts of Hyperledger Fabric is chain codes. These are smart contracts in Fabric that execute business logic. Participants in the network can deploy codes on-chain and execute some parts of it. This is the main way people interact with each other through blockchain. <\/span><\/p>\n<p><b>How can you make Hyperledger and EVM interact with each other? How can you create a network, add participants to the network, and issue tokens on Hyperledger Fabric?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">You can issue tokens in Fabric. <\/span><a href=\"https:\/\/medium.com\/applicature\/which-token-economics-system-works-best-nowadays-33811d65197f\"><span style=\"font-weight: 400;\">Tokens<\/span><\/a><span style=\"font-weight: 400;\"> allow storage of extra value. This can be achieved on any blockchain that supports smart contracts. Ethereum has developed the ERC-20 token standard. This is a smart-contract standard with a specific list of methods. T<\/span><span style=\"font-weight: 400;\">here’s a list of rules to which the tokens must conform.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Everyone who utilizes Fabric to build smart contracts can issue tokens from scratch by themselves. How to combine Ethereum with Hyperledger Fabric is a hot topic. Hyperledger Fabric adopts everyone to work with other blockchains. And everyone tries to solve this by themselves. One of the projects from Hyperledger Foundation is Hyperledger Fabric. But this is just one of the options, and everyone wants to create their own solutions. We have developed our own solution called <\/span><a href=\"https:\/\/fluence.sh\/\"><span style=\"font-weight: 400;\">Fluence<\/span><\/a><span style=\"font-weight: 400;\"> that provides <\/span><i><span style=\"font-weight: 400;\">blockchain interoperability<\/span><\/i><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Currently, developers deploy <a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/uses-for-smart-contracts\" target=\"_blank\" rel=\"noopener noreferrer\">smart contracts<\/a> in chaincode on Hyperledger Fabric by using Java, Go, and JavaScript. But in terms of the smart-contract developers&#8217; community, it&#8217;s mostly used by Ethereum, and that means there are a lot of <a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/discovering-smart-contracts-solidity-royalty-management\" target=\"_blank\" rel=\"noopener noreferrer\">Solidity smart-contract<\/a> developers. There are restrictions that should be applied by the smart-contract environment. And in that case, there are check-in lists for developed chain code to support the environment. We have developed chaincode that supports almost all existing opcodes from the Ethereum Virtual Machine and allows you to develop smart contracts and off-chain codes on Solidity and deploy them to Hyperledger Fabric. <\/span><\/p>\n<p><b>Could you please tell us more about Fluence? Is this a decentralized app? What possibilities does it provide its users?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">This is not a decentralized app. This is a centralized app that can be hosted by itself in the cloud. It consists of several main components. The first is a blockchain getaway that allows services to create apps that interact with different blockchains. So, the main goal was to obtain different blockchains. It happens pretty often that developers start to develop <\/span><a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/blockchain-app-development\"><span style=\"font-weight: 400;\">applications<\/span><\/a><span style=\"font-weight: 400;\"> or platforms using just one blockchain at some point in time. Very often, it doesn&#8217;t suit their purposes. They might choose one blockchain because of lack of experience, have to implement all their logic with different blockchains. We are solving this by providing one API to execute different blockchains. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The second component is the simplification of tracking what has happened and sending transactions to different blockchains. The third component is a smart-contract template in which we are creating different frameworks for different practicals. This is about Fluence. <\/span><\/p>\n<p><b>Could you tell us more about your own experience of interaction with Hyperledger? Has Applicature used Hyperledger to build their own smart contracts?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Hyperledger Fabric is suitable when we really don&#8217;t need a public network or, I should say, smart-contract blockchain code deployments to public networks. All data should be stored accessibly for a limited number of parties, and that means it will be not exposed to the entire net. Then you should select permissioned blockchain. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The best choice currently is <em>Hyperledger Fabric<\/em>. It has a community growing, and different useful tools. What are their use cases? It could be intra-banking software that transfers assets between different banks; supply chains; or government processes when we want to define organization structure and provide some rules about who can execute or sign transactions. It&#8217;s also can be placed on the blockchain. It will be immutable, and no one will be able to access the data. Plus, it provides the ability to integrate private-public keys for signing transactions. Public nets, including Ethereum, enable the building of applications or smart contracts geared toward the crowd. Their main goal is to allow different participants to interact with your smart contracts. So, some of the most popular use cases for the public blockchain is the gambling, gaming, governance of public companies by their participants, and banking. <\/span><\/p>\n<p><b>Has Applicature used Hyperledger <a href=\"https:\/\/applicature.com\/blockchain-development\/\" target=\"_blank\" rel=\"noopener noreferrer\">to build smart contracts<\/a>?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Yeah, we are using Hyperledger Fabric to build solutions, mostly for customers who are looking permissioned solutions that can interact with blockchain. <\/span><\/p>\n<p><b>Which industries is Hyperledger Fabric most popular in?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Fintech, supply chain, and banking. These are the most important industries implementing Fabric right now, from my perspective.<\/span><\/p>\n<p><b>Could you list the main reasons for businesses to incorporate blockchain in their in-product process? Why is it so important currently?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Blockchain provides another level of secure data storage and automation. Currently, there are existing business processes that could be optimized by using blockchain or developed for use by the blockchain. Any processes that require paperwork can be placed on the blockchain to be automated, and will then require very little human attention. All logic will be called by smart contacts and executed on the blockchain in a trustworthy way. This means all the parties will understand that the process will be executed only in one specific way, not in another. It can be applied to lower-ranking workers just to automate processes, or for interaction between parties. An example of <\/span><a href=\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/blockchain\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">the supply chain<\/span><\/a><span style=\"font-weight: 400;\"> could be tracking the delivery process or supply process. But it can also contain routing logic when it decides the route products should travel. All of this critical business logic can be placed on the blockchain and executed only in one specific way. <\/span><\/p>\n<p><b>What platform could you advise businesses to choose in order to build their blockchain? Please list the main reasons for this. <\/b><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I would advise not building a blockchain from scratch. I would advise using an existing blockchain network, or platforms like <\/span><i><span style=\"font-weight: 400;\">Hyperledger Fabric <\/span><\/i><span style=\"font-weight: 400;\">or<\/span><i><span style=\"font-weight: 400;\"> Corda<\/span><\/i><span style=\"font-weight: 400;\">. To implement public solutions, this could be <em>Ethereum<\/em> or another public blockchain.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span>    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Currently, there are two large-scale blockchain platforms, Hyperledger Fabric and Ethereum, that provide users with different opportunities for building their own blockchains. Ethereum is a public blockchain best-suited for building public networks where everyone can access and track changes in the data on the chain. Hyperledger Fabric is a permissioned blockchain suitable for building close [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":3654,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[134],"tags":[195,214,255,261],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"Currently, there are two large-scale blockchain platforms, Hyperledger Fabric and Ethereum, that provide users with different opportunities for building their own blockchains. Ethereum is a public blockchain best-suited for building public networks where everyone can access and track changes in the data on the chain. Hyperledger Fabric is a permissioned blockchain suitable for building close [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-04-07T10:34:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:17:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2019\/03\/HYPERLEDGER-VS.ETHEREUM.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"535\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2019\/03\/HYPERLEDGER-VS.ETHEREUM.jpg\",\"width\":1024,\"height\":535,\"caption\":\"hyperledger-vs-ethereum\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/#primaryimage\"},\"datePublished\":\"2019-04-07T10:34:25+00:00\",\"dateModified\":\"2019-08-01T12:17:20+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/eadbd177b4774859460945c4718dd53d\"},\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/\",\"url\":\"https:\/\/applicature.com\/blog\/enterprise-blockchain\/hyperledger-vs-ethereum-which-platform-to-choose\/\",\"name\":\"Hyperledger vs. Ethereum: Which Platform to Choose?\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/eadbd177b4774859460945c4718dd53d\",\"name\":\"Tanya Bahrynovska\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2019\/09\/2S3A1076.jpg\",\"caption\":\"Tanya Bahrynovska\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3653"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=3653"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/3653\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/3654"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=3653"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=3653"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=3653"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}