{"id":368,"date":"2018-01-31T05:03:18","date_gmt":"2018-01-31T05:03:18","guid":{"rendered":"https:\/\/applicature.com\/?p=368"},"modified":"2019-08-01T12:56:08","modified_gmt":"2019-08-01T12:56:08","slug":"smart-contracts-legal","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal","title":{"rendered":"Re-Envisioning the Law Firm: Smart Contracts"},"content":{"rendered":"<p>While the financial industry, power delivery businesses, and telecommunications enterprises are digitized and already rely on blockchain, the benefits for law firms using smart contracts may seem less obvious.<br \/>\nIn this article, we’ll talk about how smart contracts are shaping the current jurisprudence landscape, and offer some insights into the immediate future for law firms and the unique challenges they face.<\/p>\n<h2>How is Blockchain Technology Transforming the Legal Profession?<\/h2>\n<p>Nowadays, we are witnessing the end of the era of big data in corporate consciousness. A recent analysis showed that blockchain technology is hitting a high — it’s now the number-one trend public corporate execs have on the brain.<br \/>\nBased on Google advanced searches on law firms official web pages the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.legaltechinnovation.com\/law-firm-index\/\" target=\"_blank\" rel=\"noopener noreferrer\">Law Firm Innovation Index<\/a><\/span> analyzes law firm innovation. Blockchain has been included as a measurement of how law firms are supporting emerging enterprise-use cases.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-399 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017.png\" alt=\"law firm innovation index blockchain\" width=\"1424\" height=\"824\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017.png 1424w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017-350x203.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017-500x289.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017-768x444.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017-1024x593.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017-600x347.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Law_firm_innovation_index_2017-132x76.png 132w\" sizes=\"(max-width: 1424px) 100vw, 1424px\" \/><\/p>\n<p>This move is critical, and indicates that legal professionals are poised to serve as catalysts for blockchain technology.<br \/>\nAs a result, speeded-up innovation and quick mass technology adoption will cause legal-service delivery improvements and make legal services accessible to everyone.<\/p>\n<h2>The Enterprise Ethereum Alliance<\/h2>\n<p>The <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/entethalliance.org\/\">Enterprise Ethereum Alliance<\/a><\/span> is the world’s largest Blockchain initiative, which definitely shows how cryptocurrencies and blockchain technology are slowly becoming more and more mainstream.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-403 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/01\/EEA_logo.jpg\" alt=\"ethereum alliance law firm\" width=\"1200\" height=\"800\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_logo.jpg 1200w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_logo-350x233.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_logo-500x333.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_logo-768x512.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_logo-1024x683.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_logo-600x400.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_logo-132x88.jpg 132w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<p>The EEA is a nonprofit organization connecting Fortune 500 enterprises, startups, academics, and technology vendors with Ethereum subject-matter experts. Since February, the alliance has grown to over 200 members, including some big names.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-404 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/01\/EEA_vision.png\" alt=\"ethereum alliance vision\" width=\"1680\" height=\"401\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_vision.png 1680w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_vision-350x84.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_vision-500x119.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_vision-768x183.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_vision-1024x244.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_vision-600x143.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/EEA_vision-132x32.png 132w\" sizes=\"(max-width: 1680px) 100vw, 1680px\" \/><\/p>\n<p>In <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.coindesk.com\/legally-binding-smart-contracts-9-law-firms-join-enterprise-ethereum-alliance\/\">August 2017<\/a><\/span> ten law firms and four legal institutions specializing in blockchain technology joined the organization. Cooley, Debevoise &amp; Plimpton, Hogan Lovells, Holland &amp; Knight, Jones Day, Morrison Foerster, Perkins Coie, Shearman &amp; Sterling, and Cardozo Law School&#8217;s Blockchain Project are among the new members.<\/p>\n<p>They’ve also joined the Legal Industry Working Group. The group was designed to educate the legal industry about the potential benefits of blockchain technology, to support the growth and acceptance of private versions of the Ethereum blockchain, and to make implementation more profitable. The group aims to ensure that Ethereum smart contracts comply with regulatory requirements working with this new technology. There is another advantage for legal institutions: a learning component. It’s something that law firms’ clients don&#8217;t want to pay for, but expect lawyers to know, especially as state governments around the world continue to weigh in on blockchain (Japan, Australia, OAE, USA, EU etc). Attorneys need to know the difference between Ethereum and Bitcoin, and provide their clients with relevant information.<\/p>\n<p>This is a big deal, as it signifies Ethereum’s adoption by major law firms—and with it, the adoption of smart contracts.<\/p>\n<p>However, legal interest in smart contracts goes beyond the EEA. According to Forbes, at a spring Seattle legal technology event, digital contracts were recommended as a focus for the future event.<\/p>\n<h2>Traditional Law and Smart Contracts<\/h2>\n<p>Let’s examine <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/how-to-use-smart-contracts-with-blockchain-technology\">smart contracts<\/a><\/span> from a legal perspective.<\/p>\n<p>To start with, let’s provide a notion of what a contract is. <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/en.wikipedia.org\/wiki\/Contract\" target=\"_blank\" rel=\"noopener noreferrer\">Wikipedia<\/a><\/span> describes it as an enforceable-by-law voluntary agreement between two or more parties. The process of contract formation generally includes an offer, acceptance, consideration, and mutual intention for the agreement. Not all agreements are necessarily contractual. Commonly, contracts are created through social institutions and\/or government to regulate behavior.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-415 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1.png\" alt=\"szabo traditional law smart contract\" width=\"1502\" height=\"308\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1.png 1502w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1-350x72.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1-500x103.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1-768x157.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1-1024x210.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1-600x123.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Quote_Szabo-1-132x27.png 132w\" sizes=\"(max-width: 1502px) 100vw, 1502px\" \/><\/p>\n<p>Traditional contracts have a long history based upon practices that have been available for thousands of years. They shape relations in the context of law, whereas smart contracts are agreements created by means of a cryptographic code similar to other programming languages. Smart contract code mainly deals with transactions between agents in the blockchain ecosystem. The basic idea of these digital agreements is that the majority of contractual cases can be embedded in the hardware and software we deal with.<\/p>\n<p>The crucial difference between traditional contracts and smart contracts is that the logic in traditional law is based upon the subjective interpretation of analogy. Traditional legal documents are complicated enough. They often require trained professionals in order to be understood correctly. The result is that traditional law is relatively flexible, involving interpretation and judgment (and can, therefore, be corrupted). Interestingly, most commercial contracts are incomplete in the sense that they do not specify what will happen in every future state, leaving that to be determined later. Economists and lawyers have come up with a number of reasons why incomplete contracts are so common. Perhaps the most obvious reason is that it is often too costly to forecast and agree to unambiguous contractual terms.<\/p>\n<p>The software version is rigid and predictable. While the traditional law is defined by state borders, blockchain-powered contract law has the potential to exist across borders.<\/p>\n<h3>Smart Contracts Benefits<\/h3>\n<p>Nowadays, smart contracts are gaining more and more interest due to the range of benefits they offer. They give you:<\/p>\n<ul>\n<li>autonomy (no need to rely on middlemen)<\/li>\n<li>trust (docs are encrypted in a shared ledger)<\/li>\n<li>backup (on the blockchain, docs are duplicated many times over)<\/li>\n<li>safety (due to cryptography)<\/li>\n<li>speed (software code is used to automate tasks, thereby saving hours spent on paperwork)<\/li>\n<li>savings (no presence of an intermediary)<\/li>\n<li>accuracy (you avoid the errors that come from manually filling out forms.)<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3>Are Smart Contracts Legally Viable?<\/h3>\n<p>It is undeniable that smart contracts do not exist outside the legal system. Thus, smart contracts must be classified as legally relevant behavior. They serve as just another tool for organizing business relations. Schematically, this relationship might look something like this:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-409 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/01\/Legally_relevant_behavior.png\" alt=\"legally relevant behavior\" width=\"322\" height=\"324\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Legally_relevant_behavior.png 322w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Legally_relevant_behavior-100x100.png 100w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Legally_relevant_behavior-109x110.png 109w\" sizes=\"(max-width: 322px) 100vw, 322px\" \/><\/p>\n<h3>Best Friends: Lawyers and Programmers<\/h3>\n<p>Such contracts will require a tighter relationship between lawyers, their clients, and computer programmers, who will be tasked with writing digital agreements. Lawyers will become a bridge between traditional contracts and smart contracts and eliminate the gap, providing the necessary professional expertise about the deal. Programmers will think in terms of bits and bytes.<\/p>\n<p>Smart contracts remain experimental in many companies, while traditional paper contracts seem to remain for years. Many traditional contracts aren’t actually executable, so there is no place for them among smart contracts.<\/p>\n<p>In addition, many legal questions regarding smart contracts have yet to be solved, or must be handled on a case-by-case basis. How are agreements enforced across different jurisdictions? How are specific data accessed and protected? Finding the answers looks very promising, and will bring the industry to a whole new level.<\/p>\n<p>Publicity requires professionals with sufficient tech literacy. Technological competence in jurisdictions where this applies is a must if lawyers are to continuously play a meaningful role. Modern educational institutions owe it to the legal industry.<\/p>\n<h2>Artificial Intelligence Enables New Insights<\/h2>\n<p>When it comes to potential applications, hundreds of existing pilots and proofs-of-concept are only the tip of the iceberg.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-416 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/01\/Blockchain_AI.jpg\" alt=\"blockchain artificial intelligence\" width=\"620\" height=\"372\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Blockchain_AI.jpg 620w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Blockchain_AI-350x210.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Blockchain_AI-500x300.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Blockchain_AI-600x360.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/Blockchain_AI-132x79.jpg 132w\" sizes=\"(max-width: 620px) 100vw, 620px\" \/><\/p>\n<p>Blockchain and smart contracts make data sharing and processing more trustworthy and efficient. This is the basis that causes AI and machine learning to awaken their powers completely, and will include a huge variety of applications, from personal use to virtual assistants, cybersecurity, chatbots, etc.<\/p>\n<p>From a long-term perspective, complex forms of agent-managed, peer-to-peer automation — the Internet of Things (IoT) and a network of agents — are of greater interest.<\/p>\n<p>To replace traditional paper contracts, smart contracts and the processes they run have to be compliant with the following requirements.<\/p>\n<p>First, they should be <strong>legally viable<\/strong>. Smart contracts have to retain the structure of traditional contracts and include a description of an offer, its acceptance, and mutual intent to be bound by its terms. This will serve as proof of acceptance of certain conditions.<\/p>\n<p>Second, smart contracts should be <strong>accessible for analysis<\/strong> by an AI agent. This will clarify users’ insights regarding their best course of action, the same way a professional attorney would do.<\/p>\n<p>Third, the UI\/UX of a smart contract web application should be <strong>simple<\/strong> and user-friendly, and easy to understand.<\/p>\n<p>Lastly, smart contracts must be open for management, adaptation, and renegotiation, remaining <strong>flexible and interactive<\/strong>. Smart contracts have to cover the entire contract life-cycle, and allow the running of different scenarios according to user demand. The possibility of confirming\/denying the fact of meeting obligations must be provided. Otherwise, there should be undeniable proof that specified obligations have been satisfied.<\/p>\n<p>Surely, the rest of the 2010s will likely be a period of mastery.<\/p>\n<h2>Smart Contracts: Long-Term Visions<\/h2>\n<p>Traditional contracts depend upon a legal system administered by human institutions. They require trust. Not surprisingly, people are very enthusiastic about removing government from this important function. As Bitcoin enthusiasts are excited about the possibility of currency without a government, smart-contract envisioners are excited about the prospect of contracts without a government-run legal system.<\/p>\n<h3>Democracy on Blockchain<\/h3>\n<p>Using blockchain code, constituents would be able to cast votes via smartphone, tablet, or computer, resulting in immediately-verifiable results. Brazil may write new laws with data stored on the Ethereum blockchain. They are willing to use the Ethereum blockchain to prove that signatures collected for petitions to the Brazilian congress exist. Brazilian legislators now are turning to Ethereum to solve that issue in one of the first uses of a cryptocurrency by a political system. See <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/qz.com\/1163660\/brazil-may-write-new-laws-based-on-data-stored-on-the-ethereum-blockchain\" target=\"_blank\" rel=\"noopener noreferrer\">Quartz<\/a><\/span>, January 5, 2018. To read about advancements in Dubai, see <a href=\"https:\/\/coinspot.io\/world\/v-dubai-sobirayutsya-k-2020-godu-perevesti-vse-pravitelstvennye-dokumenty-na-blokchejn\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Coinspot<\/span>.<\/a><\/p>\n<h3>Court decisions: Prediction<\/h3>\n<p>A recent study showed that computers can do a better job than legal scholars at predicting Supreme Court decisions, even with less information. Martin Katz explored judicial prediction from a variety of different angles, and identified three forms of legal prediction: experts, crowds, and algorithms. Forecasting presupposes a rigorous information and modeling environment. The use of smart contracts prevails.<\/p>\n<h3>Distributed Autonomous Government<\/h3>\n<p>Settlers of previously uninhabited areas are coding their own self-enforcing governmental services.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-418 size-full\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1.png\" alt=\"smart contracts law firm future insights\" width=\"1878\" height=\"740\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1.png 1700w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1-350x138.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1-500x197.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1-768x303.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1-1024x404.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1-600x236.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/smart_contracts_simple_to_complex-1-132x52.png 132w\" sizes=\"(max-width: 1878px) 100vw, 1878px\" \/><\/p>\n<p>Moreover, dreamers in blockchain technology imagine that not only organizations, but also certain aspects of society could be automated. Groups of settlers from different areas are establishing self-enforcing trade agreements.<\/p>\n<h2>Future Outlook<\/h2>\n<p>Most innovation in law started elsewhere.<\/p>\n<p>But with buyers of legal services becoming more sophisticated, new providers entering the market, emerging technologies, and growing pressure on fees, the market is striving for innovation.<\/p>\n<p>The world is transforming dynamically, and so is the jurisprudence industry. Smart contracts are offering a change. By embracing them, law firms will not only control the risks they face, but also open the door to extraordinary opportunities.<\/p>\n<p>The blockchain distributed ledger may not replace all layers, but this new technology could eliminate many of the manual steps typically required in the execution of contracts.<\/p>\n<p>Applicature invites you to stay in touch.    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>While the financial industry, power delivery businesses, and telecommunications enterprises are digitized and already rely on blockchain, the benefits for law firms using smart contracts may seem less obvious. In this article, we’ll talk about how smart contracts are shaping the current jurisprudence landscape, and offer some insights into the immediate future for law firms [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":954,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[131],"tags":[140,154,234,255],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"Smart contracts blockchain offer a new way of how a contractual relationship can be formalized and have to be classified as legally relevant behavior. Legal professionals will become a bridge between traditional contracts and smart contracts.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"Smart contracts blockchain offer a new way of how a contractual relationship can be formalized and have to be classified as legally relevant behavior. Legal professionals will become a bridge between traditional contracts and smart contracts.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-01-31T05:03:18+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:56:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/2018.03.08-Smart-Contract-Legal-02-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"550\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/01\/2018.03.08-Smart-Contract-Legal-02-1.jpg\",\"width\":1100,\"height\":550,\"caption\":\"smart contracts law\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/#primaryimage\"},\"datePublished\":\"2018-01-31T05:03:18+00:00\",\"dateModified\":\"2019-08-01T12:56:08+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/20c1c44e222e86f7a93fe590ecddb11b\"},\"description\":\"Smart contracts blockchain offer a new way of how a contractual relationship can be formalized and have to be classified as legally relevant behavior. Legal professionals will become a bridge between traditional contracts and smart contracts.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/smart-contracts-legal\/\",\"name\":\"Re-Envisioning the Law Firm: Smart Contracts\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/20c1c44e222e86f7a93fe590ecddb11b\",\"name\":\"nadiya.gryvnak\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"nadiya.gryvnak\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/368"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=368"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/368\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/954"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=368"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=368"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=368"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}