{"id":612,"date":"2018-02-26T19:26:27","date_gmt":"2018-02-26T19:26:27","guid":{"rendered":"https:\/\/applicature.com\/?p=612"},"modified":"2019-08-01T12:53:54","modified_gmt":"2019-08-01T12:53:54","slug":"technical-components-ico","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico","title":{"rendered":"How to Start an ICO Project: Technical Components"},"content":{"rendered":"<p>[vc_row css_animation=&#8221;&#8221; row_type=&#8221;row&#8221; use_row_as_full_screen_section=&#8221;no&#8221; type=&#8221;full_width&#8221; angled_section=&#8221;no&#8221; text_align=&#8221;left&#8221; background_image_as_pattern=&#8221;without_pattern&#8221;][vc_column][vc_column_text]Nowadays, the creation of own ICO is gaining more and more popularity. It is one of the most efficient methods for companies and individuals to find money for their business projects, to create well-designed smart contracts and for users to invest in prospective projects.<\/p>\n<p>If you’ve decided to start your own cryptocurrency business, first of all, realize that it’s a huge, responsive work process. It requires a lot of effort, time, and skill. When starting development of an ICO project, pay great attention to the formation of a technical base of the ICO. This is the one mechanism without which nothing will work properly.<\/p>\n<p>We can compare ICO structure to a big business machine. Each detail plays an extremely important role in its safe, quick operation, qualitatively taking into account all traffic rules.<\/p>\n<p>So, let&#8217;s dismantle this mechanism into smaller parts in order to fully understand the characteristics and role of each.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-573 aligncenter\" src=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/pasted-image-0.png\" alt=\"The Technical Components of an ICO\" width=\"762\" height=\"432\" \/><\/p>\n<h2><strong>Website<\/strong><\/h2>\n<p>A great website is the key way for an ICO promotion to show its vision, goals, and plans to clients. It&#8217;s worth the investment, as it forms a base for the further functioning of any ICO.<br \/>\nSecurity<\/p>\n<p>As a key factor in website security, it’s usually recommended not to use WordPress CMS, which sometimes has different plugins you can’t control. The best way is to build a static website. This will provide the implementation of all requirements for successful work.<\/p>\n<p>There are some examples of the most interesting ICO websites:<\/p>\n<ol>\n<li><a href=\"https:\/\/www.hoqu.io\/\" rel=\"noopener\"><span style=\"color: #e70f00;\">HOQU<\/span><\/a> presents a colorful design, convenient menu, interesting animations, a lot of pictures and readable information.<img loading=\"lazy\" class=\"alignnone size-full wp-image-613\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/02\/Снимок-1.png\" alt=\"\" width=\"1335\" height=\"610\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-1.png 1335w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-1-350x160.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-1-500x228.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-1-768x351.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-1-1024x468.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-1-600x274.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-1-132x60.png 132w\" sizes=\"(max-width: 1335px) 100vw, 1335px\" \/><\/li>\n<li><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/eos.io\/\" rel=\"noopener\">EOS<\/a><\/span> website is for fans of minimalism. It is easy to use and very inspiring.<img loading=\"lazy\" class=\"size-full wp-image-614\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/02\/Снимок-2.png\" alt=\"\" width=\"1332\" height=\"641\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-2.png 1332w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-2-350x168.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-2-500x241.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-2-768x370.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-2-1024x493.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-2-600x289.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-2-132x64.png 132w\" sizes=\"(max-width: 1332px) 100vw, 1332px\" \/><\/li>\n<li><a href=\"https:\/\/www.envion.org\/en\/\" rel=\"noopener\"><span style=\"color: #e70f00;\">Envion<\/span><\/a> is designed with a nice taste, user-friendly,  contains enough information that is backed up by useful media files.<img loading=\"lazy\" class=\"alignnone size-full wp-image-615\" src=\"http:\/\/localhost\/applicatore\/wp-content\/uploads\/2018\/02\/Снимок-3.png\" alt=\"\" width=\"1351\" height=\"633\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-3.png 1351w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-3-350x164.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-3-500x234.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-3-768x360.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-3-1024x480.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-3-600x281.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Снимок-3-132x62.png 132w\" sizes=\"(max-width: 1351px) 100vw, 1351px\" \/><\/li>\n<\/ol>\n<h3>Multilinguality<\/h3>\n<p>Today, multilingualism is one of the most important things for a website, as it makes it accessible to people all over the world. Provide your support and service in different languages. Also, develop an interface so users can easily and simply switch the page to their preferred language.<\/p>\n<h3>Responsiveness<\/h3>\n<p>The next thing everyone needs to know is that the website must be responsive. Make it adaptable and mobile to any type of user. This will significantly improve traffic and usefulness. Remember to be a friend to users.<\/p>\n<h3>SEO Compliance<\/h3>\n<p>It’s not a good idea to use Wix to build a website. People can easily get the code, and, as a result, gain access to personal data. Wix doesn&#8217;t provide credibility for the ICO or for clients. Moreover, its use is a sign of poor attention to an ICO.<\/p>\n<h2><strong> Hosting<\/strong><\/h2>\n<p><em>Hosting<\/em> reserves the space a website occupies on the internet. In other words, it makes it available for potential users. Also, it governs the database, files, emails, and DNC services of the ICO.<\/p>\n<h3>CDN and Storage<\/h3>\n<p>Pay attention to the content delivery network that makes the website load faster. There must be storage while using a static website, which is recommended for the successful functioning of the network. The best solution is to use an expensive one to provide a really good level of protection.<\/p>\n<h3>DDoS Protection<\/h3>\n<p>The most common mistake is using the same password for different websites instead of making it more difficult. In fact, there have been a lot of incidents in which hackers have replaced an Ethereum smart contract address to steal contributions. If the password has been compromised once, DNS access may have been stolen.<\/p>\n<h2><strong>ICO Cabinet<\/strong><\/h2>\n<p>The ICO cabinet represents the whole ICO to a client. It’s their personal account for purchasing tokens and managing the ICO for an easy token distribution. Here, the client can change his or her personal settings and allocate access rights. In other words, it’s the visiting card of the ICO. The more complex it is, the more security bridges it tends to have.<\/p>\n<p>Follow the examples and tips for the appropriate creation of an ICO cabinet here: <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/\">Applicature &#8211; Blockchain Developers Agency<\/a><\/span> to be fully sure of its complete development.<\/p>\n<h3>Signup and login<\/h3>\n<p>This is a private area for contributors to have interactions. Of course, not everyone will be willing to sign up and use the login page. On the other hand, it&#8217;s a great opportunity to find people who really want to participate in the ICO vs. those who don’t.<\/p>\n<h3>Two-Factor Authentication<\/h3>\n<p>Two-Factor authentication is an option for additional security for an account, but now, some clients don’t prefer to use it. In any case, an appropriate ICO cabinet is not holding the wallet itself. A contributor will conduct transactions out of an existing personal wallet that is unrelated to the cabinet. That’s why TFA is not mandatory.<\/p>\n<h3>Verification<\/h3>\n<p>In the ICO cabinet, there is the option of verifying these documents. The user has to confirm his or her identity and residence with a passport, ID, or other document(s). All of this is provided to the administrator for further consideration.<\/p>\n<h3>Whitelisting<\/h3>\n<p>The main purpose of whitelisting is legal and financial compliance.<\/p>\n<p>There are several ways to implement this on the smart-contract side:<\/p>\n<ul>\n<li>to create a list of all allowed addresses<\/li>\n<li>To provide data with a special signature. Only the address that is encrypted in the signature can execute transactions on Ethereum smart contracts.<\/li>\n<\/ul>\n<p>There will be a lot of contributors and holders during the work process. It may be of high priority to accept people from the community who will be target\/key users of the platform. This should be aimed at serious contributors and holders, because they distinctly understand the purpose and problems of an ICO, and believe in the solutions the team will come up with to solve these problems. In any case, holding Bitcoin for a long period of time is possible only with true belief in it.<\/p>\n<p>Many contributors hope for a quick sale as fast as possible, just to have a profit. And that’s all. Realize that these people are mostly impatient, and won’t provide support in difficult situations.<\/p>\n<h3>Contribution<\/h3>\n<p>An ICO cabinet directs users to a contribution flow. This must be clear and easy to fulfill for optimal usability and conversion, and to make the transaction process more comfortable for the contributor.<\/p>\n<h3>History<\/h3>\n<p>A list of all the transactions a contributor has made is available for viewing in the transactions history. They can always check the current status of the transaction. The contributor’s history creates additional trust. When people see that transactions are successful, it motivates them to repeat contributions. The important point here is that approximately 10 to 15 percent of clients will make more than one transaction within a single ICO.<\/p>\n<h3>Communication<\/h3>\n<p>In addition, the ICO cabinet is the way to keep communication with contributors, on the formation of whom no less attention should be placed in order to ensure appropriate conditions for the functioning of all participants. There is a special widget for ICO cabinets to simplify and update this communication.<\/p>\n<h2><strong>KYC\/AML Databases<\/strong><\/h2>\n<p>Extreme attention to privacy, in fact, is primarily what spawned technology in the first place. In this case, external providers for verification are connected to different KYC gateways in the databases. With these databases, it’s possible to review records from different sources to get information about personal data. This helps to make a choice about whether to approve or reject a candidate.<\/p>\n<p>The aim of the KYC process is to verify each customer’s identity and residence, thereby minimizing the legal risks associated with anonymous payments. Use third-party KYC and AML verification expert systems for confidence in the legitimacy of all funds raised in the token sale. The purpose of KYC verification is to protect the contributors of the project.<\/p>\n<p>KYC and AML verification expert systems help to enhance fraud prevention and AML compliance. Automated, risk-based KYC is analyzed and checked via proprietary data services. With a review of suspicious transactions and risk scoring on sources of funds, illegal behavior can be prevented.<\/p>\n<h2><strong>BLOCKCHAIN NODE CLUSTERS<\/strong><\/h2>\n<p>This field is connected to the ICO cabinet. Let’s look through some of the popular ones:<\/p>\n<ul>\n<li><strong>ETH<\/strong> is basically for getting statistics without having to rely on the external APIs<\/li>\n<li><strong>BTC<\/strong> is needed to track the transactions in the wallet. The ICO cabinet will integrate with smart contracts with incoming identified transactions, and send tokens to the contributors.<\/li>\n<li><strong>LTC<\/strong><\/li>\n<li>Etc.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2><strong>COLD WALLET<\/strong><\/h2>\n<p>It is recommended to have both hot and cold wallets, and transfer contributions from the hot wallet to the cold wallet. There are a lot of Bitcoin wallets. Some are compliant, but some are not, so be sure that these transactions belong to the personal master public key.<\/p>\n<h2><strong>SMART CONTRACTS<\/strong><\/h2>\n<p>Smart contracts are very important for concluding credible agreements, and they have to be internally and externally secure.<\/p>\n<p>They are self-executed, and there is no need to order them again. This greatly simplifies business processes. When supplying the code to auditors, check out <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/blockgeeks.com\/guides\/smart-contracts\/\">What Are Smart Contracts? A Beginner&#8217;s Guide to Smart Contracts<\/a><\/span> for additional information about smart contracts.<\/p>\n<ol>\n<li><strong>Token (ERC20,ERC 223,ERC 721).<\/strong> ERC20 is the traditional standard for the development of cryptocurrency tokens, providing a robust network and developed framework. You can try also ERC 223, and then the hybrid of ERC 20 and ERC 223. ERC 721 is the new standard for non-finding tokens.<\/li>\n<li><strong>Token sale contracts<\/strong> are used to control pricing, bonuses, discounts of the ICO, and other features that make it tempting to contributors.<\/li>\n<li><strong>Team vesting contracts<\/strong> indicate how team members will issue tokens for the specific amount of time they have to vest.<\/li>\n<li><strong>HOLD smart contracts<\/strong> are needed when offering a contributor the option to freeze a token for a certain period of time. They’ll get a bonus or some other type of compensation from the rent.<\/li>\n<li><strong>Dividends smart contracts<\/strong> regulate the gains people get from business profits while running the cryptocurrency.<\/li>\n<li><strong>Voting and other contracts<\/strong> are useful for any other requirements, and depend upon the conditions of their stacking.<\/li>\n<li><strong>Service mechanics smart contracts<\/strong> regulate how the token is going to be used on the platform. The more a token is used, the more tokens are secured from the market and partially burned. This decreases the total supply as well as the price of the token.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p>Also, don&#8217;t forget to watch the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.youtube.com\/watch?v=jL1tP6BlUY0\" rel=\"noopener\">video<\/a><\/span> to be completely aware of the technical components developing. To consider an ICO in a more serious manner, use these websites to implement all technical needs: <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/github.com\/\">The world&#8217;s leading software development platform · GitHub<\/a><\/span> to publish a smart contract, and <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/etherscan.io\">Etherscan<\/a><\/span> to submit important information concerning tokens and the verification of smart contracts.<\/p>\n<p>In conclusion, it is strongly recommended to spend a lot of time and money on the formation of truly effective technical components for any ICO. This will ensure its high quality, and fast and reliable functioning.[\/vc_column_text][\/vc_column][\/vc_row][vc_row css_animation=&#8221;&#8221; row_type=&#8221;row&#8221; use_row_as_full_screen_section=&#8221;no&#8221; type=&#8221;full_width&#8221; angled_section=&#8221;no&#8221; text_align=&#8221;left&#8221; background_image_as_pattern=&#8221;without_pattern&#8221;][vc_column][vc_raw_html el_class=&#8221;social_blog_test&#8221;]JTNDbGluayUyMGhyZWYlM0QlMjdodHRwcyUzQSUyRiUyRmZvbnRzLmdvb2dsZWFwaXMuY29tJTJGY3NzJTNGZmFtaWx5JTNEUmFsZXdheSUzQTQwMCUyQzIwMCUyNyUyMHJlbCUzRCUyN3N0eWxlc2hlZXQlMjclMjB0eXBlJTNEJTI3dGV4dCUyRmNzcyUyNyUzRSUwQSUwQSUzQ2xpbmslMjBocmVmJTNEJTIyJTJGJTJGbmV0ZG5hLmJvb3RzdHJhcGNkbi5jb20lMkZmb250LWF3ZXNvbWUlMkY0LjEuMCUyRmNzcyUyRmZvbnQtYXdlc29tZS5taW4uY3NzJTIyJTIwcmVsJTNEJTIyc3R5bGVzaGVldCUyMiUzRSUwQSUzQ25hdiUyMGNsYXNzJTNEJTIyc29jaWFsX2Jsb2dfdGVzdCUyMiUzRSUwQSUyMCUyMCUzQ3VsJTNFJTBBJTIwJTIwJTIwJTIwJTNDbGklM0UlM0NhJTIwaHJlZiUzRCUyMmh0dHAlM0ElMkYlMkZ0d2l0dGVyLmNvbSUyRmludGVudCUyRnR3ZWV0JTNGdGV4dCUzREhvdyUyMHRvJTIwU3RhcnQlMjBhbiUyMElDTyUyMHByb2plY3QlM0ElMjBUZWNobmljYWwlMjBDb21wb25lbnRzJTI2dXJsJTNEaHR0cHMlM0ElMkYlMkZhcHBsaWNhdHVyZS5jb20lMkZibG9nJTJGdGVjaG5pY2FsLWNvbXBvbmVudHMtaWNvJTIyJTIwdGFyZ2V0JTNEJTIyX2JsYW5rJTIyJTNFJTIwJTNDaSUyMGNsYXNzJTNEJTIyZmElMjBmYS10d2l0dGVyJTIyJTNFJTNDJTJGaSUzRSUzQyUyRmElM0UlM0MlMkZsaSUzRSUwQSUyMCUyMCUyMCUyMCUzQ2xpJTNFJTNDYSUyMGhyZWYlM0QlMjJodHRwJTNBJTJGJTJGd3d3LmZhY2Vib29rLmNvbSUyRnNoYXJlci5waHAlM0Z1JTNEaHR0cHMlM0ElMkYlMkZhcHBsaWNhdHVyZS5jb20lMkZibG9nJTJGdGVjaG5pY2FsLWNvbXBvbmVudHMtaWNvJTI2dCUzREhvdyUyMHRvJTIwU3RhcnQlMjBhbiUyMElDTyUyMHByb2plY3QlM0ElMjBUZWNobmljYWwlMjBDb21wb25lbnRzJTIyJTIwdGFyZ2V0JTNEJTIyX2JsYW5rJTIyJTNFJTIwJTNDaSUyMGNsYXNzJTNEJTIyZmElMjBmYS1mYWNlYm9vayUyMiUzRSUzQyUyRmklM0UlM0MlMkZhJTNFJTNDJTJGbGklM0UlMEElMjAlMjAlMjAlMjAlM0NsaSUzRSUzQ2ElMjBocmVmJTNEJTIyaHR0cHMlM0ElMkYlMkZ3d3cubGlua2VkaW4uY29tJTJGc2hhcmVBcnRpY2xlJTNGbWluaSUzRHRydWUlMjZhbXAlM0J1cmwlM0RodHRwcyUzQSUyRiUyRmFwcGxpY2F0dXJlLmNvbSUyRmJsb2clMkZ0ZWNobmljYWwtY29tcG9uZW50cy1pY28lMjZhbXAlM0J0aXRsZSUzREhvdyUyMHRvJTIwU3RhcnQlMjBhbiUyMElDTyUyMHByb2plY3QlM0ElMjBUZWNobmljYWwlMjBDb21wb25lbnRzJTIyJTIwdGFyZ2V0JTNEJTIyX2JsYW5rJTIyJTNFJTIwJTNDaSUyMGNsYXNzJTNEJTIyZmElMjBmYS1saW5rZWRpbiUyMiUzRSUzQyUyRmklM0UlM0MlMkZhJTNFJTNDJTJGbGklM0UlMEElMjAlMjAlMjAlMjAlM0NsaSUzRSUzQ2ElMjBocmVmJTNEJTIyaHR0cHMlM0ElMkYlMkZ3d3cucGludGVyZXN0LmNvbSUyRnBpbiUyRmZpbmQlMkYlM0Z1cmwlM0RodHRwcyUzQSUyRiUyRmFwcGxpY2F0dXJlLmNvbSUyRmJsb2clMkZ0ZWNobmljYWwtY29tcG9uZW50cy1pY28lMjIlMjB0YXJnZXQlM0QlMjJfYmxhbmslMjIlM0UlMjAlM0NpJTIwY2xhc3MlM0QlMjJmYSUyMGZhLXBpbnRlcmVzdCUyMiUzRSUzQyUyRmklM0UlM0MlMkZhJTNFJTNDJTJGbGklM0UlMEElMjAlMjAlMjAlMjAlM0MlMkZ1bCUzRSUwQSUzQyUyRm5hdiUzRQ==[\/vc_raw_html][\/vc_column][\/vc_row]    \t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row css_animation=&#8221;&#8221; row_type=&#8221;row&#8221; use_row_as_full_screen_section=&#8221;no&#8221; type=&#8221;full_width&#8221; angled_section=&#8221;no&#8221; text_align=&#8221;left&#8221; background_image_as_pattern=&#8221;without_pattern&#8221;][vc_column][vc_column_text]Nowadays, the creation of own ICO is gaining more and more popularity. It is one of the most efficient methods for companies and individuals to find money for their business projects, to create well-designed smart contracts and for users to invest in prospective projects. If you’ve decided to [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":572,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[154,176,193,195,215,216,255,265],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Start an ICO project:Technical Components<\/title>\n<meta name=\"description\" content=\"In the way how to start an ICO project, pay great attention to the technical components as they are a fundamental basis of Initial Coin Offering (ICO) process. Considering the main of them will help to discover how to launch an ICO to increase its productivity.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Start an ICO project:Technical Components\" \/>\n<meta property=\"og:description\" content=\"In the way how to start an ICO project, pay great attention to the technical components as they are a fundamental basis of Initial Coin Offering (ICO) process. Considering the main of them will help to discover how to launch an ICO to increase its productivity.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-26T19:26:27+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-08-01T12:53:54+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Technical-components-of-the-ICO-v2.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"550\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/02\/Technical-components-of-the-ICO-v2.jpg\",\"width\":1100,\"height\":550,\"caption\":\"Technical components of the ICO\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/\",\"name\":\"How to Start an ICO project:Technical Components\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/#primaryimage\"},\"datePublished\":\"2018-02-26T19:26:27+00:00\",\"dateModified\":\"2019-08-01T12:53:54+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\"},\"description\":\"In the way how to start an ICO project, pay great attention to the technical components as they are a fundamental basis of Initial Coin Offering (ICO) process. Considering the main of them will help to discover how to launch an ICO to increase its productivity.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/technical-components-ico\/\",\"name\":\"How to Start an ICO Project: Technical Components\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/49c432f184a070a84c8574203d5b6ce9\",\"name\":\"olha.hlebiv\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"olha.hlebiv\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/612"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=612"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/612\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/572"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=612"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=612"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=612"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}