{"id":7204,"date":"2020-12-30T16:41:38","date_gmt":"2020-12-30T16:41:38","guid":{"rendered":"https:\/\/applicature.com\/?p=7204"},"modified":"2020-12-30T16:59:11","modified_gmt":"2020-12-30T16:59:11","slug":"the-fundamentals-of-defi","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi","title":{"rendered":"The Fundamentals of DeFi"},"content":{"rendered":"<h1>The Essence of DeFi<\/h1>\n<p>Since the beginning of the practical blockchain product development, a little more than 10 years have passed, but during this time there has been a significant technological and informational leap in the development of the crypto sphere. The terminology and many concepts in this rapidly developing industry are still at the stage of formation and refinement; completely new definitions appear as a result of the establishment of a new trading field.<\/p>\n<p>DeFi is one of the blockchain evolutions. Its ecosystem is growing and developing, striving for status as one of the key constituents in the field of cryptocurrency finance. Financial independence and the absence of intermediaries in important financial transactions are key features that provide this market with the potential for exponential growth.<\/p>\n<h2>What is DeFi?<\/h2>\n<p>Cryptocurrencies have allowed people to refuse interactions from a crowd of centralized intermediaries in the transfer of value, leaving the accounting operators (miner, block producer, and delegate) out of the process. This has served as a powerful impetus for the development of both technology and financial relationships. The transfers of tokens gained momentum and, with the growth of the total capitalization for the market, they shot into the modern world of finance. DeFi stands for open tools or protocols in distributed systems that solve some financial problems.<\/p>\n<p>DeFi stands for Decentralized Finance &#8211; the most massive <a href=\"https:\/\/cointelegraph.com\/news\/consensys-btc-tokenization-and-yield-farming-drives-defi-growth\" target=\"_blank\" rel=\"noopener noreferrer\">use of tokenization<\/a>. It is an ecosystem that has emerged from the rise of many different types of blockchain-built financial applications. DeFi is a movement aimed to decentralize the traditional centralized financial services industry.<\/p>\n<p>Analysts distinguish several main categories of DeFi:<\/p>\n<ul>\n<li>Decentralized Exchanges (the so-called distributed exchanges, also known as DEX) and open exchange protocols (UniSwap, Kyber Network, Bancor Network, Ren, IDEX, and BitShares);<\/li>\n<li>Lending and Borrowing (MakerDAO, Compound, Dharma);<\/li>\n<li>Derivatives, Margin Trading &amp; Prediction Markets (Augur, CDx, dYdx, bZx, and Daxia);<\/li>\n<li>Liquidity Mining (SushiSwap, Pickle, Cream Finance, Core Vault, and others).<\/li>\n<\/ul>\n<p>A feature of DeFi development company in a single distributed system is the ability of protocols to interact with each other and with derivative tokens. That is why DeFi on the Ethereum blockchain gained the most popularity.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7206\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/value-locked-in-defi-1.png\" alt=\"value locked in defi\" width=\"803\" height=\"431\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/value-locked-in-defi-1.png 803w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/value-locked-in-defi-1-500x268.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/value-locked-in-defi-1-350x188.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/value-locked-in-defi-1-768x412.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/value-locked-in-defi-1-600x322.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/value-locked-in-defi-1-132x71.png 132w\" sizes=\"(max-width: 803px) 100vw, 803px\" \/><\/p>\n<p>Source: DeFi Pulse<\/p>\n<p>But against the backdrop of blockchain integration services and tools, something else is happening: the existing financial world is preparing to enter the game in the market of distributed ledger systems. In many large companies, hundreds of thousands of DeFi developers are working to serve the transfer needs of modern humanity. Development is carried out in many directions:<\/p>\n<ul>\n<li>Insurance<\/li>\n<li>Identification<\/li>\n<li>Metal Trade<\/li>\n<li>Clearing House<\/li>\n<li>Patents<\/li>\n<li>Healthcare\/Health Insurance<\/li>\n<li>Crediting<\/li>\n<\/ul>\n<p>All of these are no longer just prototypes; they are real services that are waiting for clients who are ready to plunge into the universe of decentralized finance.<\/p>\n<h2>Technology Overview<\/h2>\n<p>DeFi operates on the basis of smart contracts &#8211; the best blockchain technology application that exists in the world. Blockchain is a <a href=\"https:\/\/en.wikipedia.org\/wiki\/Distributed_database\" target=\"_blank\" rel=\"noopener noreferrer\">decentralized database<\/a>, in which all records are formed into blocks organized in a linear order. Moreover, each subsequent block absorbs all the previous information of its predecessor. Nodes (users) must have some influence in order to be able to add records (transactions) to the database, while the process of recording the database itself must use certain resources to ensure the operation of all nodes.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7207\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/blockchain-levels.png\" alt=\"blockchain levels\" width=\"695\" height=\"629\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/blockchain-levels.png 695w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/blockchain-levels-500x453.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/blockchain-levels-350x317.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/blockchain-levels-600x543.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/blockchain-levels-122x110.png 122w\" sizes=\"(max-width: 695px) 100vw, 695px\" \/><\/p>\n<p>source: Deloitte<\/p>\n<p>Blockchain technology guarantees the security and uninterrupted operation of a distributed network, using cryptocurrencies and tokens for the exchange of values. Therefore, cryptocurrencies (or tokens), like digitized fiat money, are used to display the value of certain transactions that are created by users in a decentralized network. At the same time, the rules for organizing money issues in the blockchain product development system are always determined by the computer code of free software of a particular cryptocurrency and not by the will of the government or the central bank.<\/p>\n<h2>Technical Analysis<\/h2>\n<p>The DeFi apps are built around a series of smart contracts &#8211; their “if this, then that” logic governs the behavior of assets in the ecosystem. Smart contracts eliminate the need for centralized intermediaries, thereby reducing the cost and processing time of financial transactions. This technology simplifies processes so much that they are even used by centralized suppliers to improve their efficiency.<\/p>\n<p>The DeFi ecosystem is usually rendered and explained as a collection of layers. Opinions differ on the number of layers and how they are designated, but it is generally accepted that the base layer is the blockchain on which it is built (almost always Ethereum). So, DeFi consists of five layers: the settlement layer, the asset layer, the protocol layer, the application layer, and the aggregation layer.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7208\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/Visualization-of-DeFi-Layers.jpg\" alt=\"Visualization of DeFi Layers\" width=\"979\" height=\"503\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/Visualization-of-DeFi-Layers.jpg 979w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/Visualization-of-DeFi-Layers-500x257.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/Visualization-of-DeFi-Layers-350x180.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/Visualization-of-DeFi-Layers-768x395.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/Visualization-of-DeFi-Layers-600x308.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/Visualization-of-DeFi-Layers-132x68.jpg 132w\" sizes=\"(max-width: 979px) 100vw, 979px\" \/><\/p>\n<p>Visualization of DeFi Layers, source: ResearchGate<\/p>\n<p>So, DeFi works on 5 layers. Each of these layers has a separate aim:<\/p>\n<p>The <strong>settlement layer<\/strong> is the one that underlies blockchain itself. Without this foundation, there won’t be anything to build apps on. It is a base that works differently than anything in the world of centralized finance: transactions are confirmed by miners and recorded in the blockchain&#8217;s distributed ledger. This unique functionality, though, has several potential drawbacks related to transaction costs and the time needed to conduct a transaction.<\/p>\n<p>The <strong>asset layer<\/strong> attributes to any token utilized in the DeFi application, including native protocol assets (generally ETH).<\/p>\n<p>The <strong>protocol layer<\/strong> is the actual inner workings of the DApp (decentralized applications). It usually comprises a series of smart contracts that automatically manage the behavior of the assets utilized in the DeFi environment. It is vital to remember that although all smart contracts are governed by their own logic and always work based on this logic, they were originally written by humans, and it is possible that their code may contain bugs or loopholes that can be exploited.<\/p>\n<p>The <strong>application layer<\/strong> is a user interface that makes it easy for people to interact with the DeFi platform. Without this layer, only those who are really good at blockchain and know how to program will be able to interact with DeFi.<\/p>\n<p>The <strong>aggregation layer<\/strong> can be thought of as an extension of the application layer. Aggregators bring multiple applications together so that users can use a single dashboard to execute multiple types of DeFi transactions. The aggregator may be composed of pre-built decentralized applications, but it will likely take advantage of DeFi&#8217;s “financial building blocks” instead and allow people to choose which decentralized applications they want to aggregate to build their DeFi product suite. This is DeFi&#8217;s greatest strength. The level of aggregation allows DeFi as a whole to become more than the sum of its individual parts.<\/p>\n<p>When a user wishes to interact with their decentralized applications, they can start by downloading their aggregator. This dashboard gives them access to some or all of the DeFi platforms they are currently using. Think of it as the home screen on your phone, where you have different icons for your favorite apps.<\/p>\n<h2>DeFi DApps<\/h2>\n<p>DApps differ from conventional apps in that they use blockchain as a database. DApps are used in a variety of areas, from gaming to sharing disk space or computing power, from marketplaces to social media. One of the areas of use for such applications is DeFi or decentralized finance. DeFi applications provide financial services similar to banks, but they do not have a centralized managing organization &#8211; the bank. The process of providing financial services is automated. Changes to this process are only possible by voting by users who own the platform&#8217;s management tokens. DeFi DApps use protocols and smart contracts for financial management and security.<\/p>\n<p>DeFi applications have two types of tokens in operation &#8211; a control token and a token tied to the value of an asset. Control tokens are used to vote on changes to the application. Tokens that are tied to the value of assets are used for trading, accrual, and payment of interest, or are issued as a liability for which the collateral can be returned. They can be either stablecoins pegged to an asset at a 1:1 rate, or one can change their rate in relation to an asset.<\/p>\n<p>For example, the Compound DeFi protocol uses COMP and aTokens. The latter is issued to the user when he or she provides a loan. The aTokens rate changes in accordance with the interest rate on the loan. Therefore, when the user returns them, the exchange takes place at a new rate. As a result, the protocol returns the collateral along with interest.<\/p>\n<h3>Liquidity Providers<\/h3>\n<p>When they build the DeFi project, they keep in mind it will work according to the following principle. There are users who provide liquidity &#8211; loans at interest, which are blocked in the protocol. Other users use this liquidity &#8211; for example, they take loans at interest. What makes DeFi special is that smart contract protocols automate these processes. DeFi does not require the consent of the other party to receive a loan or provide a loan &#8211; the process is automated and only certain conditions are required to complete a transaction.<br \/>\nFor example, to obtain a loan, you must provide collateral in excess of the loan amount. This protects the protocol from the volatility of the cryptocurrency used as collateral. Another way to reduce volatility is to use DeFi protocols to create stablecoins, which are also backed by collateral in excess of their issuance amount.<\/p>\n<h2>DeFI Benefits and Use Cases<\/h2>\n<p>DeFi can perform all the same functions as traditional banks but much more efficiently and conveniently. The movement of decentralized finance makes it possible to use loans, open interest-bearing accounts, and trade without the need to trust centralized companies. Services are provided through decentralized applications (DApps), usually deployed on the Ethereum platform.<\/p>\n<p>At the same time, it is absolutely not necessary to be an Ethereum specialist to use them, although it doesn’t hurt if you have a deeper understanding of the process. We can compare traditional and decentralized finance according to the main criteria: The system of payments and transfers. A bank transfer from one country to another can take days and involve a lot of fees. Moreover, there is a complete lack of privacy. The cryptocurrencies that underlie the work of <a href=\"https:\/\/applicature.com\/\">DeFi development company<\/a> do not need intermediaries and transfers are carried out as quickly as possible (on the Ethereum network, from 15 seconds, with a commission of about $0.02).<\/p>\n<p>The benefits are clear:<\/p>\n<ul>\n<li>Availability. Banks impose strict restrictions on who can open an account, and even more so on the use of financial services such as lending. There are now more than a half-billion people in the world who do not have access to banking services. Defi is guaranteed to make their lives easier. To use an account, you only need the Internet.<\/li>\n<li>Centralization vs Decentralization. Banks are quite safe in terms of keeping funds, but not 100%. And the fall of a large bank will necessarily entail a large-scale financial crisis. DeFi protocols are managed by decentralized organizations, and this gives confidence that some people will not be able to make decisions on their own.<\/li>\n<li>Transparency. The average investor has no idea how his funds are used in a bank account. As for DeFi, the source code of the protocols developed on the basis of public blockchains is completely transparent for all users and open to audits.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7209\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi.jpg\" alt=\"what is defi\" width=\"1600\" height=\"854\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi.jpg 1600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi-500x267.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi-1024x547.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi-350x187.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi-768x410.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi-1536x820.jpg 1536w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi-600x320.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/what-is-defi-132x70.jpg 132w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/p>\n<p>source: jibrel<\/p>\n<p><em>Note: One of the most important possibilities that DeFi provides is decentralized identification. In the long term, DeFi development company with a decentralized identity can become an alternative for people deprived of access to the capabilities of conventional financial systems. There are billions of people around the globe without an official ID, and in poor countries, about 50% of women do not own one. But many of them have smartphones. Therefore, when decentralized identification systems start operating in developed countries, they can be implemented in developing countries as a breakthrough technology &#8211; just as it was with smartphones.<\/em><\/p>\n<p>A vital benefit of building DeFi on smart contracts like Ethereum is interoperability. By analogy with libraries of software modules, smart contracts of various financial applications can be combined like designer parts. For instance, if you desire to implement the tokenized assets trading option on your platform, you can simply achieve this by deploying a decentralized exchange protocol. Using such a &#8220;constructor,&#8221; you can also generate entirely unique designs, which is unknown in the traditional world.<\/p>\n<h2>Oracles: Trusted Data Sources<\/h2>\n<p>In order to better understand DeFi, you need to realize how different tokens function in the cryptocurrency ecosystem. Let’s explore the basics of oracles first.<\/p>\n<p>Oracle is an agent that finds and confirms real events and transfers this data to the blockchain to use smart contracts. Smart contracts need oracles to highlight details that may not be uniquely known and understood at the time of writing.<\/p>\n<p><em>For instance: Alice and Bob are betting on the temperature on Saturday. Alice thinks the temperature will be 20° C or higher, and Bob thinks the temperature will be 19° C or lower. They develop a smart contract with which both send the funds that must be paid to the winner. To define the temperature, the smart contract must request a reliable resource &#8211; oracle. In this particular case, the smart contract will resort to the weather news website, which will be the oracle. <\/em><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7210\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle.png\" alt=\"what is defi\" width=\"1720\" height=\"742\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle.png 1700w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle-500x216.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle-1024x442.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle-350x151.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle-768x331.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle-1536x663.png 1536w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle-600x259.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/oracle-132x57.png 132w\" sizes=\"(max-width: 1720px) 100vw, 1720px\" \/><\/p>\n<p>Source: toptal.com<\/p>\n<p>Oracles are used in various areas of blockchain product development where smart contracts are utilized. But oracles are especially popular and most actively used in DeFi projects. Moreover, this connection is so strong that many crypto observers list oracle tokens in the DeFi token group.<\/p>\n<p>The most bright examples of using oracles in DeFi are:<\/p>\n<ol>\n<li>Synthetic asset platforms require real asset prices to be displayed on the web. Oracles are used to create tokens that are tied to real assets such as gold, indices, stocks, or cryptocurrencies.<\/li>\n<li>Lending and borrowing platforms require the participation of oracles to guarantee the full value of the collateral. Used for issuing and repaying loans, repaying collateral, and calculating interest payments.<\/li>\n<li>For stablecoins, a price stream is required to confirm the value of the underlying asset&#8217;s collateral. They are used to create stablecoins pegged to fiat currencies, currency baskets, or commodities.<\/li>\n<\/ol>\n<p>The undisputed leader among all oracles can be considered the ChainLink blockchain. It is a pioneer in the provision of reliable data for DeFi, and its LINK token and is currently ranked as the number one oracle token, with a capitalization of $ 5.86 billion. After the price fell in March of this year due to the pandemic, the token fully recovered, and in July it reached a historical maximum. It has been growing exponentially since then. The increase in prices since the beginning of this year was 463%. This is the largest increase among the top coins.<\/p>\n<h2>Asset Tokenization<\/h2>\n<p><strong>Tokenization opens the door to the DeFi ecosystem for assets that were previously unable to access it.<\/strong> It opens up new possibilities with its asset-backed composability.<\/p>\n<p>The fundamental goal of <a href=\"https:\/\/www2.deloitte.com\/content\/dam\/Deloitte\/lu\/Documents\/financial-services\/lu-tokenization-of-assets-disrupting-financial-industry.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">​​tokenization<\/a> is to bring accessibility to asset holders and make transactions more effective. Tokenized assets can be smoothly transferred to anyone in the world in a matter of seconds. They can be utilized in many decentralized apps and held in smart contracts. These tokens are an important part of the DeFi ecosystem.<\/p>\n<p>The process of adding new assets to the blockchain (public blockchains) is called tokenization, and the representation of an asset on the <a href=\"https:\/\/applicature.com\/services\/blockchain-development\/\">blockchain product development<\/a> system is called a token. From a technological point of view, there are numerous ways to create public Blockchain tokens. However, most of these options can be neglected as most tokens are issued on the Ethereum blockchain using a smart contract template called the ERC-20 token standard. These tokens can be applied in almost all DeFi apps.<\/p>\n<h3>Benefits of Tokenization<\/h3>\n<p>The financial market is full of various assets. Tokenization of physical assets is changing the paradigm of managing them offering benefits that were previously impossible. Some of them are described below.<\/p>\n<p><strong>Programmability.<\/strong> <a href=\"https:\/\/www.fintech.finance\/01-news\/what-is-programmable-money\/\" target=\"_blank\" rel=\"noopener noreferrer\">Programmable money<\/a> is an advantage of tokenization, which, again, is central to blockchain assets and completely absent from traditional financial alternatives. The ability to program items of value to move from one person or organization to another owner, if and only if certain conditions are met, has excellent potential for creating items of value and significantly reducing operating costs. A simple first example would be a tokenized share, which distributes a percentage of its net income in the form of a quarterly dividend only among those token holders whose quarterly net profit is positive. Pre-programming this dividend function will significantly reduce the manual and time-consuming process of issuing quarterly dividends. A somewhat more complex example would be tokens that are converted between equity and debt instruments based on predefined parameters. The transparency of the public chain of blocks will allow anyone to confirm the correct operation of the protocol.<\/p>\n<p><strong>Fractional Investment.<\/strong> Fractional ownership will open new asset classes for the average investor and make smaller investment amounts possible. As an example, purchases of art objects are usually conducted through a closed bidding process as opposed to the public market process, which leads to sole ownership (one owner per asset) instead of shared ownership (many co-owners of one asset). For something like Mona Lisa, owning an auction market alone would essentially represent one “Mona Lisa share” worth $800 million. Market-share holdings could potentially represent 10 million shares of Mona Lisa, valued at $80 each. Since there are many more people on Earth who can afford to spend $80 to buy a famous work of art, a liquid market of buyers and sellers will appear, which will make trading faster and cheaper. Compare this with the slow and expensive illiquid method: today you have to look for the only buyer who wants and is able to spend $800 million to buy a painting. This also concerns real estate investments.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7211\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi.jpg\" alt=\"fractional investment in defi\" width=\"1600\" height=\"555\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi.jpg 1600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi-500x173.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi-1024x355.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi-350x121.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi-768x266.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi-1536x533.jpg 1536w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi-600x208.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/fractional-investment-in-defi-132x46.jpg 132w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/p>\n<p>source: chain.link<\/p>\n<p><strong>Liquidity.<\/strong> As indicated in the Mona Lisa example, fractionation can contribute to more favorable liquidity on the part of buyers and sellers, which allows them to carry out transactions without any problems. For clarity, the tokenization process itself does not increase the liquidity of an asset, but the increase in the number of potential buyers and sellers, due to the share ownership function of an asset due to tokenization, contributes to this effect. Since investors in illiquid assets take the risk of not finding a buyer, they need to motivate the buyer with a reduced price, known as the “discount for illiquid assets.” This discount applies to all illiquid assets and is estimated at 20-30% of the true price of assets. Through the tokenization process, it is possible to optimize markets for previously illiquid asset classes and increase true value.<\/p>\n<h2>Portfolio Management<\/h2>\n<p>Portfolio management is the process of overseeing your assets and managing their cash flow to generate returns on your investments. There are two main types of portfolio management &#8211; active and passive. Active portfolio management requires a team of portfolio managers making investment decisions to generate returns that are greater than a certain benchmark, such as the S&amp;P 500. Passive portfolio management does not require such a team; it involves mimicking the return of a certain benchmark as much as possible. In DeFi, some projects already allow passive portfolio management on a decentralized basis. DeFi&#8217;s transparency allows users to easily track how their assets are being managed and understand the costs they will incur.<\/p>\n<h2>Lending and Loans<\/h2>\n<p>Traditional financial systems require users to have bank accounts in order to use their services &#8211; a luxury that about 2 billion people currently lack. Obtaining a loan from a bank comes with other constraints such as having a good credit rating and having sufficient collateral to convince the bank that the borrower deserves the loan and is able to repay it. Decentralized lending and borrowing remove this barrier by allowing anyone to use their digital assets as collateral to obtain loans. You can also generate income from your digital assets in the lending market by contributing these assets to loan pools and earning interest on it. With decentralized lending and borrowing, there is no need for a bank account or credit check.<\/p>\n<h2>Insurance<\/h2>\n<p>Insurance is a risk management strategy whereby a person receives financial protection or compensation from an insurance company in the event of an accident. Usually, people buy insurance for cars, homes, health, and life. But is there decentralized insurance for DeFi? All tokens involved in smart contracts are potentially vulnerable to hacker attracts. Although the code of most projects has been audited, you can never know if their smart contracts are truly completely secure. There is always the possibility of a break-in, which can lead to losses. These risks lead to the need to buy insurance, especially if you operate with large amounts.<\/p>\n<h2>Exchanges<\/h2>\n<p>You can use exchanges such as Coinbase or Binance to exchange one cryptocurrency for another. Such exchanges are centralized, they act as both intermediaries and custodians of traded assets. Users of these exchanges do not have full control over their assets, which puts their assets at risk if the exchanges are hacked and fail to pay off their obligations to users. Decentralized exchanges solve this problem by allowing users to exchange cryptocurrencies without having to transfer their coins to a custodian. When users don&#8217;t store their funds on centralized exchanges, they don&#8217;t need to trust those exchanges to stay solvent.<\/p>\n<h2>Derivatives<\/h2>\n<p>A derivative is a contract whose value is derived from another underlying asset, such as stocks, commodities, currencies, indices, bonds, or interest rates. Traders can use derivatives to hedge their positions and reduce risk in any trade. Derivatives are mainly traded on centralized platforms. DeFi platforms are starting to create decentralized derivatives markets.<\/p>\n<h2>Stablecoins<\/h2>\n<p>Cryptocurrency rates are extremely volatile. To mitigate this volatility, stablecoins were created and pegged to various stable assets, in particular the US dollar. Stablecoins help users hedge against cryptocurrency volatility and are designed to act as a reliable medium of exchange. Stablecoins have quickly grown into a powerful DeFi component that plays a key role in this modular ecosystem. There are currently 33 stablecoins on CoinGecko. The top 5 stablecoins have a total market cap of over $25 billion.<br \/>\nDecentralized stablecoins are designed to address this trust issue: they are issued by decentralized over-collateralization, operate in decentralized ledgers, and are managed by decentralized autonomous organizations. Also, their reserves can be publicly verified by anyone. While stablecoins are not a financial application per se, they are important because having a stable store of value helps make DeFi applications more accessible to everyone.<br \/>\nNot all stablecoins are the same as they use different mechanisms to maintain their peg to the US dollar. There are two main types of stablecoins, namely backed by local currencies and backed by cryptocurrencies. Most stablecoins use a local currency backing system to maintain their peg to the US dollar.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7212\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/collteral-ratio.png\" alt=\"defi collteral ratio\" width=\"675\" height=\"473\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/collteral-ratio.png 675w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/collteral-ratio-500x350.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/collteral-ratio-350x245.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/collteral-ratio-600x420.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/collteral-ratio-132x92.png 132w\" sizes=\"(max-width: 675px) 100vw, 675px\" \/><\/p>\n<p><em>Important: Why do protocols need collateral?<\/em><\/p>\n<p><em>In order to reduce risks.<\/em><\/p>\n<p><em>For example, do you want to receive stable currency Dai in exchange for volatile ETH with the ability to get your ETH back at its original price when it grows up? To do this, you need to deposit ETH in a ratio of 1 to 1.7. That is, for every dollar in Dai, you need to deposit $ 1.7 in ETH. This is to ensure the operation and security of the protocol.<\/em><\/p>\n<p><em>Many other lending protocols work in a similar way. To get a loan, you must already be a member of the crypto economy and post collateral. Loans without collateral in a decentralized world are impossible until the concept of distributed reputation and identity emerges. In other words, while it is impossible to conduct credit scoring of anonymous wallets based on the history of their behavior, all credit relations will be based on the full bank reserve model.<\/em><\/p>\n<p><em>Who manages the protocols?<\/em><\/p>\n<p><em>It all depends on the specific protocol and the stage of its development. At launch, developers tend to retain a significant degree of influence over the protocol and its participants. They have a red button.<\/em><\/p>\n<p><em>With development, many protocols are transferred to user control. For this, tokens are used that give the right to vote. For example, the MKR token gives the right to vote on what assets can be accepted as collateral for the issue of the Dai stablecoin. While the Synthetix derivatives platform is managed by three DAOs, where SNX holders have voting rights.<\/em><\/p>\n<h3>Dai Vs Sai<\/h3>\n<p>Sai (SAI) is also known as Single-Collateral Dai &#8211; it is backed exclusively by Ether (ETH) as collateral. Maker began its work on December 19, 2017, with the launch of this mono-collateral Dai. On November 18, 2019, Maker announced the launch of a new multi-collateral Dai, issued to back up Ether (ETH) and\/or Basic Attention Token (BAT), as well as other cryptocurrencies. Going forward, multi-collateral Dai will be the de facto stablecoin standard supported by Maker, and eventually Sai will be phased out and no longer supported by Maker.<\/p>\n<p><em>How does Maker ensure user value?<\/em><br \/>\n<em>The black swan is an unpredictable and extreme event that can have serious consequences. In the event that ETH and BAT drop significantly in value, Maker can initiate an Emergency Shutdown. It is a process used as a last resort to settle the Maker platform by closing all positions in the system.<\/em><\/p>\n<h2>The Difference Between DeFi and Fintech<\/h2>\n<p>In fact, decentralized finance can easily be confused with financial technology. Both systems operate over the Internet and provide financial services without the involvement of banks and other traditional financial institutions. However, there are several fundamental differences between the two markets. One of the main differences is that fintech is bringing the traditional financial system to the internet, while decentralized finance is built on the blockchain.<\/p>\n<p>Fintech giant Square is a payment system that offers faster and cheaper cross-border payments compared to traditional banks. However, at the same time, the company&#8217;s platform operates with the participation of a central authority in the person of Square itself. The site carries out transactions on behalf of its customers, who are required to provide reliable identification data before opening an account.<\/p>\n<p>In the case of DeFi, it looks different. Dai is an Ethereum-based stablecoin pegged to the US dollar. A user who makes a transaction with this currency does not need to trust a particular organization to carry out the transaction. Instead, the transaction is confirmed by miners on the Ethereum blockchain<\/p>\n<h2>A Step Back From the ICO World<\/h2>\n<p>Native tokens of a DeFi development company are becoming an important tool for incentivizing participants, and at first, only ordinary tokens were issued, but recently the emergence of digital assets (governance tokens) has been observed, which can provide rights to participate in the work of the site. These are Yearn.finance, UNI (Uniswap), etc. The emergence of such governance tokens can be attributed to the fact that, unlike the ICO boom, investors want to have an instrument of direct influence on the project implementation process.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7213\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total.png\" alt=\"defi users total\" width=\"1173\" height=\"495\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total.png 1173w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total-500x211.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total-1024x432.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total-350x148.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total-768x324.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total-600x253.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-users-total-132x56.png 132w\" sizes=\"(max-width: 1173px) 100vw, 1173px\" \/><\/p>\n<p>source: Dune Analytics<\/p>\n<p>Formally, DeFi development company has taken a big step up from ICO projects. If ICO is a story that investors were forced to trust people who organize the issuance of certain tokens, then DeFi is a technological system that is based on smart contracts, and not on human decisions. This should potentially give a higher level of investment security.<\/p>\n<h3>Eliminating Problems of Traditional Finance<\/h3>\n<p>DeFi is a movement aimed at solving the main problems of traditional finance: low transaction speed, regulatory control, high fees, limited availability. It is able to eliminate these differences and provide access to financial transactions to everyone without any type of censorship. <a href=\"https:\/\/applicature.com\/customized-offerings\/blockchain-networks\/\">Applicature<\/a> identifies the following important advantages of Decentralized Finances:<\/p>\n<ul>\n<li>Decentralization, thanks to which control over the ecosystem belongs to all participants at once, transactions are fast and transparent;<\/li>\n<li>There are no intermediaries;<\/li>\n<li>Management via smart contracts;<\/li>\n<li>Open source code, which can be checked and modified at any time, as well as used to form other services based on them;<\/li>\n<li>Speed ​​and low cost of operations in decentralized networks;<\/li>\n<li>The immutability of the contracts recorded in the blockchain;<\/li>\n<li>Transparency and openness to audit;<\/li>\n<li>Lack of centralized management-everything works on smart contracts programmed in advance;<\/li>\n<li>No one can imperceptibly edit the contract in their favor; and<\/li>\n<li>The DeFi market is available to anyone with the Internet, regardless of country of residence or other factors.<\/li>\n<\/ul>\n<h3>DeFi Risks and Hazards<\/h3>\n<p>Despite all the advantages, there are also dangerous sides of decentralized finance. This is understandable since the technology is relatively new. The main risks include:<\/p>\n<ul>\n<li>Hacking smart contracts. The code is written by a person, and it is human nature to make mistakes. It makes sense to use only those platforms that have been verified by well-known auditors, although even then there is a small chance that you missed an important mistake.<\/li>\n<li>Liquidity and credit risks. The cryptocurrency is volatile, and the system may collapse if the underlying asset falls sharply. DeFi protocols try to combat this problem by over-collateralized loans.<\/li>\n<li>Lack of funds for lending. With specific collateral in DeFi, you can get a more modest loan compared to one from a traditional financial institution.<\/li>\n<li>Fake oracles. Blockchain protocols receive data (cryptocurrency rates, etc.) from external systems, which are often centralized. If the source is unreliable, then the smart contracts will be executed incorrectly. To eliminate this risk, decentralized source alternatives are being developed.<\/li>\n<li>Centralized control over development. Whatever one may say, one team is engaged in the creation of the code. In more and more cases, DeFi developers involve users in the process, but this can cause problems due to incompetent intervention. It is difficult to find a responsible person. The principle of decentralized governance does not always work out the way it was originally intended. All users are equal, but among them, there are those who aim to collapse the ecosystem, or are simply passive and not going to participate in the process (which often does no less harm than the actions of intruders).<\/li>\n<\/ul>\n<p>Nevertheless, there is a lot of buzz around DeFi at the moment. The sphere seems extremely promising and many companies are already implementing DeFi solutions into their range of services or planning to do so. Cointelegraph conducted a survey in 2020, and the results are amazing. Almost 50% of already existing platforms are planning to offer DeFi custom business services. So, if you ever wanted to launch a DeFi project, right now is the perfect timing.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7214\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-research.png\" alt=\"defi research\" width=\"743\" height=\"287\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-research.png 743w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-research-500x193.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-research-350x135.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-research-600x232.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-research-132x51.png 132w\" sizes=\"(max-width: 743px) 100vw, 743px\" \/><\/p>\n<p>Source: Cointelegraph Consulting DeFi Survey 2020<\/p>\n<h2>Final Word<\/h2>\n<p>The topic of decentralized finance is almost endless, we only covered the main aspects. Today, hundreds of applications in this area have been created and are successfully working. Some have become very popular in a matter of months, like Compound or Uniswap. The potential of DeFi has not been ignored by large companies. For example, the Binance exchange found it necessary to launch a decentralized platform, Binance DEX.<\/p>\n<p>DeFi applications and projects can be extremely useful to residents of countries with weak or unstable economies. For example, in Argentina, it was even proposed to give people a salary of DAI due to the horrific inflation of the national currency. Services are in demand in developed countries as well, since they offer a more profitable and affordable lending system and open up new opportunities for interest income from investments.<\/p>\n<p>Efficient and transparent financial services are essential for engaging users in the ecosystem, and unlike the failed attempts of the traditional financial system, decentralized finance is making strides in bringing about the necessary paradigm shift.<\/p>\n<p>When DeFi is fully matured, the use of libraries outside of the crypto community should be expected. You can add just one line of code and a completely decentralized marketplace will appear in the video game. Or add an extra line to enable retailers on a commercial site to gain benefit on balances.<\/p>\n<p>The general opinion of leading economic visionaries is that blockchain is the fundamental technology of the digital economy, on the basis of which an inclusive society of mutual creativity and trust will be built. Applicature is one of the pioneers in the sphere. If you want to launch a DeFi project, audit smart contacts, or need any support with your blockchain platform, <a href=\"https:\/\/applicature.com\/contact-us\/\">Applicature<\/a> is at your service!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Essence of DeFi Since the beginning of the practical blockchain product development, a little more than 10 years have passed, but during this time there has been a significant technological and informational leap in the development of the crypto sphere. The terminology and many concepts in this rapidly developing industry are still at the [&hellip;]<\/p>\n","protected":false},"author":13,"featured_media":7215,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[142,154,156,176,787],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"This article provides a detailed overview of DeFi technology, its utilizations, and advantages for blockchain product development systems.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"This article provides a detailed overview of DeFi technology, its utilizations, and advantages for blockchain product development systems.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2020-12-30T16:41:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-12-30T16:59:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-fundamentals.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"575\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2020\/12\/defi-fundamentals.jpg\",\"width\":1100,\"height\":575,\"caption\":\"what is defi\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/#primaryimage\"},\"datePublished\":\"2020-12-30T16:41:38+00:00\",\"dateModified\":\"2020-12-30T16:59:11+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\"},\"description\":\"This article provides a detailed overview of DeFi technology, its utilizations, and advantages for blockchain product development systems.\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\/\",\"name\":\"The Fundamentals of DeFi\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\",\"name\":\"Victoria Melnychuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/g12-scaled.jpg\",\"caption\":\"Victoria Melnychuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/7204"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=7204"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/7204\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/7215"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=7204"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=7204"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=7204"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}