{"id":7226,"date":"2021-02-18T16:50:05","date_gmt":"2021-02-18T16:50:05","guid":{"rendered":"https:\/\/applicature.com\/?p=7226"},"modified":"2021-03-03T11:33:01","modified_gmt":"2021-03-03T11:33:01","slug":"how-do-you-launch-a-defi-project","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project","title":{"rendered":"Decentralized Finance Development: Revolutionize your Blockchain Project"},"content":{"rendered":"<p>Before starting a DeFi development company, you first need to explore the industry to determine the most demanded areas. Being a pioneer in blockchain development and smart contract auditing, Applicature is now taking a step forward into decentralized finance. In this article, we will provide an overview of the basics of this industry and identify the most important activities.<\/p>\n<h2>What’s DeFi?<\/h2>\n<p><strong>Decentralized finance (DeFi)<\/strong> is an ecosystem of decentralized financial services on public blockchains. It is positioned as an <strong>alternative to the traditional financial system<\/strong> without intermediaries and government control. The DeFi industry includes lending and deposit platforms, decentralized exchanges (DEXs), algorithmic stablecoins, synthetic tokens, and tokenized asset exchanges, and mutual insurance platforms. Most of the DeFi applications run on the Ethereum blockchain, but they also operate on other blockchains: Tron, NEO, Polkadot, EOS, Waves, Ontology, etc.<\/p>\n<p>One of the <a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/the-fundamentals-of-defi\">definitive features of DeFi<\/a> is that by transferring crypto assets to a smart contract of the DeFi project, the users do not lose control over them. They can make a reverse transaction at any time and receive the original crypto asset. Smart contracts significantly reduce the impact of the human factor, but they cannot completely eliminate errors in the code and the possibility of fraud.<\/p>\n<p>In 2020, the DeFi industry entered a period of explosive growth:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7227\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company.jpg\" alt=\"defi development company\" width=\"1200\" height=\"787\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company.jpg 1200w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company-500x328.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company-1024x672.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company-350x230.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company-768x504.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company-600x394.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-company-132x87.jpg 132w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<p>Decentralized finance platforms do not have a single governing body; their scope is limited by protocol. Most projects have their own user community that votes for changes in the smart contract code. As a rule, they are not related to day-to-day operations but participate in votes on modifying platform smart contracts and other important decisions.<\/p>\n<p>DeFi complies with the following principles:<\/p>\n<ul>\n<li>open-source;<\/li>\n<li>availability for every user; and<\/li>\n<li>financial transparency.<\/li>\n<\/ul>\n<p><em>Note: The decentralization of financial services is closely related to the concept of <a href=\"https:\/\/www.forbes.com\/sites\/forbestechcouncil\/2020\/01\/06\/what-is-web-3-0\/?sh=654aeeb858df\" target=\"_blank\" rel=\"noopener noreferrer\">Web 3.0<\/a> &#8211; the new era of the Internet’s evolution. Along with the development of network technologies, user data ceased to belong to them, and the &#8220;security&#8221; of the Internet is regulated by a small group of well-known technology giants. Presumably, Web 3.0 should return users the right to privacy. Blockchain technologies and smart contracts can become a real competitor to the traditional financial system, if only because they provide users with equal opportunities. Over time, the development of new financial technologies will become even more simplified, and this in turn will lead to the explosive growth of DeFi platforms.<\/em><\/p>\n<p>When launching a DeFi development company, first consider the following most widely used applications:<\/p>\n<ul>\n<li>non-custodial platforms for <a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/get-a-loan-of-this-how-defi-disrupts-lending-borrowing\">lending and borrowing<\/a>;<\/li>\n<li>decentralized crypto exchanges;<\/li>\n<li>prediction markets;<\/li>\n<li>futures creation protocols and much more.<\/li>\n<\/ul>\n<p>The <strong>key advantage of DeFi<\/strong> is the transparency provided by the very <a href=\"https:\/\/applicature.com\/blog\/blockchain-startups\/blockchain-implementation\">essence of blockchain technologies<\/a>:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7228\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project-blockchain-advantages.png\" alt=\"Launch DeFi project blockchain advantages\" width=\"731\" height=\"527\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project-blockchain-advantages.png 731w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project-blockchain-advantages-500x360.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project-blockchain-advantages-350x252.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project-blockchain-advantages-600x433.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project-blockchain-advantages-132x95.png 132w\" sizes=\"(max-width: 731px) 100vw, 731px\" \/><\/p>\n<p>Source: McKinsey&amp;Company<\/p>\n<p>The information about all trading operations, liquidity placement in pools, its withdrawals, and the total amount of funds blocked in protocols is publicly available. The functioning of Smart contracts practically excludes the human factor and the possibility of manipulation.<\/p>\n<h2>DeFi Use Cases<\/h2>\n<p>The <strong>main goals of DeFi<\/strong> are to become an alternative to the traditional banking sector and to replace existing financial products with open source decentralized protocols. The protocols can provide all people with access to decentralized platforms that allow them to make financial transactions, save on loans and transactions, and also get the maximum benefit from deposits.<\/p>\n<p>DeFi can also bring value to the following spheres:<\/p>\n<ul>\n<li><em>Decentralized Stablecoins<\/em>: Investing in coins pegged to fiat currencies, crypto, and\/or other physical assets is a commonly used investment option. As of today, the leader of the DeFi Pulse rating is the MakerDAO project with a decentralized stablecoin, Dai, and a utility stablecoin, Maker. The Compound project tokens have landed on the third position.<\/li>\n<li><em>Non-Custodial Landing Protocols<\/em>: Yearn finance loans can be obtained directly without resorting to banks or other intermediaries. This service allows using a protocol from a number of recently created ones &#8211; Aave, Compound, Fulcrum, and MakerDAO. You can borrow funds or lend them in ETH or new tokens like Dai, USDC, and others. This opportunity is definitely a revolutionary breakthrough in the financial sector. Traditional banking has never allowed this.<\/li>\n<li><em>Decentralized Exchanges (DEX)<\/em>: A new way to trade DeFi tokens is provided on DEX (decentralized exchanges). You can earn money yourself without filling out complex forms or paying the intermediaries. You can conduct trade without submitting to the oligopoly of the largest players.<\/li>\n<li><em>Peer-to-peer Prediction Markets<\/em>: This means that users can apply algorithms to predict contracts. Using various data, for example, a token placement schedule, a listing (which includes relatively recently released and immediately popular cryptocurrencies, such as YFI), and other instruments, you can place bets and earn money.<\/li>\n<li><em>Synthetic Assets<\/em>: This relatively new direction is the creation of protocols that allow the release of synthetic assets using smart contracts. It all started with the Synthetix company. Derivatives are among the products that are planned to be backed up by standardized contracts.<\/li>\n<li><em>Security Token Offering Platforms<\/em>: Security tokens are issued as required by the relevant legislation governing transactions with securities. It is possible to conduct transactions on the platforms Harbor, Polimatch, Securitize, and Tokeny.<\/li>\n<li><em>DeFi Escrow<\/em>: If you are considering how to buy tokens or other assets without the risk of fraud, then use Arwen. Ampleforth cryptocurrency is used to trade on the exchange without placing your own funds. The attractiveness of Arwen for individuals and companies also lies in the exclusion of a hacker attack.<\/li>\n<\/ul>\n<p>All these areas of DeFi development are promising. If you are new to this industry, we recommend taking a look at the most successful platforms. Learning the curve of their way to the top will help you promote your DeFi project. According to <a href=\"https:\/\/defipulse.com\/\">DeFi Pulse<\/a>, these are the most financially flourishing platforms:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-7229\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development.png\" alt=\"defi development\" width=\"738\" height=\"296\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development.png 738w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-500x201.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-350x140.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-600x241.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/defi-development-132x53.png 132w\" sizes=\"(max-width: 738px) 100vw, 738px\" \/><\/p>\n<h2>Successful DeFi Projects<\/h2>\n<p>New DeFi projects appear almost daily. But there are those that have managed to climb to the top and beat their competitors with real working solutions. These are the three most interesting platforms:<\/p>\n<h3>InstaDApp<\/h3>\n<p><a href=\"https:\/\/instadapp.io\/\">InstaDApp<\/a> is a smart wallet with an intuitive interface that works with the most popular DeFi products. The wallet allows users to easily manage their DeFi products, such as leveraging funds, repaying loans, and lending assets. One of the most popular InstaDApp features is debt transfer between the Maker Vaults and Compound Finance platforms.<\/p>\n<h3>Compound Dai<\/h3>\n<p><a href=\"https:\/\/compound.finance\/\">Compound<\/a> is a platform that allows users to borrow or deposit their funds in a credit pool and earn at an interest rate. The rates on the service are adjusted automatically in accordance with the demand and supply of the market. The peculiarity of Compound is that assets received in the controlled system are tokenized through composite tokens (cTokens). When a user deposits ERC20 tokens, the corresponding cTokens equivalent is allocated to users. After conversion, custom assets are free to move\/sell\/use within other DApps.<\/p>\n<h3>Yearn.finance<\/h3>\n<p>The <a href=\"https:\/\/yearn.finance\/\">yearn.finance<\/a> platform is designed to optimize the issuance of tokens through the use of the Curve and Compound, Aave, and dYdX protocols. In total, it supports almost two dozen known DeFi protocols. The YFI token showed a fantastic growth in value: its market cap is now valued at almost one billion dollars. The price of the YFI token exceeds $32,000.<\/p>\n<h2>How to Launch a DeFi Project?<\/h2>\n<p>The <strong>most valuable knowledge necessary to launch a DeFi project<\/strong> <strong>is expertise in Smart contract development, editing, and auditing<\/strong>. This is exactly what <strong>Applicature did<\/strong> <strong>for <a href=\"https:\/\/www.lotto.finance\/about\">Lotto<\/a><\/strong>. The thing is, DeFi typically employs digital asset technologies, smart contracts, protocols and decentralized applications (DApps), which are all often built on the Ethereum blockchain. The technology allows the creation of complex, irreversible agreements without the need for intermediaries such as government agencies and large companies.<\/p>\n<p>Also, the <a href=\"https:\/\/applicature.com\/\">development of DeFi projects<\/a> is possible within the <a href=\"https:\/\/eos.io\/\">EOS<\/a> and <a href=\"https:\/\/bitcoin.org\/en\/\">Bitcoin<\/a> ecosystems. Decentralized financial instruments can be linked together in various ways, thanks to token standardization and software compatibility of smart contracts.<\/p>\n<p>In short, the roadmap to launch a DeFi project looks like this:<\/p>\n<ul>\n<li>Idea: Come up with a solid purpose for your DeFi token. It has to solve a certain problem or provide access to demanded services.<\/li>\n<li>Logo: Come up with an eye-catching token name\/logo.<\/li>\n<li>Foundation: Determine a relevant blockchain ecosystem for your token;<\/li>\n<li>Development: You will need to hire DeFi developers that have a background in Smart contract creation.<\/li>\n<li>Wallet: Set up all necessary wallet functions (fee\/alerts\/address).<\/li>\n<li>Transaction: Make sure that transferring your token between wallets is safe.<\/li>\n<li>Listing: Place the token on <a href=\"https:\/\/coinmarketcap.com\/ru\/rankings\/exchanges\/dex\/\">DEX<\/a>.<\/li>\n<li>Marketing: To <a href=\"https:\/\/applicature.com\/services\/marketing\/\">promote your DeFi project<\/a>, it is best to resort to a marketing agency.<\/li>\n<\/ul>\n<p>This is a short overview of what needs to be done. In the near future, we will prepare a step-by-step guide on how to launch a DeFi project. So stick around!<\/p>\n<h3>How is a DeFi App Different from Normal DApp?<\/h3>\n<p>Even though Dapps and DeFi apps have much in common, in that they are cryptographically protected, provide decentralization and an open-source functioning environment, there are still several significant distinctions between them. If you are about to launch a DeFi project, remember that DeFi apps usually have the following characteristics:<\/p>\n<ol>\n<li>Apps are built for banking\/financial services;<\/li>\n<li>Non-custodial wallets allow financial operations;<\/li>\n<li>DeFi apps provide users with full control over their funds;<\/li>\n<li>All intermediaries are excluded;<\/li>\n<li>No KYC-procedures are required;<\/li>\n<li>No minimums are required for participation in transactions; and<\/li>\n<li>DeFi apps and services are accessible in any part of the world.<\/li>\n<\/ol>\n<h2>Risks and Hazards<\/h2>\n<p>After the advent of DeFi, it was widely believed that using decentralized apps was completely safe. However, there are many risks hidden within the DeFi environment. Each self-respecting DeFi development agency must be aware of them. Take a look at our list:<\/p>\n<ul>\n<li>The volatility of cryptocurrencies: Lending platforms and algorithmic stablecoins operate with excess collateral. If the value of the collateralized asset drops by 30-50%, the protocols will begin the automatic liquidation of collateral.<\/li>\n<li>Fake tokens: On decentralized exchanges, anyone can create their own token and trade it. Fraudsters often create copies of tokens of popular projects, and inattentive users buy worthless tokens with real cryptocurrencies.<\/li>\n<li>DeFi developers fraud: There are examples of DeFi projects initially set up for fraud. As a rule, users do not study the code of smart contracts and donate their cryptocurrencies to scammers themselves.<\/li>\n<li>Smart contracts vulnerabilities and errors: Any program code can contain bugs, and decentralized applications rarely go through a qualified audit. Hackers can withdraw user tokens, manipulate token prices, or cause collateral to be liquidated in their favor.<\/li>\n<li>Error or hacking of a platform smart contract with partial theft of funds from pools: Such incidents have already occurred, while some platforms have compensated for losses, and some have not.<\/li>\n<li>Commissions when interacting with contracts: Users are charged for each movement. Taking into account the high hype, the cost of transactions on the Ether network can reach several dollars.<\/li>\n<li>Therefore, before you start, calculate whether you can recoup the cost of commissions.<br \/>\nThere are no regulations: This is a plus to anonymity and decentralization, but in case of failures in a smart contract, you will only have to rely on founders who are often reluctant to take responsibility for failures.<\/li>\n<\/ul>\n<h2>Final Word<\/h2>\n<p>DeFi is a new and extremely promising sphere of the cryptocurrency market. The prospects that a decentralized financial market opens up look truly fascinating. If you want to launch a DeFi project, your timing couldn’t be better!<\/p>\n<p>We hope the article helped you better understand the essence of this technology. But if you still have any questions left, don’t hesitate to contact us. Being a blockchain innovation agency, our field of performance is diverse: we conduct smart contract audits, provide blockchain advisory services, and help clients launch platforms and make a profit on DeFi.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Before starting a DeFi development company, you first need to explore the industry to determine the most demanded areas. Being a pioneer in blockchain development and smart contract auditing, Applicature is now taking a step forward into decentralized finance. In this article, we will provide an overview of the basics of this industry and identify [&hellip;]<\/p>\n","protected":false},"author":13,"featured_media":7230,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[131,132,133],"tags":[156,789,791,792,257],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"description\" content=\"What is DeFi, how do you launch a DeFi project, and how can you start making money on it? Revolutionize your finance firm with Applicature!\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Let&#039;s see how to launch a DeFI project\" \/>\n<meta property=\"og:description\" content=\"Being a pioneer in blockchain development and smart contract auditing, Applicature is now taking a step forward into decentralized finance. In this article, we will provide an overview of the basics of this industry and identify the most important activities.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-02-18T16:50:05+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-03-03T11:33:01+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"575\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Let&#039;s see how to launch a DeFI project\" \/>\n<meta name=\"twitter:description\" content=\"Being a pioneer in blockchain development and smart contract auditing, Applicature is now taking a step forward into decentralized finance. In this article, we will provide an overview of the basics of this industry and identify the most important activities.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/Launch-DeFi-project.jpg\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/#primaryimage\"},\"datePublished\":\"2021-02-18T16:50:05+00:00\",\"dateModified\":\"2021-03-03T11:33:01+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\"},\"description\":\"What is DeFi, how do you launch a DeFi project, and how can you start making money on it? Revolutionize your finance firm with Applicature!\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-startups\/how-do-you-launch-a-defi-project\/\",\"name\":\"Decentralized Finance Development: Revolutionize your Blockchain Project\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/102d9cef34d05c3f2b15897c12b81a77\",\"name\":\"Victoria Melnychuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/02\/g12-scaled.jpg\",\"caption\":\"Victoria Melnychuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/7226"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=7226"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/7226\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/7230"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=7226"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=7226"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=7226"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}