{"id":8047,"date":"2021-04-10T10:30:47","date_gmt":"2021-04-10T10:30:47","guid":{"rendered":"https:\/\/applicature.com\/?p=8047"},"modified":"2021-05-06T07:51:34","modified_gmt":"2021-05-06T07:51:34","slug":"layer-2-solutions","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions","title":{"rendered":"Layer 2 solutions"},"content":{"rendered":"<p style=\"text-align: justify;\">The Scaling of blockchains has been a significant challenge for it to gain mainstream adoption. However, in recent times, there have been significant improvements in the areas of speed and cost, which has been a critical issue as the blockchain grows. Thanks to second-layer technologies, ultra-high speed and reduced charges have become possible across blockchain platforms.<\/p>\n<p><center><img loading=\"lazy\" class=\"size-medium wp-image-8048 aligncenter\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-Project-500x335.png\" alt=\"Layer 2 Project\" width=\"500\" height=\"335\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-Project-500x335.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-Project-350x234.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-Project-600x402.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-Project-132x88.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-Project.png 648w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/center><\/p>\n<p style=\"text-align: justify;\">Layer 2 projects<\/p>\n<p style=\"text-align: justify;\">Source:Block123 (<a href=\"https:\/\/www.block123.com\/en\/feature\/awesome-layer-2-list\/\">https:\/\/www.block123.com\/en\/feature\/awesome-layer-2-list\/<\/a>)<\/p>\n<p style=\"text-align: justify;\"><strong>Introduction to Layer 1 and Layer 2<\/strong><\/p>\n<p style=\"text-align: justify;\">Research is still in progress to solve scalability issues in blockchain technologies. The ecosystem is currently experiencing disruptions, with Ethereum no longer looking like the DeFi king and other rival blockchains discovering new ways to make transaction processing faster and cheaper. At <a href=\"https:\/\/applicature.com\/\">applicature<\/a>, a <a href=\"https:\/\/applicature.com\/blockchain-development\/\">blockchain marketing company<\/a><strong>,<\/strong> we are a <a href=\"https:\/\/applicature.com\/blockchain-development\/\">blockchain developer <\/a>with the expertise and experience in developing high-end tools for <a href=\"https:\/\/applicature.com\/services\/blockchain-development\/decentralized-applications\/\">solidity developer DeFi<\/a> and scaling or migrating your existing blockchain.<\/p>\n<p style=\"text-align: justify;\"><strong>Why is L2 needed?<\/strong><\/p>\n<p style=\"text-align: justify;\">The Scaling of blockchains is becoming a necessity today to promote the widespread adoption of the technology by private individuals and companies worldwide. With ongoing research, there will be faster blockchain processing capacities soon. This process can be achievable by scaling the different blockchain layers.<\/p>\n<p style=\"text-align: justify;\">Currently, the main blockchains Bitcoin achieves around 3-4 transactions per second while Ethereum allows 15 transactions per second which makes the capacity of VisaNet which can effortlessly handle 1700 transactions per second and process more during peak times, the ideal throughput in payment capacity.<\/p>\n<p style=\"text-align: justify;\"><strong>Blockchain Layers to Scale<\/strong><\/p>\n<p style=\"text-align: justify;\">There are two common blockchain layers. The Mainnet or the primary blockchain like Ethereum is regarded as Layer 1, while Layer 2 refers to the other set of technologies or systems that run on top of Ethereum (Layer 1). The layer 2 protocols have the following features:<\/p>\n<ul style=\"text-align: justify;\">\n<li>They inherit the security properties from Layer 1<\/li>\n<li>They provide a larger transaction processing volume (throughput)<\/li>\n<li>They have lower transaction fees (operating cost)<\/li>\n<li>They have faster transaction approvals than Layer 1.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">In general, the Layer 2 scaling solutions get secured by Layer 1, but they facilitate the handling of more users, data, and operations than Layer 1 in blockchain applications.<\/p>\n<p style=\"text-align: justify;\">It is possible to scale the blockchain by either scaling the Layer 1 protocol (L1 scaling) or layer 2 solutions on top of the blockchain (L2 Scaling). Layer 2 scaling is carried out by using solutions on top of the L1 protocol (e.g., Ethereum) that do not require changing the blockchain&#8217;s core code. There are multiple benefits of scaling any of the blockchain layers; it provides a multiplicative effect in combination with the other layer. For example, scaling layer 1 protocol 10 times and layer 2 solutions 100 times will produce a net 1000 times throughput enhancement.<\/p>\n<p style=\"text-align: justify;\">There is a difference between second layer scaling and sidechains, which are linked to the main chain. The main advantage of well-implemented L2 technologies is that the core chain is linked to the L2 in a way that it recognizes some of the processes taking place in the solution layer 2 and acts as a check and balance in resolving disputes that might emanate from the second layer, for example, to determine whether funds have been spent or not. Some of them come with privacy features that may be desired or unwanted.<\/p>\n<p style=\"text-align: justify;\">Availability of data is another significant factor to consider when developing L2 solutions. There is a need to determine whether the data relating to transfer on L2 is available on the main chain. Some methods store data on transfer off-chain as seen in Plasma, which can bring challenges if users need to collect data later. On the other hand, ZK-rollups use a method that allows the storage of data on-chain and makes it easy to access anytime.<\/p>\n<h3 style=\"text-align: justify;\"><strong>First Layer Scaling Approaches<\/strong><\/h3>\n<p style=\"text-align: justify;\">First layer scaling<\/p>\n<p style=\"text-align: justify;\">Even though this article&#8217;s focus is layer 2 scaling, let&#8217;s take a quick look at how this works in the base protocol. A popular example is done through sharding, as expected in the case of Ethereum 2. Sharding means adding a parallel to the blockchain. This is expected to boost the throughput of Ethereum to 10,000 transactions per second.<\/p>\n<p style=\"text-align: justify;\">Another approach that can be used in achieving increased scaling is by optimizing the transactions directly using more efficient signature algorithms. Ethereum 2 is expected to use the BLS signatures, and bitcoin uses the Schnorr signatures currently in development. These signatures will significantly reduce the amount of block space occupied by a subset of transactions.<\/p>\n<p style=\"text-align: justify;\">Finally, a direct approach to layer 1 scaling requires increasing the block size limit. This example is seen in Bitcoin SV, where a single 370MB block revealed it contains 1.3million transactions after mining. This shows around 2200 transactions per second.<\/p>\n<h3 style=\"text-align: justify;\"><strong>Layer 2 scaling approaches<\/strong><\/h3>\n<p><center><img loading=\"lazy\" class=\"size-medium wp-image-8049 aligncenter\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/LAYER-500x401.png\" alt=\"Layer 2 scaling\" width=\"500\" height=\"401\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/LAYER-500x401.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/LAYER-350x280.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/LAYER-600x481.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/LAYER-132x106.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/LAYER.png 639w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/center><\/p>\n<p style=\"text-align: justify;\">Layer 2 scaling<br \/>\nSource: Finematics (<a href=\"https:\/\/finematics.com\/ethereum-layer-2-scaling-explained\/\">https:\/\/finematics.com\/ethereum-layer-2-scaling-explained\/<\/a> )<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong>More breakthroughs have been recorded regarding many L2 scaling solutions. Three main approaches have been identified, and they are:<\/p>\n<ul style=\"text-align: justify;\">\n<li>Payment and state channels<\/li>\n<li>Child Blockchains, known as Plasma<\/li>\n<li>ZK-rollups, also known as semi-L2, because of their validation guarantee and data availability on the main chain core<\/li>\n<li>Validum<\/li>\n<li>Sidechains<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Whatever method you prefer, our <strong>solidity Defi developers<\/strong> at applicature are up to the task. We will help you with your blockchain scaling using the latest technologies and validated methods. Let&#8217;s dive deeper into how these scaling methods work.<\/p>\n<p style=\"text-align: justify;\"><strong>Payment and state channels<\/strong><\/p>\n<p style=\"text-align: justify;\">This method is one of the old-generation concepts. Payment channels, known as state channels, allow users to transfer assets and updates to the blockchain&#8217;s status in general. <strong>Popular examples <\/strong>of projects using this scaling method include Raiden and FinFair&#8217;d fate channels for Ethereum, Lightning Network for Bitcoin, and Aeternity that feature built-in protocol with support for blockchain state channels.<\/p>\n<p style=\"text-align: justify;\">The core of channels allows the exchange of transactions between each other instead of writing every transaction directly on the chain. This approach generates a massive scalability gain and an almost instantaneous transaction throughput. Only the results are recorded on the main blockchain layer. This type of Scaling becomes ideal when two parties carry out large volume transactions with each other in the future.<\/p>\n<p style=\"text-align: justify;\">However, special protection against malicious activity by either party needs to be incorporated in the channel&#8217;s design. This is because any of the channel&#8217;s involved parties can withdraw their funds from the channel back to the main blockchain.<\/p>\n<p style=\"text-align: justify;\">Even though channels have existed for some time, mainstream adoption delay can be attributed to their high requirements for payment routing and keeping the channel open when more than two parties are involved.<\/p>\n<p style=\"text-align: justify;\"><strong>Child Blockchains (Plasma)<\/strong><\/p>\n<p style=\"text-align: justify;\">Another method of achieving L2 Scaling is to create child blockchains that are linked to the main chain.<strong> A typical example<\/strong> is the current Ethereum Blockchain. These blockchains often write the blueprint of their state to the root chain, and users can easily access the <a href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/plasma-release\">Plasma<\/a> (Child) chain via a smart contract.<\/p>\n<p style=\"text-align: justify;\">The plasma chain can operate under different rules like a different speed, consensus mechanism from the main chain. For instance, it can be set to follow a different set of requirements for a payment network or decentralized app. However, if a user wants to exit the chain, they will need a certain &#8220;challenge period&#8221; to prevent any fraudulent activity.<\/p>\n<p style=\"text-align: justify;\">This process of exiting may be one of the challenges of Plasma chains. In a situation where there is congestion of the root chain alongside a mass exit from the child chain, the challenge period might be too short to prevent any malicious activity that might take place. On the other hand, a longer challenge period creates friction and loss of opportunities due to a lack of immediate access to their assets or funds.<\/p>\n<p style=\"text-align: justify;\"><strong>A classic example<\/strong> of a Plasma chain was recently launched by OMG Network (OmiseGo) after years of development. It speeds up transactions to as much as greater than 1000 transactions per second at a one-third cost for each transaction. It has already been integrated with Tether, a major gas user on Ethereum.<\/p>\n<p style=\"text-align: justify;\"><strong>zk-Rollups<\/strong><\/p>\n<p style=\"text-align: justify;\">zk-Rollups stands out as unarguably the most promising scaling method. They use a form of algorithm known as transaction batching, where SNARKs or STARKs are used to compress many transactions (for example, a simple value transfer from column A to B) into one on-chain transaction. SNARKs (succinct non-interactive\/transparent argument of knowledge) are a cryptographic technique applied by <strong>Zcash<\/strong> for their privacy guarantees, but zk-rollups demonstrate the benefits that they might offer for scalability.<\/p>\n<p style=\"text-align: justify;\">Users gain access to the system using a smart contract, and relayers who receive incentives take care of grouping transactions and generating SNARK proofs, which is usually computation-intensive and often a bottleneck to the systems.<\/p>\n<p style=\"text-align: justify;\">Loopring, a decentralized exchange platform, carried out the first use case of this system on the Ethereum mainnet. They optimized the generation of proofs, which made them lower costs per trade to $0.000124.<\/p>\n<p style=\"text-align: justify;\">By design, the original aim of this system is to make operations proceed smoothly on the decentralized exchange; it also gives room for simple transfers of ETH or ERC-20 tokens among users. This feature could scale Ethereum transaction capacity by 1000 times, a remarkable achievement by Loopring Pay. Their token, LRC, recorded positive gains of nearly 75% after the launch.<\/p>\n<p style=\"text-align: justify;\">StarkWare&#8217;sStarkEx showed how onboarding large communities on the Ethereum mainnet does not lead to congestion when using their zk-rollup technology based on STARKs. They were able to successfully set up 1.3M accounts and seed them with an opening balance utilizing just 2.5% of Ethereum&#8217;s capacity within 12 hours, at an average cost per transaction of $0.003. That process would have used the entire capability of Ethereum for 4.5 days without the zk-rollup.<\/p>\n<p style=\"text-align: justify;\"><strong>Validum<\/strong><\/p>\n<p style=\"text-align: justify;\">Validum operates by a mechanism similar to a zkRollup; the only difference is that data is made available on-chain in a zkRollup, while Validum stores it off-chain. This allows Validum to produce considerably higher throughput. However, this may be a drawback because data&#8217;s non-availability can deny users the right to move their funds.<\/p>\n<p style=\"text-align: justify;\"><strong>Sidechains<\/strong><\/p>\n<p style=\"text-align: justify;\">Sidechains allow the enhancement of existing blockchains. It is a separate blockchain attached to a parent blockchain. It sets its security and terms for transactions. This is a method of scaling up an existing blockchain.<\/p>\n<p style=\"text-align: justify;\">Current Sidechain Platforms include:<\/p>\n<ul style=\"text-align: justify;\">\n<li><strong>Rootstock&#8217;s (RSK)<\/strong> created an open-source testnet called Ginger. It features a two-way peg with the Bitcoin blockchain that offers rewards for Bitcoin miners through merged mining. Ginger will enable the Bitcoin blockchain to possess smart contract capacities and speed up payments.<\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><strong>Ardor&#8217;s Blockchain: <\/strong>This is a business service platform that uses the Proof of Stake consensus mechanism. Ardor&#8217;s &#8216;childchains&#8217; are tightly integrated into the main chain while bringing benefits like enhanced security, access to global currencies, and speed.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><strong>How Ethereum Layer 2 scaling solutions address barriers to enterprises building on Mainnet<\/strong><\/p>\n<p style=\"text-align: justify;\">Most Layer 2 solutions are localized on servers or clusters of servers, often referred to as nodes, block, producer, validator, operator, sequencer, or other similar terms. These L2 nodes may be run or implemented by businesses or entities that use them, or by a 3rd party validator, or a large group of people similar to the Mainnet.<\/p>\n<p style=\"text-align: justify;\">Transactions are generally submitted to these L2 nodes instead of direct submission to L1; the L2 instance then merges them into groups before securing them to L1, after which they cannot be altered once L1 secures them. The method of implementation varies significantly between different L2 technologies.<\/p>\n<p><center><img loading=\"lazy\" class=\"size-medium wp-image-8050 aligncenter\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Ethereum-500x306.png\" alt=\"Ethereum\" width=\"500\" height=\"306\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Ethereum-500x306.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Ethereum-350x214.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Ethereum-600x368.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Ethereum-132x81.png 132w, https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Ethereum.png 625w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/center><\/p>\n<p style=\"text-align: justify;\">Ethereum<\/p>\n<p style=\"text-align: justify;\">Source: <a href=\"https:\/\/www.freepik.com\/premium-vector\/ethereum-digital-currency-money-background_2020087.htm\">https:\/\/www.freepik.com\/premium-vector\/ethereum-digital-currency-money-background_2020087.htm<\/a><\/p>\n<p style=\"text-align: justify;\"><strong>Private vs. Public Ethereum<\/strong><\/p>\n<p style=\"text-align: justify;\">Many businesses are building applications on or testing with private blockchains. This includes private Enterprise Ethereum technologies, even though Ethereum Mainnet&#8217;s open and decentralized nature provides certain advantages. They are:<\/p>\n<ul style=\"text-align: justify;\">\n<li>More powerful security\/immutability<\/li>\n<li>Transparent management<\/li>\n<li>Lower operating cost<\/li>\n<li>Interoperability with other applications on the Mainnet (network effects)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Sharing a common frame allows synchronization of data instead of creating many unnecessary isolated silos. The benefits of L2 are secured by L1, which provides a common reference, global transaction ordering, and management. The L2 makes applications work together effortlessly through cross-chain integration.<\/p>\n<p style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/p>\n<p style=\"text-align: justify;\">Second layer scaling is on the right path to success, and scaling factors up to 1,000 times are significant accomplishments that support this claim. Onboarding users to these systems will also be successful given the reduced transaction costs, the financial incentives, and the speed for users to activate network effects.<\/p>\n<p style=\"text-align: justify;\">In the future, many L2 solutions will contribute to a vibrant and robust blockchain ecosystem and favor its mainstream adoption. Overall, factors like reduced cost, enhanced speed, and improved usability of the chain are in place. The puzzle&#8217;s final pieces are the large integration of these solutions and user-friendly interfaces that do not require deep blockchain know-how.<\/p>\n<p style=\"text-align: justify;\">That is where our savvy solidity <a href=\"https:\/\/applicature.com\/blockchain-development\/\">blockchain developer<\/a> at applicature come in; we give you the best Scaling that all the end-users notice is increased speed and reduced costs. These will be good for your platform, <a href=\"https:\/\/applicature.com\/contact-us\/\">contact us<\/a>, and let&#8217;s discuss scaling up your business to limitless possibilities.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Scaling of blockchains has been a significant challenge for it to gain mainstream adoption. However, in recent times, there have been significant improvements in the areas of speed and cost, which has been a critical issue as the blockchain grows. Thanks to second-layer technologies, ultra-high speed and reduced charges have become possible across blockchain [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":8051,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>- Applicature<\/title>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"- Applicature\" \/>\n<meta property=\"og:description\" content=\"The Scaling of blockchains has been a significant challenge for it to gain mainstream adoption. However, in recent times, there have been significant improvements in the areas of speed and cost, which has been a critical issue as the blockchain grows. Thanks to second-layer technologies, ultra-high speed and reduced charges have become possible across blockchain [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-04-10T10:30:47+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-06T07:51:34+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-solutions.png\" \/>\n\t<meta property=\"og:image:width\" content=\"645\" \/>\n\t<meta property=\"og:image:height\" content=\"335\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2021\/05\/Layer2-solutions.png\",\"width\":645,\"height\":335,\"caption\":\"Layer2 solutions\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/\",\"name\":\"- Applicature\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/#primaryimage\"},\"datePublished\":\"2021-04-10T10:30:47+00:00\",\"dateModified\":\"2021-05-06T07:51:34+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/85bcf20fe20c8676bbd6feaf7cebdbab\"},\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/\",\"url\":\"https:\/\/applicature.com\/blog\/blockchain-technology\/layer-2-solutions\/\",\"name\":\"Layer 2 solutions\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/85bcf20fe20c8676bbd6feaf7cebdbab\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"admin\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/8047"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=8047"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/8047\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/8051"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=8047"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=8047"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=8047"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}