{"id":977,"date":"2018-03-14T18:16:43","date_gmt":"2018-03-14T18:16:43","guid":{"rendered":"https:\/\/applicature.com\/?p=977"},"modified":"2022-01-11T16:15:50","modified_gmt":"2022-01-11T16:15:50","slug":"how-to-launch-initial-coin-offering","status":"publish","type":"post","link":"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering","title":{"rendered":"How to Launch an Initial Coin Offering?"},"content":{"rendered":"<p>Have you ever found yourself wondering what <em>ICO<\/em> actually means? How to launch an initial coin offering to collect money for your business idea? Let’s take a look at its main features. An ICO is a comparatively new experience in the modern economic community. Still, it has rapidly become one of the main topics of note. An ICO is an independent mechanism that aims to gather funds for a new project idea and later exchange them for cryptocurrency units as Ether or Bitcoin. The general idea of launching an ICO process is to collect funds from investors and those who support your startup, store them, and later distribute them in tokens. By regulating and administering the original coin supply, developers as well as investors mutually benefit, motivated by the return on their investments.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-978 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg.jpg\" alt=\"How to launch an initial coin offering. The ICO method.\" width=\"1118\" height=\"630\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg.jpg 1118w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg-350x197.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg-500x282.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg-768x433.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg-1024x577.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg-600x338.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/The_ICO_method.jpg-132x74.jpg 132w\" sizes=\"(max-width: 1118px) 100vw, 1118px\" \/><br \/>\nAn ICO is usually used by small businesses or startups to get through an inclement fundraising process — an obligatory step for banks and capitalists. Because it’s an innovative take on the traditional funding model, an ICO launch platform allows the collection of large sums of money by implementing technologies like the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/erc20-wallet\" target=\"_blank\" rel=\"noopener noreferrer\">ERC20 Token Standard<\/a><\/span>.<\/p>\n<h2>ICO vs. IPO<\/h2>\n<p>The ICO process is partially related to the initial public offering (IPO). The latter deals with investors who wish to raise money for a startup by distributing shares to the public. This is usually done through investment banks; therefore, an IPO is more centralized and is controlled by a corporation. However, the funds raised in an IPO campaign are mostly donations, as IPOs offer only dividends in terms of profit.<\/p>\n<p>ICOs, on the other hand, offer tokens at a much higher rate of exchange than the original investment. In a crowdfunding process like this, financiers have the right to buy tokens and trade or exchange them. That&#8217;s why ICOs were originally referred to as “crowd sales.” Another drawback of running an IPO campaign is that you need to be a recognized private company. It also takes a lot of time. Sometimes, it can take years of activity to carry it out. Therefore, the following advantages of ICOs should be emphasized:<\/p>\n<ul>\n<li>Even small companies and individuals can invest in the project.<\/li>\n<li>The listing process lasts for days instead of years.<\/li>\n<li>The funding process is controlled in a decentralized manner, instead of by banks and lawyers.<\/li>\n<li>Investors are rewarded in months instead of years.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1012 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Differences_between_ICO_and_IPO.jpg.jpg\" alt=\"Main differences between an ICO and an IPO\" width=\"1024\" height=\"768\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Differences_between_ICO_and_IPO.jpg.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Differences_between_ICO_and_IPO.jpg-350x263.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Differences_between_ICO_and_IPO.jpg-500x375.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Differences_between_ICO_and_IPO.jpg-768x576.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Differences_between_ICO_and_IPO.jpg-600x450.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Differences_between_ICO_and_IPO.jpg-132x99.jpg 132w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><br \/>\nSo, if you have a project with great ambition and a proof of concept, you should run an ICO campaign on it!<\/p>\n<h2>How Does an ICO Work?<\/h2>\n<p>Picture this: a new startup company needs a monetary investment, and decides to launch their new project using an ICO campaign. First, it is necessary to create a plan in a white paper, to present the main idea of the campaign and set a roadmap. It should be emphasized what, exactly, will be needed in order for the project to work. Second, it should be clarified how much money will be spent on it, and the amount left over for the bounty campaign. It should be also noted which type of currency will be accepted. After these steps, it is important to set a time limit for the running of the campaign.<\/p>\n<p>To support a startup project, investors and enthusiasts of the initiative are eager to purchase tokens and will make an investment in the ICO launch. If the company collects the right amount of money in the time frame set in the white paper, they can initiate the next step in product realization, or fully complete it.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-980 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/How_ICO_works.jpg.jpg\" alt=\"How does the ICO work? Main aspects.\" width=\"716\" height=\"418\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/How_ICO_works.jpg.jpg 716w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/How_ICO_works.jpg-350x204.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/How_ICO_works.jpg-500x292.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/How_ICO_works.jpg-600x350.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/How_ICO_works.jpg-132x77.jpg 132w\" sizes=\"(max-width: 716px) 100vw, 716px\" \/><br \/>\nAs mentioned above, early financiers are highly interested in buying crypto-coins or tokens, hoping to translate them into a higher value if the plan is launched successfully. Capitalizations in the cryptocurrency market are constantly increasing. From the chart below, we can see the main tendencies in token capitalizations:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-981 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Cryptocurrency_market_capitalizations.jpg.png\" alt=\"Cryptocurrency market capitalizations in 2017\" width=\"800\" height=\"426\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Cryptocurrency_market_capitalizations.jpg.png 800w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Cryptocurrency_market_capitalizations.jpg-350x186.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Cryptocurrency_market_capitalizations.jpg-500x266.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Cryptocurrency_market_capitalizations.jpg-768x409.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Cryptocurrency_market_capitalizations.jpg-600x320.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Cryptocurrency_market_capitalizations.jpg-132x70.png 132w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h3>Examples of the Most Successful ICOs<\/h3>\n<p>A bright example of a profitable ICO project is the decentralized platform known as <strong><span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/www.ethereum.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Ethereum<\/a><\/span><\/strong>. The starting value of an invested Ether was $0.40, which went up to $14 in just one year’s time! The ICO period ran from July 20 to September 2, 2014, gathering $18,439,086 (USD) and 31,529.49 BTC, making a 3,900% profit!<\/p>\n<p><strong>Nxt<\/strong>, a blockchain system platform, is also worth mentioning. It enables users to issue cryptocurrency through their system and exchange it easily, in a decentralized way. Nxt gathered 21 Bitcoin worth $14k, for a profit of 199,900%. Unfortunately, due to poor marketing and distribution, only 73 people took part in the ICO campaign, illustrating one of the biggest drawbacks of early adoption.<\/p>\n<p><strong>Blockchain Stratis<\/strong>, which functions as a service platform, is another outstanding example of a beneficial ICO campaign. It enables various companies to create their own business sidechains. This ICO launch platform gathered a comparatively small amount of Bitcoin (915 BTC), but it has risen in value by 400%.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-982 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Successful_ICOs_table.jpg.png\" alt=\"Funds gathered by successful ICOs\" width=\"612\" height=\"289\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Successful_ICOs_table.jpg.png 612w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Successful_ICOs_table.jpg-350x165.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Successful_ICOs_table.jpg-500x236.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Successful_ICOs_table.jpg-600x283.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Successful_ICOs_table.jpg-132x62.png 132w\" sizes=\"(max-width: 612px) 100vw, 612px\" \/><\/p>\n<p>Having analyzed several examples of ICO launch platforms, we can see that small ICOs like <strong>Nxt<\/strong> and <strong>Stratis<\/strong> have better conditions in which to grow, but the underlying technology gives better results, as in the case of <strong>Ethereum<\/strong>.<\/p>\n<h3>Advantages of an ICO<\/h3>\n<p>The benefits of launching an ICO are obvious. One of the biggest advantages is that ICOs are transparent and open to the public. Anyone from the cryptocurrency market can take part in fundraising and transfer money. Due to the decentralized manner in which investors from various parts of the world can contribute funds and raise large sums in a short period of time, the ICO concept provides an opportunity for a wide range of projects.<br \/>\nOne of the greatest advantages is the fact that tokens can be bought at a low price, and eventually sold at a high profit. Let’s discuss the pros of investing to a new ICO.<\/p>\n<ul>\n<li>One of the biggest advantages is the actual chance of investing in future technology breakthroughs. Each ICO is unique and in some way revolutionary. It gives investors the opportunity to become part of it in the near future. It is necessary to investigate and analyze an ICO strategy in order to choose the most promising startup.<\/li>\n<li>As token prices are usually set modestly by ICO creators, even small investors or firms are able to take part in the sale and invest a little money. If the project goes well, the sums returned could be tremendous.<\/li>\n<li>ICOs usually stick to a principle, which enables cryptocoins to increase their value over time. Initial supporters of a project can leverage the principle guidelines and increase their chances of profit.<\/li>\n<li>Finally, it is a well-known fact that the modern cryptocurrency market is developing constantly. There is a great chance that bought currencies will be able to be used like Bitcoin to perform all kinds of payments.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2>Steps to Launch Your Own ICO Campaign<\/h2>\n<p>The <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/ico-consulting\/\" target=\"_blank\" rel=\"noopener noreferrer\">Launching an ICO<\/a><\/span> platform can be an easy and a difficult way to go. When considering and analyzing all the steps of an ICO launch, the team needs to make an important decision: which actions they can perform individually, and where they need to request additional help. It is a common fact that technical specialists come up with brilliant ideas, though it is no less significant to position them in an appealing way. This is where smart marketing, product positioning, and distribution contribute! In addition, a clever approach to documentation (writing terms and agreements) is crucial, as well. It all comes down to building a great team.<br \/>\nAre you ready for the details? Let’s examine your next steps!<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-1013 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg.jpg\" alt=\"Main steps to launch an ICO campaign\" width=\"651\" height=\"393\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg.jpg 651w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg-132x80.jpg 132w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg-350x211.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg-500x302.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg-600x362.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg-120x72.jpg 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Steps_to_launch_ICO.jpg-300x181.jpg 300w\" sizes=\"(max-width: 651px) 100vw, 651px\" \/><\/p>\n<h3>Come Up With an Idea!<\/h3>\n<p>The first thing a company must confront is their reason for conducting an ICO. Evaluate the pros of an ICO for your company, and figure out how, exactly, to merge cryptocurrency into your business. In other words, if you want to open a chain of fast-food restaurants, there won’t be an interest in token usage. The project idea has to interact with blockchain. It is essential to set clear campaign goals and explain them in an explicit manner. You need to attract future contributors and investors by showing them the valuable benefits of cooperation.<\/p>\n<h3>Build Up a Team<\/h3>\n<p>In order to launch the process in all aspects and start receiving investments in the short term, you&#8217;ll need to form an experienced team of specialists in different fields. One person cannot contribute thousands of hours into the project, so you will need to hire between 20 and 30 specialists. You will need to find content specialists, editors, PR specialists, designers, and IT specialists (programmers). In addition, all members must speak several languages, English being the main one. Transparency is highly valued. Moreover, investors trust people they know. Team members should have previous experience in working with cryptocurrencies. Provide your supporters with full information about your members: their photos, media profiles, and\/or portfolios.<\/p>\n<h3>Develop a Decent Back-End Infrastructure<\/h3>\n<p>At this stage, you have to create (build) a token, which will later be distributed to your financiers. In order to do so, it is essential to think up a token name; design its symbol; decide how many decimal places you will need; and, of course, determine the number of tokens you will issue into circulation. Decide what to do with unsold tokens (burn and issue refunds to investors or not), provide bonuses or dividends, decide upon a bounty campaign, and verify the currencies that investors will be able to contribute.<\/p>\n<h3>Prepare a White paper<\/h3>\n<p>Preparing a <em>white paper<\/em> is one of the most important steps in launching your ICO. This is a description of the technological, commercial, and funding principles of your campaign. Remember, this is not a program to write; you need to do your best to present the material simply and comprehensively to your reader.<br \/>\nA white paper includes the intentions and achievements you are envisioning from the project, ways of cooperating with users, the latest market news, and specifications on technological token implementation with the product in terms of economics.<br \/>\nLet’s consider the following essentials for writing a white paper:<\/p>\n<ul>\n<li>State the main problem of the ICO you are launching.<\/li>\n<li>Offer various solutions, and provide a detailed product description. Specify its main purpose, prototype information, terms of use, advantages, and necessity in the global market.<\/li>\n<li>Describe the token’s involvement in commerce. How does it interact with the economy? How will you use your tokens with respect to your product?<\/li>\n<li>Explain the cost division. It is a fact that only a certain part of the funds will be used for product realization. Therefore, you will need to identify all outgoing expenses and their purpose.<\/li>\n<li>Provide full information on your team members, advisors, and financiers. As we have stated above, it is a good idea to offer files, social page links, and portfolios of the participants.<\/li>\n<li>Suggest an expected plan for issuing tokens, and for the future progress of the project.<\/li>\n<\/ul>\n<p>A great example would be the white paper developed by the <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/ico.monetha.io\/\" target=\"_blank\" rel=\"noopener noreferrer\">Monetha<\/a><\/span> payment system for blockchain. It contains all of the necessary sections, with a detailed explanation of their working and fundraising plans, token economy, and team member profiles.<\/p>\n<h3><img loading=\"lazy\" class=\"aligncenter wp-image-987 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Monetha_whitepaper.jpg\" alt=\"A whitepaper developed by a Monetha payment system\" width=\"800\" height=\"919\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Monetha_whitepaper.jpg 800w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Monetha_whitepaper-305x350.jpg 305w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Monetha_whitepaper-435x500.jpg 435w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Monetha_whitepaper-768x882.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Monetha_whitepaper-600x689.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Monetha_whitepaper-96x110.jpg 96w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/h3>\n<h3>Prepare a Roadmap<\/h3>\n<p>The roadmap is meant to set realistic goals for your campaign. Illustrate your intentions step by step, by framing them into a timeline. This is what you will need to do:<\/p>\n<ul>\n<li>Release the white paper to the community. You can use various media websites or blogs, especially in the cryptocurrency environment.<\/li>\n<li>Clarify legal questions. The judicial aspect is very important, as it sets the primary rules and ensures investors of your loyalty.<\/li>\n<li>Set up a <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/blog\/technical-components-ico\" target=\"_blank\" rel=\"noopener noreferrer\">website<\/a><\/span> with a blog. This way, all your potential supporters will stay up to date on your latest news and will be able to keep in touch with you.<\/li>\n<li>Talk to exchange forums. Be aware of the latest currency tendencies.<\/li>\n<li>Send out newsletters. Keep your investors informed with weekly news, dates of investments reminders, and tutorial links.<\/li>\n<li>Perform crowdfunding. Raise the funds you need to launch your ICO.<\/li>\n<li>Provide security.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-988 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg.png\" alt=\"An example of an ICO roadmap\" width=\"3500\" height=\"2044\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg.png 3500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg-350x204.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg-500x292.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg-768x449.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg-1024x598.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg-600x350.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO_roadmap.jpg-132x77.png 132w\" sizes=\"(max-width: 3500px) 100vw, 3500px\" \/><br \/>\nIn considering the example of <span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/stratisplatform.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Stratis<\/a><\/span> development roadmap 2017-2018, we can see how they highlight their achievements and provide insight into their future product-realization plans.<\/p>\n<h3><img loading=\"lazy\" class=\"aligncenter wp-image-989 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg.jpg\" alt=\"Stratis development roadmap 2017-2018\" width=\"1054\" height=\"1024\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg.jpg 1054w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-113x110.jpg 113w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-350x340.jpg 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-500x486.jpg 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-768x746.jpg 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-1024x995.jpg 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-600x583.jpg 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-120x117.jpg 120w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Stratis_Roadmap_2017_2018.-jpg-300x291.jpg 300w\" sizes=\"(max-width: 1054px) 100vw, 1054px\" \/><\/h3>\n<h3>Provide Security<\/h3>\n<p>There always exists the risk of losing money for anyone investing in an ICO. A good idea would be to create an escrow wallet and present discounts to early project investors. To gain trust, guarantee monetary reimbursement in case the project fails. Maintain and manage the escrow account.<\/p>\n<h3>ICO Marketing<\/h3>\n<p>Believe it or not, just having a good idea is not enough! When<span style=\"color: #e70f00;\"> <a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/ico-marketing-services\/\" target=\"_blank\" rel=\"noopener noreferrer\">marketing<\/a> <\/span>your ICO, consider the following essentials:<\/p>\n<ol>\n<li>Have a clear idea of who your target customer is. In order to build a custom audience, you should examine all kinds of customer information, starting with basic characteristics and finishing with their main commercial interests.<\/li>\n<li>To make your campaign exceptional, offer a unique selling proposition. Show your benefits in various sales presentations, and highlight your company’s unique features that differentiate you from others.<\/li>\n<li>To elevate your marketing plan, use community-management strategies. Implementation of multi-channel marketing is crucial in the digital world. To receive investments in the short term, you will need to constantly keep in touch with all of your potential clients, and respond quickly. High activity in your community channels distinguishes your credibility compared with that of competitors.<\/li>\n<li>When launching an ICO,<em> social media management<\/em> (SMM) is another determinant of your marketing success. To promote your company and services, use channels like Slack, Telegram, Twitter, or certain threads on <a href=\"https:\/\/bitcointalk.org\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"color: #e70f00;\">Bitcointalk.org<\/span>.<\/a> If you want to conduct a social marketing strategy effectively and streamline your work process, you can also use specially-developed SMM tools such as Buffer, Hootsuite, Sprout Social, Agora Pulse, and others. These tools will help you schedule your posts, manage and monitor conversations, see your results, and find performance improvement recommendations.<\/li>\n<li>There exist certain incentive mechanisms to offer to your contributors and investors, such as discounts, premiums, and <em>bounty programs<\/em>. The latter motivates your users to promote the product in exchange for tokens in reward. The process is similar to barter trade. This means that a company may assign tokens in exchange for performing certain tasks, like writing articles and blog posts, or website translation.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h3>PR Campaign<\/h3>\n<p>In addition to marketing, a good <strong>PR campaign<\/strong> represents a significant part of your ICO launch platform. Share your plans, and offer participation in various forums and social pages. Make sure to communicate with people, answer their questions, and stay in touch.<br \/>\nExperience in launching an ICO campaign has shown that marketing and PR should be heavily invested in. This results in gathering larger sums of money. You should also distribute your ICO information on popular blogs, like Bitcoin Magazine, Coindesk, TokenMarket, and\/or Cointelegraph. Use any sources you can. Your main goal is to sell tokens in the first days of your launch.<\/p>\n<h3>Choose the Right ICO Platform<\/h3>\n<p>Last but not least, choose the right ICO launch platform. There are several ICO launch services you can use. Established platforms like Ethereum, Waves, NEM, or NOT provide tools and services to launch your ICO well.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-990 size-full\" src=\"http:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching.png\" alt=\"The example of ICO launch steps\" width=\"1700\" height=\"779\" srcset=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching.png 1700w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching-350x160.png 350w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching-500x229.png 500w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching-768x352.png 768w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching-1024x469.png 1024w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching-600x275.png 600w, https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/Example_of_steps_for_ICO_launching-132x60.png 132w\" sizes=\"(max-width: 1700px) 100vw, 1700px\" \/><br \/>\nIn general, it may take 11 to 12 months to launch your ICO, from coming up with your idea to finally launching it. Of course, this is all personal, and depends upon a number of different factors.<\/p>\n<h3>How to Set the Starting Price for a Token<\/h3>\n<p>One of the concerns you may deal with is how to properly give your tokens a starting price. This depends on the sum of money you eventually want to receive. Let’s imagine that you need to raise $60 million. This sum includes marketing and token launch expenses, development costs, and, of course, profits. The number of tokens you issue, for instance, could equal $200 million. Using mathematical estimation, we get $0.30 per token. Do not disregard the fact you should hold a certain number of tokens for your partners.<br \/>\nThe following structure is widely used in proper token distribution:<\/p>\n<ul>\n<li>Distribute 50% to the public.<\/li>\n<li>Share 25% with team members.<\/li>\n<li>Keep 25% for the future.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3>ICO Pricing Mechanisms<\/h3>\n<p>There are several pricing mechanisms to consider while launching your ICO platform:<\/p>\n<ol>\n<li>The developer may let investors take tokens equally (without selling them) according to their initial investment sum. Such a mechanism is called an <strong>Undermined Price ICO.<\/strong><\/li>\n<li>If you want to allow multiple token purchases for a certain price, choose the <strong>Fixed Price ICO<\/strong>. You can fix the price, then run a freezing period. Only after this point will investors have the chance to trade their tokens.<\/li>\n<li>A <strong>Dutch Auction ICO<\/strong> is another option to think about. You can start selling the most expensive tokens, and drop their price proportionally.<\/li>\n<li>An <strong>ICO with price rise<\/strong> works the opposite way. Fix the cost of the exchange rate for investors from the very beginning. This enables them to get their best price at an increasing rate.<\/li>\n<\/ol>\n<p>It is also common to save some money and purchase your own coins. As soon as the token launch process begins, you can purchase 50% of them, which will set a starting cryptocoin price.<br \/>\nAs a part of today’s blockchain community, it is of critical importance that you understand the place of cryptocurrency within it. Cryptocurrency is to be investigated, as it is in the development stage. Launching an initial coin offering can bring you great success. Nowadays, it is one of the best ways to raise funds for radically strong projects in the global market. Even though the method is somewhat new, it has proven promising and will be better developed in the future. So don’t lose your chance to become part of something bigger. Invest in your ideas, and give life to new startups! If you have any questions or need guidance, please feel free to<span style=\"color: #e70f00;\"><a style=\"color: #e70f00;\" href=\"https:\/\/applicature.com\/contact-us\/\" target=\"_blank\" rel=\"noopener noreferrer\"> contact the Applicature support team!<\/a><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever found yourself wondering what ICO actually means? How to launch an initial coin offering to collect money for your business idea? Let’s take a look at its main features. An ICO is a comparatively new experience in the modern economic community. Still, it has rapidly become one of the main topics of [&hellip;]<\/p>\n","protected":false},"author":12,"featured_media":173926,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[137],"tags":[154,176,215],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Launch an ICO: Everything You Need to Know<\/title>\n<meta name=\"description\" content=\"Launching an ICO can be easy and difficult. When considering the steps of an ICO launch, it is essential to wrap your idea correctly, build a competitive team, think up an effective strategy — and, of course, take care of all technical matters. Don&#039;t worry — we are here to guide you through the whole process!\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Launch an ICO: Everything You Need to Know\" \/>\n<meta property=\"og:description\" content=\"Launching an ICO can be easy and difficult. When considering the steps of an ICO launch, it is essential to wrap your idea correctly, build a competitive team, think up an effective strategy — and, of course, take care of all technical matters. Don&#039;t worry — we are here to guide you through the whole process!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/\" \/>\n<meta property=\"og:site_name\" content=\"Applicature\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/applicature\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-03-14T18:16:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T16:15:50+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO-LUNCH-3.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1100\" \/>\n\t<meta property=\"og:image:height\" content=\"550\" \/>\n<meta property=\"fb:app_id\" content=\"156197445002802\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/applicature.com\/#website\",\"url\":\"https:\/\/applicature.com\/\",\"name\":\"Applicature\",\"description\":\"Blockchain \/ Smart Contracts \/ Decentralized Apps\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/applicature.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/03\/ICO-LUNCH-4.png\",\"width\":1100,\"height\":575},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/#webpage\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/\",\"name\":\"How to Launch an ICO: Everything You Need to Know\",\"isPartOf\":{\"@id\":\"https:\/\/applicature.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/#primaryimage\"},\"datePublished\":\"2018-03-14T18:16:43+00:00\",\"dateModified\":\"2022-01-11T16:15:50+00:00\",\"author\":{\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/17f46426cb241f38a85a4789b6367bc1\"},\"description\":\"Launching an ICO can be easy and difficult. When considering the steps of an ICO launch, it is essential to wrap your idea correctly, build a competitive team, think up an effective strategy \\u2014 and, of course, take care of all technical matters. Don't worry \\u2014 we are here to guide you through the whole process!\",\"breadcrumb\":{\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/\",\"url\":\"https:\/\/applicature.com\/blog\/token-offerings\/how-to-launch-initial-coin-offering\/\",\"name\":\"How to Launch an Initial Coin Offering?\"}}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/applicature.com\/#\/schema\/person\/17f46426cb241f38a85a4789b6367bc1\",\"name\":\"Olga Hryniuk\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/applicature.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/applicature.com\/wp-content\/uploads\/2018\/11\/applicature-figure.png\",\"caption\":\"Olga Hryniuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/977"}],"collection":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/comments?post=977"}],"version-history":[{"count":0,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/posts\/977\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media\/173926"}],"wp:attachment":[{"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/media?parent=977"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/categories?post=977"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applicature.com\/wp-json\/wp\/v2\/tags?post=977"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}